{"id":12481,"date":"2017-04-19T12:00:49","date_gmt":"2017-04-19T17:00:49","guid":{"rendered":"https:\/\/www.highervisibility.com\/?p=12481"},"modified":"2021-08-26T10:50:02","modified_gmt":"2021-08-26T15:50:02","slug":"a-look-at-lsi","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/","title":{"rendered":"A Look at LSI"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><li><a href=\"#What_Is_Latent_Semantic_Indexing\"><span class=\"toc_number toc_depth_1\">1<\/span> What Is Latent Semantic Indexing?<\/a><\/li><li><a href=\"#Why_Do_We_Need_Latent_Semantic_Indexing\"><span class=\"toc_number toc_depth_1\">2<\/span> Why Do We Need Latent Semantic Indexing?<\/a><\/li><li><a href=\"#Who_Benefits_From_Latent_Semantic_Indexing\"><span class=\"toc_number toc_depth_1\">3<\/span> Who Benefits From Latent Semantic Indexing?<\/a><\/li><li><a href=\"#How_Does_Latent_Semantic_Indexing_Work\"><span class=\"toc_number toc_depth_1\">4<\/span> How Does Latent Semantic Indexing Work?<\/a><\/li><li><a href=\"#How_to_Optimize_for_Latent_Semantic_Indexing\"><span class=\"toc_number toc_depth_1\">5<\/span> How to Optimize for Latent Semantic Indexing<\/a><\/li><li><a href=\"#Find_LSI_keywords\"><span class=\"toc_number toc_depth_1\">6<\/span> Find LSI keywords<\/a><\/li><li><a href=\"#Method_No_1_Look_at_Googles_related_searches\"><span class=\"toc_number toc_depth_1\">7<\/span> Method No. 1: Look at Google’s “related searches”<\/a><\/li><li><a href=\"#Method_No_2_Look_at_Google_Keyword_Planner_ad_group_ideas\"><span class=\"toc_number toc_depth_1\">8<\/span> Method No. 2: Look at Google Keyword Planner ad group ideas<\/a><\/li><li><a href=\"#Method_No_3_Use_the_LSI_Keyword_Generator\"><span class=\"toc_number toc_depth_1\">9<\/span> Method No. 3: Use the LSI Keyword Generator<\/a><\/li><li><a href=\"#Method_No_4_Use_Ubersuggest\"><span class=\"toc_number toc_depth_1\">10<\/span> Method No. 4: Use Übersuggest<\/a><\/li><li><a href=\"#Select_the_best_LSI_keywords\"><span class=\"toc_number toc_depth_1\">11<\/span> Select the best LSI keywords<\/a><\/li><li><a href=\"#Use_LSI_keywords_on_your_webpage\"><span class=\"toc_number toc_depth_1\">12<\/span> Use LSI keywords on your webpage.<\/a><\/li><li><a href=\"#Infographic_A_Beginners_Guide_to_Latent_Semantic_Indexing\"><span class=\"toc_number toc_depth_1\">13<\/span> Infographic: A Beginner’s Guide to Latent Semantic Indexing<\/a><\/li><li><a href=\"#Fair_Use_Statement\"><span class=\"toc_number toc_depth_1\">14<\/span> Fair Use Statement<\/a><\/li><\/ul><\/div>\n<p>If you’re an SEO novice, the phrase “Latent Semantic Indexing” may sound like something only expert search engine marketers should use or understand. But the truth is that Latent Semantic Indexing isn’t as complicated as it sounds.<\/p>\n<p>Even SEO newbies that are beginning to learn <a href=\"https:\/\/www.highervisibility.com\/resource\/guide\/what-is-seo\/\">what SEO is<\/a>, can learn how to <a href=\"https:\/\/www.highervisibility.com\/seo-audit\/\">audit and optimize webpages<\/a> using this strategy. This post will explain how the process works, why it can benefit users and websites, and how to start implementing it step by step.<\/p>\n<h2><span id=\"What_Is_Latent_Semantic_Indexing\">What Is Latent Semantic Indexing?<\/span><\/h2>\n<p>To understand Latent Semantic Indexing, let’s start by looking at two important things that search engines do.<\/p>\n<p>Search engines use complex algorithms to understand:<\/p>\n<ul>\n<li>Content (what a page of content is about)<\/li>\n<li>Search Intent (what people want to find when they search for a specific term)<\/li>\n<\/ul>\n<p>Latent Semantic Indexing helps search engines accomplish these two tasks. It’s the part of the algorithm that identifies related words in content to better classify webpages and deliver more accurate search results.<\/p>\n<p>By processing synonyms and understanding the relationship between words, the algorithm can interpret webpages more deeply and, therefore, deliver the right content to searchers.<\/p>\n<h2><span id=\"Why_Do_We_Need_Latent_Semantic_Indexing\">Why Do We Need Latent Semantic Indexing?<\/span><\/h2>\n<p>Search engines do not process information the same way humans do. Humans use context, language processing, and association to understand language.<\/p>\n<p>We understand that we’re talking about smartphones if the words “iPhone,” “apps,” and “data package” are used. We don’t need to hear the word “smartphone” to understand this is what the information is about.<\/p>\n<p>On the other hand, search engines work differently. They use keywords to tell them what information is about. So even if a piece of information uses terms related to the main topic, search engines may have trouble recognizing this.<\/p>\n<p>Latent Semantic Indexing resolves this by providing the extra context search engines need to recognize topics in web content.<\/p>\n<h2><span id=\"Who_Benefits_From_Latent_Semantic_Indexing\">Who Benefits From Latent Semantic Indexing?<\/span><\/h2>\n<p>Additional and more accurate categorization benefits users, publishers, and marketers.<\/p>\n<ul>\n<li>Search engines can provide more useful and relevant search results because they can decipher language and classify topics based on synonyms and related terms.<\/li>\n<li>Marketers can improve their search rankings by adjusting their keywords to use Latent Semantic Indexing best practices.<\/li>\n<li>Publishers can connect with a more engaged audience because their content is more targeted and able to connect with the correct users.<\/li>\n<li>Searchers can more easily find the content that matches their needs and wants.<\/li>\n<\/ul>\n<h2><span id=\"How_Does_Latent_Semantic_Indexing_Work\">How Does Latent Semantic Indexing Work?<\/span><\/h2>\n<p>Latent Semantic Indexing uses LSI keywords to build associations and connections in content.<\/p>\n<p>LSI keywords are terms that are semantically related to the main keyword. A webpage with the main keyword “smartphones” may have the LSI keywords “iPhone,” “apps,” and “data package.”<\/p>\n<p>The terms are secondary keywords that provide additional context for a webpage. Latent Semantic Indexing works when search engines process these extra keywords to give more meaning and context to a page.<\/p>\n<p>Marketers and publishers can optimize webpages by using LSI keywords to send better, more accurate signals to search engines.<\/p>\n<h2><span id=\"How_to_Optimize_for_Latent_Semantic_Indexing\">How to Optimize for Latent Semantic Indexing<\/span><\/h2>\n<p>Now that you understand how Latent Semantic Indexing works and why it’s important, let’s look at how you can use LSI keywords in website content and blog posts.<\/p>\n<h2><span id=\"Find_LSI_keywords\">Find LSI keywords<\/span><\/h2>\n<p>First, start by identifying potential LSI keyword options for your post. There are a few different methods and tools for finding LSI keywords.<\/p>\n<h2><span id=\"Method_No_1_Look_at_Googles_related_searches\">Method No. 1: Look at Google’s “related searches”<\/span><\/h2>\n<p>The first and easiest method is using Google search results to find keywords related to your target term.<\/p>\n<p>Enter your primary keyword in Google search and look at the “Searches related to” the keyword. Use the list of keywords as your potential LSI keywords.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-9801 aligncenter\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/searches-related-to-gardening.png\" alt=\"Searches related to gardening\" width=\"388\" height=\"184\" \/><\/p>\n<p>Because Google associates these related terms to your primary keyword, these phrases are good options for LSI keywords.<\/p>\n<h2><span id=\"Method_No_2_Look_at_Google_Keyword_Planner_ad_group_ideas\">Method No. 2: Look at Google Keyword Planner ad group ideas<\/span><\/h2>\n<p>Another way to use Google to find LSI keywords is through their Keyword Planner tool.<\/p>\n<p>Create a Google Adwords account. (This can be tied to any existing Google account.) Enter your keyword into the Keyword Planner.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-9798 aligncenter\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/keyword-planner.png\" alt=\"keyword planner guide\" width=\"486\" height=\"301\" \/><\/p>\n<p>Select the tab to view “Ad group ideas.” Choose an ad group that relates to your content’s topic.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-9796 aligncenter\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ad-group-ideas.png\" alt=\"ad group ideas\" width=\"469\" height=\"330\" \/><\/p>\n<p>If possible, select an ad group that has a high volume of average monthly searches and low competition. This indicates that a lot of users are searching for the term and that there are few brands competing to rank for the terms.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-9797 aligncenter\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ad-group.png\" alt=\"ad group example\" width=\"340\" height=\"568\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ad-group.png 340w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ad-group-299x500.png 299w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ad-group-239x400.png 239w\" sizes=\"(max-width: 340px) 100vw, 340px\" \/><\/p>\n<p>This list indicates that Google categorizes these terms together, so use the phrases as potential LSI keywords.<\/p>\n<h2><span id=\"Method_No_3_Use_the_LSI_Keyword_Generator\">Method No. 3: Use the LSI Keyword Generator<\/span><\/h2>\n<p>The LSI Graph or <a href=\"http:\/\/lsigraph.com\/\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">LSI Keyword Generator<\/a> is a free tool specifically created for identifying LSI keywords.<br \/>\n<img loading=\"lazy\" class=\"size-full wp-image-9799 aligncenter\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/lsi-graph-1.png\" alt=\"LSI Generator\" width=\"556\" height=\"326\" \/><\/p>\n<p>Simply enter your keyword into the tool to produce a long list of potential LSI keywords. Unlike the two Google LSI research methods, the generator may provide a long list of options. So, it will require more consideration when choosing the best keywords for your specific piece of content.<\/p>\n<h2><span id=\"Method_No_4_Use_Ubersuggest\">Method No. 4: Use Übersuggest<\/span><\/h2>\n<p>Another free tool that aids in LSI keyword research is <a href=\"https:\/\/chrome.google.com\/webstore\/detail\/ubersuggest-seo-and-keywo\/nmpgaoofmjlimabncmnmnopjabbflegf?hl=en\" target=\"_blank\" rel=\"noopener noreferrer nofollow\">Übersuggest<\/a>. You enter your primary keyword, and the tool will produce a list of related search terms that begin with your keyword.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-9803 aligncenter\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ubersuggest.png\" alt=\"Ubersuggest example\" width=\"504\" height=\"147\" \/><\/p>\n<p>The tool offers the most popular suggestions for what will come after your primary keyword. The report lists the most popular terms at the top and then goes on to list suggestions for every letter and number that follows your key term.<\/p>\n<p><img loading=\"lazy\" class=\"size-full wp-image-9802 aligncenter\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ubbersugest-results-1-1.png\" alt=\"Ubersuggest results\" width=\"515\" height=\"628\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ubbersugest-results-1-1.png 515w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ubbersugest-results-1-1-410x500.png 410w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/ubbersugest-results-1-1-328x400.png 328w\" sizes=\"(max-width: 515px) 100vw, 515px\" \/><\/p>\n<p>This is also a lengthy list that you will need to sort through to find the best LSI keywords for your webpage.<\/p>\n<h2><span id=\"Select_the_best_LSI_keywords\">Select the best LSI keywords<\/span><\/h2>\n<p>Once you have a list of potential LSI keywords, determine the terms that will fit best into your content. Take your list of keywords and use the following factors to determine the most useful phrases.<\/p>\n<p><strong>Consider relevancy to the topic.<\/strong> The purpose of LSI keywords is to add context to the content. Choose terms that are closely related to the topic, not just the keyword.<\/p>\n<p>For example, if your keyword is “gardening” and the post title is “Gardening Vegetables in Small Spaces: 10 Tips You Need to Know,” don’t choose the LSI keyword “gardening fruits.”<\/p>\n<p>Even if “gardening fruits” is a suggested similar search, it is not relevant to the topic. It is not a term that would drive the right audience to the article.<\/p>\n<p><strong>Consider the intent of the searcher.<\/strong> Put yourself in the position of the searcher and consider the intent of their search. Ask yourself why they are searching for the term.<\/p>\n<ul>\n<li>Do they have informational intent? Informational intent is when a searcher is seeking out information about the topic.<\/li>\n<li>Do they have navigational intent? Navigational intent is when a searcher is seeking out a specific brand, website, business, or product by using search.<\/li>\n<li>Do they have transactional intent? Transactional intent is when a searcher is looking for something because they want to purchase it.<\/li>\n<\/ul>\n<p>By identifying the intent of searchers, you can eliminate phrases that don’t match their goals.<\/p>\n<p>For example, users who could benefit from “Gardening Vegetables in Small Spaces: 10 Tips You Need to Know” would have informational intent.<\/p>\n<p>They are not looking to make a purchase or find a specific product or brand. So, you can rule out terms like “gardening stores near me” and “purchase vegetable gardening tools.”<\/p>\n<p><strong>Don’t get distracted by high-performing, unrelated keywords.<\/strong> It’s important to keep the last two tips in mind as you choose your LSI keywords. Because, in your keyword research, you may come across appealing, high-performing keywords that look as though they will be a benefit to your post.<\/p>\n<p>But remember, it’s not just about attracting people to your page. It’s about attracting the right people to your page.<\/p>\n<p>A smaller amount of targeted traffic that reaches your page and finds what they are looking for is more valuable than a large amount of traffic that reaches your page, doesn’t like what they see, and quickly clicks out of the page.<\/p>\n<p>Stay focused and choose terms that will lead your ideal audience to your page.<\/p>\n<h2><span id=\"Use_LSI_keywords_on_your_webpage\">Use LSI keywords on your webpage.<\/span><\/h2>\n<p>After you select the best LSI keywords for your content, weave them into your page through the following strategies.<\/p>\n<p><strong>Use LSI keywords naturally in the content<\/strong>. If you picked the right LSI keywords, it should be easy to weave them into your content because they relate to your topic. A good strategy is to write your post as you would normally, and then go back through and replace synonyms with LSI keywords.<\/p>\n<p><strong>Don’t keyword stuff.<\/strong> Don’t overuse LSI keywords or stuff them in places where they don’t belong. Keyword stuffing can actually have a negative SEO impact on your post. Only use each LSI keyword once or twice as they fit naturally.<\/p>\n<p><strong>Stick to the main topic.<\/strong> The point of LSI keywords is to provide additional context to a page so search engines can better recognize the topic. Don’t try to squeeze in unrelated but high-performing keywords by adding sections of text that don’t relate to the main topic.<\/p>\n<p><strong>Place in appropriate page elements.<\/strong> When possible, use LSI keywords in page elements that help search engines understand the page. It is beneficial to use them in:<\/p>\n<ul>\n<li>Meta title tags<\/li>\n<li>Meta descriptions<\/li>\n<li>Header tags<\/li>\n<li>Permalinks<\/li>\n<li>Subheadings<\/li>\n<li>Anchor text that point to the page<\/li>\n<\/ul>\n<p><strong>Stay focused on your primary keyword.<\/strong> As you go through steps to optimize your post or page for LSI keywords, remember that your primary keyword is the priority. If given the option to use only your primary keyword or an LSI keyword in a page element – choose the primary keyword.<\/p>\n<p>Latent Semantic Indexing benefits readers, publishers, marketers, and search engines. It helps readers more easily find what they want, and it helps publishers get the right eyes on their content. It boosts SEO value for well-written, valuable pages and improves the accuracy of search engine results.<\/p>\n<p>And despite the complicated sounding name, Latent Semantic Indexing is not as complex as it sounds.<\/p>\n<p>By going through the steps outlined in this post, you can use LSI keywords to optimize your pages and posts, so they can connect and resonate more deeply with readers and search engine crawlers.<\/p>\n<p>Have you tried incorporating Latent Semantic Indexing into your SEO? Did we miss a tip that has helped you identify or use LSI keywords in your content? Let us know in the comments below.<\/p>\n<h2><span id=\"Infographic_A_Beginners_Guide_to_Latent_Semantic_Indexing\">Infographic: A Beginner’s Guide to Latent Semantic Indexing<\/span><\/h2>\n<p><img loading=\"lazy\" class=\"alignnone size-full wp-image-9794\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/A_beginners_guide_to_use_LSI_op1.png\" alt=\"A Beginners Guide to LSI\" width=\"800\" height=\"4827\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/A_beginners_guide_to_use_LSI_op1.png 800w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/A_beginners_guide_to_use_LSI_op1-83x500.png 83w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/A_beginners_guide_to_use_LSI_op1-768x4634.png 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h2><span id=\"Fair_Use_Statement\">Fair Use Statement<\/span><\/h2>\n<p>Please use this information and graphics in this article for noncommercial use only. When doing so, please make sure to attribute the authors by linking back to this page.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 What Is Latent Semantic Indexing?2 Why Do We Need Latent Semantic Indexing?3 Who Benefits From Latent Semantic Indexing?4 How Does Latent Semantic Indexing Work?5 How to Optimize for Latent Semantic Indexing6 Find LSI keywords7 Method No. 1: Look at Google’s “related searches”8 Method No. 2: Look at Google Keyword Planner ad group ideas9 Method [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3056,3058],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>What is Latent Semantic Indexing (LSI)? | HigherVisibility<\/title>\n<meta name=\"description\" content=\"Explanation of how Latent Semantic Indexing (LSI) works, why it can benefit users and websites, and how to start implementing it step by step.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A Look at LSI\" \/>\n<meta property=\"og:description\" content=\"Explanation of how Latent Semantic Indexing (LSI) works, why it can benefit users and websites, and how to start implementing it step by step.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2017-04-19T17:00:49+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-26T15:50:02+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/searches-related-to-gardening.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam Heitzman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/searches-related-to-gardening.png\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/searches-related-to-gardening.png\",\"width\":388,\"height\":184,\"caption\":\"Searches related to gardening\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/\",\"name\":\"What is Latent Semantic Indexing (LSI)? | HigherVisibility\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#primaryimage\"},\"datePublished\":\"2017-04-19T17:00:49+00:00\",\"dateModified\":\"2021-08-26T15:50:02+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\"},\"description\":\"Explanation of how Latent Semantic Indexing (LSI) works, why it can benefit users and websites, and how to start implementing it step by step.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"A Look at LSI\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\",\"name\":\"Adam Heitzman\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"caption\":\"Adam Heitzman\"},\"description\":\"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.\",\"url\":\"https:\/\/www.highervisibility.com\/author\/aheitzman\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"What is Latent Semantic Indexing (LSI)? | HigherVisibility","description":"Explanation of how Latent Semantic Indexing (LSI) works, why it can benefit users and websites, and how to start implementing it step by step.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/","og_locale":"en_US","og_type":"article","og_title":"A Look at LSI","og_description":"Explanation of how Latent Semantic Indexing (LSI) works, why it can benefit users and websites, and how to start implementing it step by step.","og_url":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2017-04-19T17:00:49+00:00","article_modified_time":"2021-08-26T15:50:02+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/searches-related-to-gardening.png"}],"twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Adam Heitzman","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/searches-related-to-gardening.png","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/02\/searches-related-to-gardening.png","width":388,"height":184,"caption":"Searches related to gardening"},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/","name":"What is Latent Semantic Indexing (LSI)? | HigherVisibility","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#primaryimage"},"datePublished":"2017-04-19T17:00:49+00:00","dateModified":"2021-08-26T15:50:02+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936"},"description":"Explanation of how Latent Semantic Indexing (LSI) works, why it can benefit users and websites, and how to start implementing it step by step.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/a-look-at-lsi\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"A Look at LSI"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936","name":"Adam Heitzman","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","caption":"Adam Heitzman"},"description":"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.","url":"https:\/\/www.highervisibility.com\/author\/aheitzman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/12481"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=12481"}],"version-history":[{"count":2,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/12481\/revisions"}],"predecessor-version":[{"id":16873,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/12481\/revisions\/16873"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=12481"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=12481"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=12481"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}