{"id":12491,"date":"2017-01-27T08:14:49","date_gmt":"2017-01-27T14:14:49","guid":{"rendered":"https:\/\/www.highervisibility.com\/?p=12491"},"modified":"2021-08-25T17:08:31","modified_gmt":"2021-08-25T22:08:31","slug":"platform-specific-seo-best-practices-guide","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/","title":{"rendered":"Platform-Specific SEO Best Practices Guide"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><li><a href=\"#GUIDE_TO_FACEBOOK_SEO_OPTIMIZATION\"><span class=\"toc_number toc_depth_1\">1<\/span> GUIDE TO FACEBOOK SEO OPTIMIZATION<\/a><\/li><li><a href=\"#CREATE_A_VANITY_URL\"><span class=\"toc_number toc_depth_1\">2<\/span> CREATE A VANITY URL<\/a><\/li><li><a href=\"#FACEBOOK_PAGE_TITLE\"><span class=\"toc_number toc_depth_1\">3<\/span> FACEBOOK PAGE TITLE<\/a><\/li><li><a href=\"#COMPLETE_YOUR_PROFILE\"><span class=\"toc_number toc_depth_1\">4<\/span> COMPLETE YOUR PROFILE<\/a><\/li><li><a href=\"#ENGAGE_YOUR_AUDIENCE\"><span class=\"toc_number toc_depth_1\">5<\/span> ENGAGE YOUR AUDIENCE<\/a><\/li><li><a href=\"#GUIDE_TO_YELP_SEO_OPTIMIZATION\"><span class=\"toc_number toc_depth_1\">6<\/span> GUIDE TO YELP SEO OPTIMIZATION<\/a><\/li><li><a href=\"#CLAIM_YOUR_BUSINESS_PAGE\"><span class=\"toc_number toc_depth_1\">7<\/span> CLAIM YOUR BUSINESS PAGE<\/a><\/li><li><a href=\"#COMPLETE_YOUR_PROFILE-2\"><span class=\"toc_number toc_depth_1\">8<\/span> COMPLETE YOUR PROFILE<\/a><\/li><li><a href=\"#NEW_REVIEWS\"><span class=\"toc_number toc_depth_1\">9<\/span> NEW REVIEWS<\/a><\/li><li><a href=\"#ADD_PHOTOS\"><span class=\"toc_number toc_depth_1\">10<\/span> ADD PHOTOS<\/a><\/li><li><a href=\"#GUIDE_TO_PINTEREST_SEO_OPTIMIZATION\"><span class=\"toc_number toc_depth_1\">11<\/span> GUIDE TO PINTEREST SEO OPTIMIZATION<\/a><\/li><li><a href=\"#OPTIMIZE_BOARD_NAMES\"><span class=\"toc_number toc_depth_1\">12<\/span> OPTIMIZE BOARD NAMES<\/a><\/li><li><a href=\"#DON8217T_NEGLECT_THE_DESCRIPTIONS\"><span class=\"toc_number toc_depth_1\">13<\/span> DON&#8217;T NEGLECT THE DESCRIPTIONS<\/a><\/li><li><a href=\"#DO_EXTRA_KEYWORD_RESEARCH\"><span class=\"toc_number toc_depth_1\">14<\/span> DO EXTRA KEYWORD RESEARCH<\/a><\/li><li><a href=\"#GUIDE_TO_ETSY_SEO_OPTIMIZATION\"><span class=\"toc_number toc_depth_1\">15<\/span> GUIDE TO ETSY SEO OPTIMIZATION<\/a><\/li><li><a href=\"#OPTIMIZE_PRODUCT_LISTING_TITLES\"><span class=\"toc_number toc_depth_1\">16<\/span> OPTIMIZE PRODUCT LISTING TITLES<\/a><\/li><li><a href=\"#CREATE_COMPELLING_PRODUCT_DESCRIPTIONS\"><span class=\"toc_number toc_depth_1\">17<\/span> CREATE COMPELLING PRODUCT DESCRIPTIONS<\/a><\/li><li><a href=\"#IMPROVE_EXPOSURE_WITH_BETTER_SERVICE\"><span class=\"toc_number toc_depth_1\">18<\/span> IMPROVE EXPOSURE WITH BETTER SERVICE<\/a><\/li><li><a href=\"#GUIDE_TO_GOOGLE_MY_BUSINESS_OPTIMIZATION\"><span class=\"toc_number toc_depth_1\">19<\/span> GUIDE TO GOOGLE MY BUSINESS OPTIMIZATION<\/a><\/li><li><a href=\"#CLAIM_YOUR_BUSINESS_LISTING\"><span class=\"toc_number toc_depth_1\">20<\/span> CLAIM YOUR BUSINESS LISTING<\/a><\/li><li><a href=\"#CUSTOMIZE_YOUR_INFORMATION\"><span class=\"toc_number toc_depth_1\">21<\/span> CUSTOMIZE YOUR INFORMATION<\/a><\/li><li><a href=\"#GROW_YOUR_REVIEWS\"><span class=\"toc_number toc_depth_1\">22<\/span> GROW YOUR REVIEWS<\/a><\/li><li><a href=\"#CREATE_A_VISUAL_EXPERIENCE\"><span class=\"toc_number toc_depth_1\">23<\/span> CREATE A VISUAL EXPERIENCE<\/a><\/li><li><a href=\"#CONCLUSION\"><span class=\"toc_number toc_depth_1\">24<\/span> CONCLUSION<\/a><\/li><li><a href=\"#FAIR_USE\"><span class=\"toc_number toc_depth_1\">25<\/span> FAIR USE<\/a><\/li><li><a href=\"#METHODOLOGY\"><span class=\"toc_number toc_depth_1\">26<\/span> METHODOLOGY<\/a><\/li><\/ul><\/div>\n<p>When most business owners think about social media, they tend to focus on relationship building, direct customer engagement, content sharing, customer service, and attracting new customers.<\/p>\n<p>These are all good reasons to invest in social media given its widespread use. In 2016, <a href=\"https:\/\/www.statista.com\/statistics\/273476\/percentage-of-us-population-with-a-social-network-profile\/\" target=\"_blank\" rel=\"nofollow\">over 75 percent of Americans<\/a> had a social media account.<strong> By 2018, it’s estimated that nearly <a href=\"https:\/\/www.statista.com\/statistics\/273476\/percentage-of-us-population-with-a-social-network-profile\/\" target=\"_blank\" rel=\"nofollow\">2.5 billion people<\/a> will be using social media worldwide.<\/strong><\/p>\n<p>You can bet your customers are in that mix.<\/p>\n<p>As <a href=\"http:\/\/www.gallup.com\/poll\/195986\/consumer-spending-highest-september-2008.aspx\" target=\"_blank\" rel=\"nofollow\">consumer spending continues to rise<\/a>, with annual e-commerce spending alone growing at <a href=\"http:\/\/www.census.gov\/retail\/index.html\" target=\"_blank\" rel=\"nofollow\">15 percent on average<\/a> since 2008, competition for businesses continues to grow – especially in online retail. It’s more <a href=\"https:\/\/www.highervisibility.com\/blog\/why-is-seo-important\/\">important<\/a> than ever to optimize your online presence, so your brand stands out among competitors.<\/p>\n<p>When properly optimized, your social media profiles and business pages will start to appear in search results. Add them together, and <strong>you can have a significant share of the page-one real estate in organic search results.<\/strong><\/p>\n<p>Whether you’re growing a local business or selling through online channels, this online and <a href=\"https:\/\/www.highervisibility.com\/local-seo-company\/\">local SEO<\/a> cheat sheet will give you a breakdown of the most critical elements to optimize. Keep reading to learn more.<\/p>\n<p>To view a specific section:<\/p>\n<ul>\n<li><a href=\"#facebook\">Facebook<\/a><\/li>\n<li><a href=\"#yelp\">Yelp<\/a><\/li>\n<li><a href=\"#pinterest\">Pinterest<\/a><\/li>\n<li><a href=\"#etsy\">Etsy<\/a><\/li>\n<li><a href=\"#google\">Google My Business<\/a><\/li>\n<\/ul>\n<h2><span id=\"GUIDE_TO_FACEBOOK_SEO_OPTIMIZATION\"><a name=\"facebook\"><\/a><strong>GUIDE TO FACEBOOK SEO OPTIMIZATION<\/strong><\/span><\/h2>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_1.jpg\" alt=\"Guide to Facebook Optimization\" width=\"800\" height=\"646\" \/><\/p>\n<p>By mid-2016, Facebook had surpassed <a href=\"http:\/\/venturebeat.com\/2016\/04\/27\/facebook-passes-1-65-billion-monthly-active-users-54-access-the-service-only-on-mobile\/\" target=\"_blank\" rel=\"nofollow\">1.6 billion active monthly users<\/a>. The website has become one of the largest social media networks used by both businesses and consumers. Facebook now sees more than <a href=\"https:\/\/techcrunch.com\/2016\/07\/27\/facebook-will-make-you-talk\/\" target=\"_blank\" rel=\"nofollow\">2 billion searches per day<\/a> as consumers look up information on friends and family, personal interests, and businesses they are thinking about shopping at.<\/p>\n<p>By 2014, <a href=\"https:\/\/www.ninthdecimal.com\/wp-content\/uploads\/2014\/09\/ND_Insights_Q2_2014.pdf\" target=\"_blank\" rel=\"nofollow\">81 percent<\/a> of shoppers were using search engines to conduct research before making a purchase. Today, those searches have expanded to social channels. With that kind of growth in search volume, just having a presence on Facebook isn’t enough. You need to optimize that content to stand out among the more than <a href=\"http:\/\/expandedramblings.com\/index.php\/facebook-page-statistics\/\" target=\"_blank\" rel=\"nofollow\">60 million business pages<\/a>.<\/p>\n<h2><span id=\"CREATE_A_VANITY_URL\">CREATE A VANITY URL<\/span><\/h2>\n<p>Once your page reaches 25 likes, you’re able to go into the page settings and create a unique and custom username for your Facebook URL. The URL optimization is a ranking factor and can impact organic visibility for your Facebook page. Here are a few things to keep in mind when creating your custom URL:<\/p>\n<ul>\n<li>Create a username that is as close as possible to your business name, brand, or identity of your public figure.<\/li>\n<li>Usernames cannot be transferred or changed, so choose one that you’ll use long term.<\/li>\n<li>If you’re not using your brand name, use keywords your audience might use when searching.<\/li>\n<\/ul>\n<h2><span id=\"FACEBOOK_PAGE_TITLE\">FACEBOOK PAGE TITLE<\/span><\/h2>\n<p>Your page name doubles as the page title. This is displayed at the top of the page or tab of the browser and is also served to the user in the search results as a meta title.<\/p>\n<p>Use a brandable or memorable name for your Facebook page, and think strategically. The first word of your page title is considered to be the most significant.<\/p>\n<h2><span id=\"COMPLETE_YOUR_PROFILE\">COMPLETE YOUR PROFILE<\/span><\/h2>\n<p>There aren’t too many places to plug in optimized content on your Facebook page, so make the best use of the areas you have available. Completely fill out the “About” section.<\/p>\n<p>Don’t just try to optimize it for search; make a connection with your audience as well. Emphasize who you are, and focus on the value proposition. Remember that you’re trying to convert the visitor who reads the information as much as you’re trying to improve your overall exposure.<\/p>\n<h2><span id=\"ENGAGE_YOUR_AUDIENCE\">ENGAGE YOUR AUDIENCE<\/span><\/h2>\n<p>Likes, comments, shares, and other engagement don’t directly impact your organic search rank within Facebook. Still, audience engagement is important because it will increase exposure among the feeds of your fans.<\/p>\n<p>Talking about relevant topics to your audience can also help with internal search. If your fans are looking for specific discussions, there’s a chance for your public posts, hashtags, and comments to appear within Facebook’s search results.<\/p>\n<h2><span id=\"GUIDE_TO_YELP_SEO_OPTIMIZATION\"><a name=\"yelp\"><\/a><strong>GUIDE TO YELP SEO OPTIMIZATION<\/strong><\/span><\/h2>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_2.jpg\" alt=\"Guide to Yelp optimization\" width=\"800\" height=\"1074\" \/><\/p>\n<p>While the restaurant industry is one of the most prevalent on the site, Yelp remains one of the most trusted review sites for local businesses. Used by roughly <a href=\"http:\/\/expandedramblings.com\/index.php\/yelp-statistics\/\" target=\"_blank\" rel=\"nofollow\">145 million monthly unique visitors<\/a>, it’s smart to leverage Yelp to lift visibility and create a hub for positive (and even negative) customer reviews.<\/p>\n<p>It’s relatively simple to claim and optimize a listing on Yelp. Once completed, maintenance takes even less time.<\/p>\n<h2><span id=\"CLAIM_YOUR_BUSINESS_PAGE\">CLAIM YOUR BUSINESS PAGE<\/span><\/h2>\n<p>Before you can customize and add content to your business listing, you need to claim it. If your business isn’t listed, you can add it to Yelp. If you do find a listing for your business, click to start the claim process.<\/p>\n<p>There’s a brief delay to verify your identity when claiming and listing businesses on Yelp, but it’s a short process and ensures that people aren’t wrongfully claiming businesses they don’t own.<\/p>\n<h2><span id=\"COMPLETE_YOUR_PROFILE-2\">COMPLETE YOUR PROFILE<\/span><\/h2>\n<p>Filling in your company info is the most important step once your business is claimed and verified. There’s plenty of information to add for the benefit of the customers, which can also be optimized to help you with local search visibility. Like any other page, the right kind of optimization can help your Yelp listing show up in organic search results.<\/p>\n<h2><span id=\"NEW_REVIEWS\">NEW REVIEWS<\/span><\/h2>\n<p>The <a href=\"https:\/\/moz.com\/blog\/google-fresh-factor-new\" target=\"_blank\" rel=\"nofollow\">freshness score of content<\/a> is one of the many ranking factors used by Google. Their goal is to serve up the most current and most relevant content around a user’s search query. This makes it much easier to get listings, like those on Yelp, to the top of the search results.<\/p>\n<p>Encourage your customers to leave reviews on Yelp, as new reviews update the freshness of the page.<\/p>\n<h2><span id=\"ADD_PHOTOS\">ADD PHOTOS<\/span><\/h2>\n<p>Don’t forget to add photos to your business listing on Yelp. While photos may not directly impact your search rank, they do impact user engagement. The more high-quality photos you have, the more interesting and engaging your listing is going to be.<\/p>\n<p><a href=\"https:\/\/www.reviewtrackers.com\/blog\/yelp-factsheet\/\" target=\"_blank\" rel=\"nofollow\">According to research from Review Trackers<\/a>, consumers devote as much as 2.5 times more attention to a Yelp business page containing photos than those without. That increased engagement could encourage additional reviews, ultimately adding to the lift in search visibility.<\/p>\n<h2><span id=\"GUIDE_TO_PINTEREST_SEO_OPTIMIZATION\"><a name=\"pinterest\"><\/a><strong>GUIDE TO PINTEREST SEO OPTIMIZATION<\/strong><\/span><\/h2>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_3.jpg\" alt=\"Guide to Pinterest optimization\" width=\"800\" height=\"650\" \/><\/p>\n<p>Pinterest has come a long way in recent years. What was once just a trendy social network often used by do-it-yourselfers has become a powerful visual search engine that is leveraged by some of the largest brands around the world.<\/p>\n<p>But just because it’s predominantly visual doesn’t mean there aren’t opportunities to optimize the social profile and content. <a href=\"http:\/\/www.adweek.com\/socialtimes\/pinterest-online-sales\/464308\" target=\"_blank\" rel=\"nofollow\">One study of Shopify users<\/a> found that customers referred by Pinterest spend an average of $80, compared to the Facebook referral average of just $40.<\/p>\n<h2><span id=\"OPTIMIZE_BOARD_NAMES\">OPTIMIZE BOARD NAMES<\/span><\/h2>\n<p>Optimize boards by using a mix of creativity and strategy. You should try to be creative and witty to make the boards more engaging and catchy for your audience, but you also want to keep keywords and phrases in mind to make it easier for users to discover your content through organic search.<\/p>\n<p>Whatever you choose to identify your boards, make sure you’re specific. You don’t want a user to have to guess at the kind of content within your boards.<\/p>\n<p>For example, don’t just call a pin board “Recipes.” Break through the clutter with specifics like “Summer Vegetarian Recipes” or “Cold Weather Soup Recipes.”<\/p>\n<h2><span id=\"DON8217T_NEGLECT_THE_DESCRIPTIONS\">DON&#8217;T NEGLECT THE DESCRIPTIONS<\/span><\/h2>\n<p>Every pin should have an optimized description using searchable keywords that describe the image, product, or page you’ve pinned. While this is one of the best opportunities to optimize Pinterest content, you have to be careful not to spam.<\/p>\n<p>Optimize for your audience first, and type a good descriptive caption for your pin. You can always adjust and <a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">optimize for the search engines<\/a> after you’ve optimized it for the user.<\/p>\n<h2><span id=\"DO_EXTRA_KEYWORD_RESEARCH\">DO EXTRA KEYWORD RESEARCH<\/span><\/h2>\n<p>You may have already performed keyword research using external tools, but it’s a good idea to extend that research to Pinterest. One of the best ways to find the right keyword variations is to perform searches, testing out which kind of content shows up within Pinterest and how it is organized in the results.<\/p>\n<p>Analyze the results to see which keyword variations are a better match to your content and discover variations you can use to optimize your pins further.<\/p>\n<h2><span id=\"GUIDE_TO_ETSY_SEO_OPTIMIZATION\"><a name=\"etsy\"><\/a><strong>GUIDE TO ETSY SEO OPTIMIZATION<\/strong><\/span><\/h2>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_4.jpg\" alt=\"Guide to Etsy optimization\" width=\"800\" height=\"892\" \/><\/p>\n<p>Etsy has grown to be a major contender in the space of peer-to-peer online marketplaces. At its heart is a flourishing global community made up of creative entrepreneurs and artisans who sell original and curated products.<\/p>\n<p>As of 2015, Etsy had <a href=\"https:\/\/www.statista.com\/statistics\/409374\/etsy-active-sellers\/\" target=\"_blank\" rel=\"nofollow\">more than 1.5 million active sellers<\/a> and continues to expand its user base. With that level of competition, entrepreneurs need to employ every optimization tactic available to make their store and their products stand out.<\/p>\n<h2><span id=\"OPTIMIZE_PRODUCT_LISTING_TITLES\">OPTIMIZE PRODUCT LISTING TITLES<\/span><\/h2>\n<p>The name you give your product listing, or product titles, is also used to create the page title for each listing page. You want the item name or search terms used by a customer to be at the beginning of the page title.<\/p>\n<p>By default, Etsy includes your shop name <a href=\"https:\/\/www.etsy.com\/help\/article\/247\" target=\"_blank\" rel=\"nofollow\">at the end<\/a> of the page title, so don’t worry about adding this.<\/p>\n<h2><span id=\"CREATE_COMPELLING_PRODUCT_DESCRIPTIONS\">CREATE COMPELLING PRODUCT DESCRIPTIONS<\/span><\/h2>\n<p>Like page titles, search engines limit how much of a page’s description is displayed. In the search results, you only see the first 160 characters in a metadescription. With Etsy, the first 160 characters of your product description are used to create the metadescription.<\/p>\n<p>It’s important to optimize the first part of your product description with relevant search phrases, but you also want to make sure the description is compelling. From organic search, this is the first opportunity for a conversion, so make it attractive.<\/p>\n<p>It’s OK for your full description to exceed 160 characters. Optimize content for the user as well as for search engines. Focus on the value proposition. Remember that search engines love content, and a well-detailed product description not only establishes relevancy for keywords, but also helps sell the customer on the benefits of your product.<\/p>\n<h2><span id=\"IMPROVE_EXPOSURE_WITH_BETTER_SERVICE\">IMPROVE EXPOSURE WITH BETTER SERVICE<\/span><\/h2>\n<p>No matter how competitive a market is, you always have an opportunity to provide better service than your competitors. Don’t just try to optimize your listings; find ways to optimize your business, such as:<\/p>\n<ul>\n<li>More personalized communication<\/li>\n<li>Faster product fulfillment and shipping<\/li>\n<li>Guarantees and open return policies<\/li>\n<li>Personalized customer follow-up<\/li>\n<\/ul>\n<p>Creating a great customer experience can lead to a higher volume of referrals, as well as great product reviews. Consider that 92 percent of consumers prefer peer reviews to brand advertising, and it’s easy to see how glowing testimonials can improve conversions and revenue.<\/p>\n<p>Likewise, Etsy wants to make sure users have a good experience. Well-performing shops with positive reviews will find their products ranking better in internal search results.<\/p>\n<h2><span id=\"GUIDE_TO_GOOGLE_MY_BUSINESS_OPTIMIZATION\"><a name=\"google\"><\/a><strong>GUIDE TO GOOGLE MY BUSINESS OPTIMIZATION<\/strong><\/span><\/h2>\n<p><img loading=\"lazy\" class=\"alignnone\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_5.jpg\" alt=\"Guide to GMB optimization\" width=\"800\" height=\"653\" \/><\/p>\n<p>Google’s goal is always to show the most relevant, informative results to its users when they make a search query. For that reason, if there are local results to help a search user then those are going to be featured prominently at the top of the search results.<\/p>\n<p>A quick search for “pizza” will show map listings of local restaurants, reviews, and Google My Business listings for many local shops. The remainder of the organic results gets pushed down. Claiming and optimizing these business listings is of critical importance for a local business.<\/p>\n<p>Without a claimed business listing, you won’t show up within those top-mapped results.<\/p>\n<h2><span id=\"CLAIM_YOUR_BUSINESS_LISTING\">CLAIM YOUR BUSINESS LISTING<\/span><\/h2>\n<p>Like other business listings, such as Yelp, you have to claim your listing before you can manage and optimize it. If a listing doesn’t exist for your company, you can create a listing and submit it for verification and approval.<\/p>\n<p>Some benefits become available once you claim your listing, including:<\/p>\n<ul>\n<li>Customizing and maintaining your business information<\/li>\n<li>Responding to reviews from customers<\/li>\n<li>Adding images to your listing<\/li>\n<li>Accessing insights about how people found your business, how many people called using the listed number, and how people searched for your business<\/li>\n<li>Businesses that verify their listings are twice as likely to be considered reputable by consumers<\/li>\n<\/ul>\n<h2><span id=\"CUSTOMIZE_YOUR_INFORMATION\">CUSTOMIZE YOUR INFORMATION<\/span><\/h2>\n<p>Due to inappropriate use and keyword stuffing, Google has removed the ability to create custom descriptions for businesses. However, you can still update pertinent information that is used to determine relevancy for customer searches. This includes your business category, hours, products, and menu items.<\/p>\n<h2><span id=\"GROW_YOUR_REVIEWS\">GROW YOUR REVIEWS<\/span><\/h2>\n<p>Google wants to mingle offline popularity with search functionality online. Reviews can influence the visibility of your local business in online search, so it can be beneficial to encourage your customers to leave reviews for you on your Google My Business listing.<\/p>\n<p><a href=\"https:\/\/searchenginewatch.com\/sew\/how-to\/2436136\/the-importance-of-user-reviews-for-local-seo\" target=\"_blank\" rel=\"nofollow\">Reviews that mention products and services lend to that optimization<\/a> and can help your business show up for specific local product or service searches.<\/p>\n<h2><span id=\"CREATE_A_VISUAL_EXPERIENCE\">CREATE A VISUAL EXPERIENCE<\/span><\/h2>\n<p>Adding images to your business listing is one of the best benefits to a local listing. Feature your best product or food items, show off your environment as well as the company culture, and give people a taste of what they can expect when they arrive.<\/p>\n<p>A great visual addition is to hire a Google-certified photographer who can create a virtual tour of your business that becomes a part of Google’s Street View and Maps system, allowing customers to tour your business easily.<\/p>\n<h2><span id=\"CONCLUSION\"><strong>CONCLUSION<\/strong><\/span><\/h2>\n<p>Virtually every social channel and online platform used by your fans and prospective customers offer some opportunity for optimization – both for expanding search visibility and improving the user experience.<\/p>\n<p>The process couldn’t be simpler:<\/p>\n<ul>\n<li>Identify the key channels or sites most relevant to your business, which will put you in front of your audience.<\/li>\n<li>Claim or create your online listings.<\/li>\n<li>Complete your profile in detail, providing necessary and relevant content and descriptive information.<\/li>\n<li>Optimize the content to match product, brand, or relevant search terms to improve organic search visibility.<\/li>\n<li>Cross-link between your website and business listings to help establish relevancy and build referral traffic.<\/li>\n<li>Ensure you optimize for the user as well as search engines to offer a visually engaging and informative experience.<\/li>\n<\/ul>\n<p>The bulk of optimization takes very little time to complete, and even less to maintain. With the increased exposure and traffic, that can mean a substantial return on your time investment. It’s well worth it to implement one or more of the above recommendations – whether you’re an online retailer or a brick-and-mortar business.<\/p>\n<h2><span id=\"FAIR_USE\"><strong>FAIR USE<\/strong><\/span><\/h2>\n<p>Know someone who could benefit from the info presented on this page? Feel free to share this page and its contents for noncommercial uses. Just make sure to link back to this page and the the authors.<\/p>\n<h2><span id=\"METHODOLOGY\"><strong>METHODOLOGY<\/strong><\/span><\/h2>\n<p>We talked to our experts to find out the keys to optimizing each platform.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 GUIDE TO FACEBOOK SEO OPTIMIZATION2 CREATE A VANITY URL3 FACEBOOK PAGE TITLE4 COMPLETE YOUR PROFILE5 ENGAGE YOUR AUDIENCE6 GUIDE TO YELP SEO OPTIMIZATION7 CLAIM YOUR BUSINESS PAGE8 COMPLETE YOUR PROFILE9 NEW REVIEWS10 ADD PHOTOS11 GUIDE TO PINTEREST SEO OPTIMIZATION12 OPTIMIZE BOARD NAMES13 DON&#8217;T NEGLECT THE DESCRIPTIONS14 DO EXTRA KEYWORD RESEARCH15 GUIDE TO ETSY SEO [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3056,3058],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>SEO Best Practices Guide for: Facebook, Yelp, Pinterest, Etsy &amp; Google<\/title>\n<meta name=\"description\" content=\"This online and local SEO cheat sheet will give you the most critical elements to optimize for Facebook, Yelp, Pinterest, Etsy &amp; Google My Business.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Platform-Specific SEO Best Practices Guide\" \/>\n<meta property=\"og:description\" content=\"This online and local SEO cheat sheet will give you the most critical elements to optimize for Facebook, Yelp, Pinterest, Etsy &amp; Google My Business.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2017-01-27T14:14:49+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-25T22:08:31+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_1.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam Heitzman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_1.jpg\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_1.jpg\",\"width\":800,\"height\":646},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/\",\"name\":\"SEO Best Practices Guide for: Facebook, Yelp, Pinterest, Etsy & Google\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#primaryimage\"},\"datePublished\":\"2017-01-27T14:14:49+00:00\",\"dateModified\":\"2021-08-25T22:08:31+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\"},\"description\":\"This online and local SEO cheat sheet will give you the most critical elements to optimize for Facebook, Yelp, Pinterest, Etsy & Google My Business.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Platform-Specific SEO Best Practices Guide\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\",\"name\":\"Adam Heitzman\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"caption\":\"Adam Heitzman\"},\"description\":\"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.\",\"url\":\"https:\/\/www.highervisibility.com\/author\/aheitzman\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"SEO Best Practices Guide for: Facebook, Yelp, Pinterest, Etsy & Google","description":"This online and local SEO cheat sheet will give you the most critical elements to optimize for Facebook, Yelp, Pinterest, Etsy & Google My Business.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/","og_locale":"en_US","og_type":"article","og_title":"Platform-Specific SEO Best Practices Guide","og_description":"This online and local SEO cheat sheet will give you the most critical elements to optimize for Facebook, Yelp, Pinterest, Etsy & Google My Business.","og_url":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2017-01-27T14:14:49+00:00","article_modified_time":"2021-08-25T22:08:31+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_1.jpg"}],"twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Adam Heitzman","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_1.jpg","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2017\/01\/e-commerce-and-local-seo-cheat-sheet_1.jpg","width":800,"height":646},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/","name":"SEO Best Practices Guide for: Facebook, Yelp, Pinterest, Etsy & Google","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#primaryimage"},"datePublished":"2017-01-27T14:14:49+00:00","dateModified":"2021-08-25T22:08:31+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936"},"description":"This online and local SEO cheat sheet will give you the most critical elements to optimize for Facebook, Yelp, Pinterest, Etsy & Google My Business.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/platform-specific-seo-best-practices-guide\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Platform-Specific SEO Best Practices Guide"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936","name":"Adam Heitzman","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","caption":"Adam Heitzman"},"description":"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.","url":"https:\/\/www.highervisibility.com\/author\/aheitzman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/12491"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=12491"}],"version-history":[{"count":3,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/12491\/revisions"}],"predecessor-version":[{"id":16846,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/12491\/revisions\/16846"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=12491"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=12491"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=12491"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}