{"id":13289,"date":"2019-04-15T10:47:09","date_gmt":"2019-04-15T15:47:09","guid":{"rendered":"https:\/\/www.highervisibility.com\/?p=13289"},"modified":"2019-04-15T10:57:06","modified_gmt":"2019-04-15T15:57:06","slug":"small-business-digital-marketing-study","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/","title":{"rendered":"Small Business Digital Marketing: 2019 Research Study &#038; Statistics"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><li><a href=\"#Identifying_Business_Goals\"><span class=\"toc_number toc_depth_1\">1<\/span> Identifying Business Goals<\/a><\/li><li><a href=\"#SEO_and_Marketing\"><span class=\"toc_number toc_depth_1\">2<\/span> SEO and Marketing<\/a><\/li><li><a href=\"#Paid_Search_and_PPC\"><span class=\"toc_number toc_depth_1\">3<\/span> Paid Search and PPC<\/a><\/li><li><a href=\"#Online_Presence_and_Website_Design\"><span class=\"toc_number toc_depth_1\">4<\/span> Online Presence and Website Design<\/a><\/li><li><a href=\"#Social_Media_and_Marketing\"><span class=\"toc_number toc_depth_1\">5<\/span> Social Media and Marketing<\/a><\/li><\/ul><\/div>\n<p>Digital marketing is important to small businesses across all industries. A marketing strategy can include a variety of tasks, including improving SEO (<a href=\"https:\/\/www.highervisibility.com\/blog\/what-is-seo\/\">search engine optimization<\/a>), boosting website traffic, maintaining social media pages, and tracking returns on investments. The question that often arises is, how much do small business owners really know about online marketing and the best ways to utilize these efforts?<\/p>\n<p>We surveyed 1,000 small business owners with at least one employee and a website for the business. The goal of this survey was to learn how small business owners handle online marketing efforts.<\/p>\n<p><strong>What we discovered is that many small businesses don&#8217;t have a complete understanding of the various factors that impact success in marketing.<\/strong><\/p>\n<h2><span id=\"Identifying_Business_Goals\"><strong>Identifying Business Goals<\/strong><\/span><\/h2>\n<p>Before a business owner can design and implement a successful digital marketing strategy, they must first identify their business goals. For 38.1 percent of those surveyed, their website simply exists to provide information or generate brand awareness. If a business sells a product or service through its website, the primary purpose of the site may be e-commerce or sales. Of those involved in the survey, 23.3 percent reported e-commerce as the goal of the site.<\/p>\n<p>For 14.9 percent of the respondents, the website&#8217;s purpose was to direct customers to visit a brick-and-mortar location or provide directions. Finally, 3.7 percent, or 37 respondents, did not know what the primary goal of their website was, which is particularly concerning from a marketing standpoint. Without a clear goal, the site likely won&#8217;t have the direction and focus needed to appeal to visitors, and the marketing efforts won&#8217;t be tied together in any identifiable way.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13283\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png\" alt=\"\" width=\"1000\" height=\"2389\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png 1000w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14-209x500.png 209w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14-768x1835.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14-167x400.png 167w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p>When working on a marketing strategy, those involved must identify what they want to accomplish before they can determine the best avenues to accomplish those goals. From there, business owners can review the most common digital marketing options, including website design, SEO, PPC, and social media. Spending money on a campaign that directs back to a website that doesn&#8217;t offer any related information or hasn&#8217;t been updated in years likely won&#8217;t generate the same results as a marketing campaign that feels connected at every touch point.<\/p>\n<h2><span id=\"SEO_and_Marketing\"><strong>SEO and Marketing<\/strong><\/span><\/h2>\n<p>Despite the benefits of ranking well in search engines, many small businesses are missing the mark when it comes to implementing strategies that will boost their SEO. As a result, those businesses may not be driving the traffic they want to their website, which is often directly linked to lead generation and other marketing activities. Since 20 percent of the respondents reported that the primary goal of their website was to generate phone calls and leads, the disconnect is especially concerning.<\/p>\n<p>Nearly 7 percent of respondents said they don&#8217;t have a budget for digital marketing activities, which include <a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">SEO services<\/a>, social ads, paid searches, and banner ads. Among those business owners who do have a budget for these activities, 44.3 percent reported having just $1-$499 per month to devote to online marketing. Nearly 23 percent of respondents have a budget of $500-$999 per month, while 12.2 percent have a budget of $1,000-$2,499 per month.<\/p>\n<p>Although a majority of small business owners do see the value in an online presence, many aren&#8217;t connecting that importance to tasks that could boost traffic to their websites. Digital marketing activities are a must to generate more traffic and increase awareness. The lack of investment in digital marketing could be a result of web traffic levels that feel satisfactory to the business owner.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13287\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A1_Mar14.png\" alt=\"\" width=\"1000\" height=\"2788\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A1_Mar14.png 1000w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A1_Mar14-179x500.png 179w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A1_Mar14-768x2141.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A1_Mar14-143x400.png 143w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p>Many small business marketers don&#8217;t understand the value of investing in their web presence and SEO, while others have unrealistic expectations for how SEO works. 27 percent of small business owners surveyed expect to spend $0-$99 per month on an SEO campaign to see significant results. 30 percent expect to spend $100-$199 per month, while 18.5 percent expect to spend $200-$499 per month.<\/p>\n<p>Additionally, many of these respondents did not understand that SEO is a longer-term marketing strategy.<\/p>\n<ul>\n<li>31 percent would expect to see significant SEO results within a month or less of hiring an SEO company.<\/li>\n<li>Nearly 900 of the 1,000 total respondents would expect to see significant SEO results within one to six months.<\/li>\n<\/ul>\n<h2><span id=\"Paid_Search_and_PPC\"><strong>Paid Search and PPC<\/strong><\/span><\/h2>\n<p>Paid searches and pay-per-click (PPC) search engine advertising are also important aspects of online marketing efforts, especially for businesses trying to generate more awareness about their brand. The pay-per-click model is one of the most widely utilized options since it allows businesses to pay only when the ad is clicked, rather than paying per thousand impressions (cost per mille) or when their ad is displayed.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13284\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A4_Mar14.png\" alt=\"\" width=\"1000\" height=\"1620\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A4_Mar14.png 1000w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A4_Mar14-309x500.png 309w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A4_Mar14-768x1244.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A4_Mar14-247x400.png 247w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p>Although paid search and implementing PPC into the marketing strategy are useful for small businesses, many of the owners surveyed reported not understanding the value or not using these methods.<\/p>\n<ul>\n<li>6.5 percent said it was not important at all for their business to rank well within the Google My Business Map listings.<\/li>\n<li>8.7 percent said advertising the business via paid search was somewhat unimportant and 4.1 percent said paid search advertising was not important at all. Additionally, 20.8 percent said their business didn&#8217;t advertise using paid search.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13285\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A5_Mar14.png\" alt=\"\" width=\"1000\" height=\"1739\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A5_Mar14.png 1000w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A5_Mar14-288x500.png 288w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A5_Mar14-768x1336.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A5_Mar14-230x400.png 230w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/li>\n<\/ul>\n<p>Among the small business owners who do invest in paid search campaigns, 32 percent reported that they would expect to pay $0-$99 to see significant results, while 29.3 percent believe they would have to spend $100-$199 per month. Lastly, 24.6 percent of respondents said they have an internal employee who manages paid search campaigns.<\/p>\n<h2><span id=\"Online_Presence_and_Website_Design\"><strong>Online Presence and Website Design<\/strong><\/span><\/h2>\n<p>Of those surveyed, 4.4 percent of respondents stated that their online presence was somewhat unimportant or not important at all to the success of the business, while 7.6 percent reported feeling that the online presence was neutral to its success. In that category, the regional location made a difference, as nearly 70 percent of those surveyed in the Northeast believed that an online presence was extremely important to the success of the business.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13288\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A2_Mar14.png\" alt=\"\" width=\"1000\" height=\"2230\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A2_Mar14.png 1000w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A2_Mar14-224x500.png 224w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A2_Mar14-768x1713.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A2_Mar14-179x400.png 179w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p>While many small businesses with a website see the value in regularly updating their website&#8217;s framework and content, there are still some who don&#8217;t.<\/p>\n<p>Nearly 28 percent have not updated their website&#8217;s framework or design in more than a year, and 19 percent haven&#8217;t updated in three or more years. It is also interesting to note that 42.9 percent of small business owners used some type of online website building template or software to design their own site, while 15.7 percent used HTML\/CSS to personally design the site. Only 32.4 percent hired a professional web designer or external company for this purpose. These statistics show that small business owners seem to be fairly savvy at building websites and can handle this task on their own.<\/p>\n<p>Among those who aren&#8217;t as savvy in web design, 31.6 percent would expect to pay $499 or less for a professionally designed website. On the opposite end of the spectrum, 1.7 percent, or 17 of the respondents, believed they would have to spend $50,000 or more. The higher percentage of small business owners who expect to pay less is likely attributed to the availability and prevalence of online website template builders and software. As a result, the value of a website designed by a professional specifically for the business appears to be lower.<\/p>\n<p><strong>While many aren&#8217;t updating their online presence, those who are were happier with their appearance in search rankings than those who weren&#8217;t.<\/strong><\/p>\n<p>Finally, 40.9 percent of respondents were happy with their site rankings, while 9.3 percent were somewhat dissatisfied or extremely dissatisfied.<\/p>\n<h2><span id=\"Social_Media_and_Marketing\"><strong>Social Media and Marketing<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13286\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A6_Mar14.png\" alt=\"\" width=\"1000\" height=\"2000\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A6_Mar14.png 1000w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A6_Mar14-250x500.png 250w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A6_Mar14-768x1536.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A6_Mar14-200x400.png 200w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/strong><\/span><\/h2>\n<p>While a majority of small business owners understand the importance of social media presences, 5.5 percent of respondents reported that their businesses do not use social media. Among those who use social media for their businesses, 41.4 percent would expect to see significant results on a social media ad campaign when paying $0-$99 per month. 268 of the respondents believe they would have to spend $100-$199 per month to see results, while 13.3 percent expect to pay $200-$499 monthly on a social media ad campaign. On the high end, 16 respondents believe they would have to spend $3,000 or more per month to see significant results on a social media ad campaign.<\/p>\n<p>A social media presence is a part of a healthy SEO strategy, yet many businesses are failing to implement this piece of the puzzle. Although 82.7 percent of business owners surveyed reported that they see social media as very important or somewhat important for their business, 57.4 percent are managing these social media pages themselves. While this strategy may work in some organizations, others need marketing experts to handle the posts, analysis, and tracking to make sure what they are sharing is resonating with the audience and generating engagement.<\/p>\n<p><strong>CONCLUSION<\/strong><\/p>\n<p>As it stands, there is still some confusion and missed opportunities in the way that small businesses approach their online presences, SEO, and marketing.<\/p>\n<p>While small business marketers seem to understand that SEO is something they need to use, many still fail to implement the correct strategies that will help improve their search rankings. They may choose not to worry about social media, paid search campaigns, and other ways to boost awareness about their business, but this can make it nearly impossible to see results.<\/p>\n<p>Many small business marketers:<\/p>\n<ul>\n<li>Don&#8217;t fully understand how SEO works.<\/li>\n<li>Don&#8217;t realize <a href=\"https:\/\/www.highervisibility.com\/blog\/why-is-seo-important\/\">why SEO is important<\/a>.<\/li>\n<li>Fail to connect the dots between marketing efforts and ROI.<\/li>\n<li>Don&#8217;t understand the value and importance of having a regularly updated and fresh website.<\/li>\n<li>Aren&#8217;t investing enough in their digital marketing strategy.<\/li>\n<\/ul>\n<p>The good news is small businesses who make digital marketing efforts a priority have an opportunity to get ahead of the curve and stand out from their competitors who are failing to see the potential.<\/p>\n<p>Changing the marketing strategy and the tasks associated with boosting web traffic may allow small businesses to capitalize on search, move ahead of the competition, and connect with customers where others are failing to make an impression.<\/p>\n<p><strong>METHODOLOGY<\/strong><\/p>\n<p>We surveyed 1,000 small business owners who are involved in marketing efforts.<\/p>\n<p><strong>FAIR USE STATEMENT<\/strong><\/p>\n<p>Know someone who could benefit from knowing a little more about SEO? Feel free to share the contents of this project for non-commercial purposes, as long as you link back to the authors of this page.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 Identifying Business Goals2 SEO and Marketing3 Paid Search and PPC4 Online Presence and Website Design5 Social Media and Marketing Digital marketing is important to small businesses across all industries. A marketing strategy can include a variety of tasks, including improving SEO (search engine optimization), boosting website traffic, maintaining social media pages, and tracking returns [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3057,3058],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Small Business Digital Marketing [2019 Research Study &amp; Statistics]<\/title>\n<meta name=\"description\" content=\"HigherVisibility&#039;s annual research study details what 1,000 small business owners think about digital marketing and the impact on their business.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Small Business Digital Marketing: 2019 Research Study &amp; Statistics\" \/>\n<meta property=\"og:description\" content=\"HigherVisibility&#039;s annual research study details what 1,000 small business owners think about digital marketing and the impact on their business.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2019-04-15T15:47:09+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2019-04-15T15:57:06+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Scott Langdon\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png\",\"width\":1000,\"height\":2389},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/\",\"name\":\"Small Business Digital Marketing [2019 Research Study & Statistics]\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#primaryimage\"},\"datePublished\":\"2019-04-15T15:47:09+00:00\",\"dateModified\":\"2019-04-15T15:57:06+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8\"},\"description\":\"HigherVisibility's annual research study details what 1,000 small business owners think about digital marketing and the impact on their business.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Small Business Digital Marketing: 2019 Research Study &#038; Statistics\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8\",\"name\":\"Scott Langdon\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g\",\"caption\":\"Scott Langdon\"},\"description\":\"Scott Langdon is an entrepreneur with over 13 years of internet marketing experience. In 2001 Scott founded one of the largest financial affiliate networks online and later sold it to a public company in December of 2008. He brings operational experience with nearly all forms of internet marketing such SEO, PPC, Affiliate Marketing, and Display.\",\"url\":\"https:\/\/www.highervisibility.com\/author\/slangdon\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Small Business Digital Marketing [2019 Research Study & Statistics]","description":"HigherVisibility's annual research study details what 1,000 small business owners think about digital marketing and the impact on their business.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/","og_locale":"en_US","og_type":"article","og_title":"Small Business Digital Marketing: 2019 Research Study & Statistics","og_description":"HigherVisibility's annual research study details what 1,000 small business owners think about digital marketing and the impact on their business.","og_url":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2019-04-15T15:47:09+00:00","article_modified_time":"2019-04-15T15:57:06+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png"}],"twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Scott Langdon","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/04\/HV_SMBSEOArticleGraphics_D2_A3_Mar14.png","width":1000,"height":2389},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/","name":"Small Business Digital Marketing [2019 Research Study & Statistics]","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#primaryimage"},"datePublished":"2019-04-15T15:47:09+00:00","dateModified":"2019-04-15T15:57:06+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8"},"description":"HigherVisibility's annual research study details what 1,000 small business owners think about digital marketing and the impact on their business.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/small-business-digital-marketing-study\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Small Business Digital Marketing: 2019 Research Study &#038; Statistics"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8","name":"Scott Langdon","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g","caption":"Scott Langdon"},"description":"Scott Langdon is an entrepreneur with over 13 years of internet marketing experience. In 2001 Scott founded one of the largest financial affiliate networks online and later sold it to a public company in December of 2008. He brings operational experience with nearly all forms of internet marketing such SEO, PPC, Affiliate Marketing, and Display.","url":"https:\/\/www.highervisibility.com\/author\/slangdon\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13289"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=13289"}],"version-history":[{"count":3,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13289\/revisions"}],"predecessor-version":[{"id":13291,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13289\/revisions\/13291"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=13289"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=13289"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=13289"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}