{"id":13338,"date":"2019-05-14T11:21:48","date_gmt":"2019-05-14T16:21:48","guid":{"rendered":"https:\/\/www.highervisibility.com\/?p=13338"},"modified":"2021-08-26T16:39:23","modified_gmt":"2021-08-26T21:39:23","slug":"seo-packages","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/","title":{"rendered":"SEO Packages: Why You Should Avoid Pre-Bundled SEO"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><li><a href=\"#What_is_Black_Hat_SEO\"><span class=\"toc_number toc_depth_1\">1<\/span> What is Black Hat SEO<\/a><\/li><li><a href=\"#The_Problem_with_Pre-Bundled_SEO_Packages\"><span class=\"toc_number toc_depth_1\">2<\/span> The Problem with Pre-Bundled SEO Packages<\/a><\/li><li><a href=\"#Basic_SEO_Requires_Time_and_Commitment\"><span class=\"toc_number toc_depth_1\">3<\/span> Basic SEO Requires Time and Commitment<\/a><\/li><li><a href=\"#Every_Company_is_Different\"><span class=\"toc_number toc_depth_1\">4<\/span> Every Company is Different<\/a><\/li><li><a href=\"#Accountability_and_Long_Term_Strategy\"><span class=\"toc_number toc_depth_1\">5<\/span> Accountability and Long Term Strategy<\/a><\/li><li><a href=\"#In_Conclusion\"><span class=\"toc_number toc_depth_1\">6<\/span> In Conclusion<\/a><\/li><\/ul><\/div>\n<p>When you bring up <a href=\"https:\/\/www.highervisibility.com\/blog\/what-is-seo\/\">Search engine optimization<\/a> at a business networking event you’re likely to get wildly different reactions based on who you’re speaking to.<\/p>\n<p>While there are many seasoned professionals who rightly hail <a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">SEO services<\/a> as a savior of their business, there are many who decry the digital marketing practice, labeling it a scam or a fad.<\/p>\n<p>That second group was likely the victim of a black hat SEO company, offering discounted services and taking a number of shortcuts which at one time might have been beneficial. Google now polices content for black hat SEO and punishes offenders accordingly.<\/p>\n<p>There are a lot of red flags one should look for when dealing with an SEO company. The first and largest warning light comes from pre-bundled SEO packages. These one-size-fits-all strategies fly in the face of SEO best practices and could do a lot more harm than good in the long run.<\/p>\n<p>What’s so bad about pre-bundled SEO? Why should you avoid it?<\/p>\n<p>Read on to find out!<\/p>\n<h2><span id=\"What_is_Black_Hat_SEO\">What is Black Hat SEO<\/span><\/h2>\n<p>Black hat SEO is a series of deceptive practices wherein an SEO company attempts to subvert Google’s algorithm and trick the system into ranking you higher in the search engines than you actually deserve to be.<\/p>\n<p>Make no bones about it, the purpose of black hat SEO is not to improve your website, but to deceive Google into thinking that your site is something that it is not.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-13340\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat.png\" alt=\"\" width=\"381\" height=\"372\" \/><\/p>\n<p>The truly sad thing about black hat SEO is that this ethically dubious one size fits all approach to optimization actually used to work.<\/p>\n<p>But as time went on, Google became wise to the practice. As the system evolved, it began to figure out the issues that it was facing and took steps toward plugging up the holes in its metaphorical ship.<\/p>\n<p>Even to this day, black hat techniques work for a little while. Eventually, however, Google’s system flags the site and the penalties begin. For starters, the Google ranking score of the site in question is immediately penalized. If the infractions are serious enough, Google might even boot the site off of its search network entirely.<\/p>\n<p>So why do people turn to black hat SEO despite these dire issues? Most companies that utilize black hat techniques don’t tout that they scam the Google system. But there are a few different warning signs to look out for.<\/p>\n<p>Black hat SEO is typically cheap, which means that a lot of these discounted SEO companies might be hiding something. Black hat SEO can be done easily and is typically mass produced. That’s why their prices are so low and their packages are bundled.<\/p>\n<p>SEO needs sustainability. The momentary bump that you might see from black hat tactics will pale in comparison to the damage that this deception will do to your site’s reputation in the eyes of Google.<\/p>\n<p>White hat tactics take longer, that’s for certain, but they give better results over time and can be sustained.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13341\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat-seo.png\" alt=\"\" width=\"481\" height=\"289\" \/><\/p>\n<p>As you can see in the above image, the black line represents black hat SEO ranking and traffic, Once Google flags the activity there is a sharp decline that bottoms out and then stays there.<\/p>\n<p>This perfectly showcases how black hat SEO practices are not sustainable and lead to long term failure.<\/p>\n<p>But what are some of these tactics?<\/p>\n<p>One of the most famous black hat SEO scams involved creating dummy websites with links back to the original site that the company was trying to rank for. This would show Google that there were a large number of backlinks.<\/p>\n<p>Google has now adapted to judge both the quantity and quality of backlinks in order to combat this type of link building.<\/p>\n<p>Another black hat tactic via keyword research is stuffing, where content writers fill their web copy with keywords to the detriment of the content itself. Now, Google also examines the readability of your content to ensure that it is quality.<\/p>\n<h2><span id=\"The_Problem_with_Pre-Bundled_SEO_Packages\">The Problem with Pre-Bundled SEO Packages<\/span><\/h2>\n<p>Pre-Bundled “one size fits all” SEO packages should be avoided at all costs because they are a breeding ground for mass produced black hat tactics.<\/p>\n<p>SEO campaigns need to be customized to each individual website. Trying to apply the same tactics for numerous sites across the board is not just silly, it is dangerous.<\/p>\n<p>Because of the potential consequences of trying to game the system, this one size fits all approach that most discounted SEO firms tout is doomed for failure.<\/p>\n<p>Different industries also require different ranking factors. A small business, for instance, will need an entirely different strategy than an enterprise company. The content creation for each client has to be high quality and original.<\/p>\n<p>Reducing <a href=\"https:\/\/www.highervisibility.com\/blog\/seo-pricing\/\">SEO costs<\/a> in pre-bundled search engine optimization packages only serves to create dangerous shortcuts which shoot your SEO strategy in the foot.<\/p>\n<p>On top of the obvious Google penalties, letting some of these black hat firms into the back end of your website can ruin the effectiveness of your website’s message. This is incredibly damaging given modern audiences and their propensity toward online services.<\/p>\n<p>Tech Savvy Millennials make up <a href=\"https:\/\/www.searchenginejournal.com\/avoid-cheap-seo-packages\/245687\/#close\" target=\"_blank\" rel=\"nofollow\">54% of online shoppers<\/a> and that number continues to rise. Letting a black hat SEO firm stuff your content full of ineffective keywords could turn this sophisticated audience away.<\/p>\n<h2><span id=\"Basic_SEO_Requires_Time_and_Commitment\">Basic SEO Requires Time and Commitment<\/span><\/h2>\n<p>True SEO can revitalize a company and propel profits into the stratosphere. But the backbone of SEO is quality content and relevant high-value backlinks.<\/p>\n<p>These two requirements take a lot of time and energy to get right.<\/p>\n<p>In the business world, time is money, as you well know. That means a cheap SEO firm is cutting corners somewhere. It is built into their business plan.<\/p>\n<p>Low-cost SEO packages are created for increased client volume, and not for results. In order to make ends meet, it stands to reason that these low-cost companies would need to have a lot of clients. There are only so many hours in a day and that means that these companies will not have as much time to focus on your site.<\/p>\n<p>With a lack of capital, companies can’t create long-form content or dedicate enough time to reach out to authoritative websites for link placement.<\/p>\n<p>Good SEO content requires structure and quality information. This should only be crafted by a dedicated content marketing writer. These companies do not have such creatives under their roofs.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13342\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/off-page-seo.png\" alt=\"\" width=\"1344\" height=\"757\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/off-page-seo.png 1344w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/off-page-seo-770x434.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/off-page-seo-768x433.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/off-page-seo-710x400.png 710w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/off-page-seo-75x43.png 75w\" sizes=\"(max-width: 1344px) 100vw, 1344px\" \/><\/p>\n<p>It is a common black hat SEO package strategy to use scraping software to compile information from existing articles in order to create new posts out of them.<\/p>\n<p>The end result is a poor narrative structure and horrid grammar. These are factors that Google takes into account when determining your score. The quality of your content is not just important for SEO, it’s reflective of the competency of your business itself.<\/p>\n<p>When links are developed under a time crunch, they are often poor in quality, holding little to no value. When large quantities of poor links are developed, Google will penalize you.<\/p>\n<p>Remember, it’s quality over quantity when it comes to links.<\/p>\n<p>SEO package companies use automated software to publish links on low-quality sites that have little relevance or authority in your industry. The end result of this practice is a complete waste of your money at best, and damage to your SEO score at worst.<\/p>\n<h2><span id=\"Every_Company_is_Different\">Every Company is Different<\/span><\/h2>\n<p>All too often these pre-bundled SEO packages are listed like a menu and include non-seo related line items like social media services. When options and prices are set up on an SEO agency site as though they were a software subscription, it should be a huge red flag.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13339\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/seo-packages.png\" alt=\"\" width=\"1802\" height=\"706\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/seo-packages.png 1802w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/seo-packages-770x302.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/seo-packages-768x301.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/seo-packages-1021x400.png 1021w\" sizes=\"(max-width: 1802px) 100vw, 1802px\" \/><\/p>\n<p>No two businesses can succeed under the same strategy. Different businesses require different strategies, all of which require different levels of time.<\/p>\n<p>To that end, your SEO has to be tailored to your specific company or you will fail miserably and end up in a worse situation than where you started. It’s impossible to anticipate the goals, needs, and specific circumstances that a company is facing when creating these discounted SEO packages.<\/p>\n<p>There are so many factors that go into crafting a successful strategy.<\/p>\n<p>Budget is one variable. The amount of money you can invest into your SEO should determine the amount of time that can be put into it.<\/p>\n<p>You also need to take into account the competitive nature of your industry. If you’re one lone voice without a lot of competitors, it’s going to be much easier to rank. However, if you are facing stiff competition from all angles, you’re going to have a much steeper mountain to climb in order to claim that number one slot.<\/p>\n<p>Have you done any SEO work in the past, or are you starting from scratch? This is another determining factor that has to be taken into account when constructing an SEO strategy. If you’re starting from nowhere, it’s going to be a longer road.<\/p>\n<p>Has Google penalized you in the past? If you have to overcome Google’s existing bias against you, then more time and money will be needed.<\/p>\n<p>Are you a local business? National? Global? That has to be determined before the first line of your website is optimized.<\/p>\n<p>Fact-finding of this nature has to be undertaken before a strategy can be put in place and a price determined.<\/p>\n<p>This should be all the proof you need that cheap SEO companies only want high client volumes. They don’t care about the specifics of your business because they know that they will have no long term impact on your traffic.<\/p>\n<h2><span id=\"Accountability_and_Long_Term_Strategy\">Accountability and Long Term Strategy<\/span><\/h2>\n<p>When you’re working with an SEO company, it should be a partnership that lasts for a long time. Unfortunately, long term business relationships are not viable with cheap SEO companies.<\/p>\n<p>Typically, their client base is a revolving door so they put little stock in where your company will be going in the future. That means they have little to no accountability for the work that they do.<\/p>\n<p>Usually, these companies won’t fight to keep your business when you’re about to leave because they’re constantly bringing in new clients. This leaves you with no results and an empty wallet.<\/p>\n<p>Remember this mantra: SEO takes time.<\/p>\n<p>Typically, it takes up to six months before companies start to see any results or a return on their investment. It’s a long game and patience is needed. You want to see steady progress over time when trying to improve your SEO score.<\/p>\n<p>Let’s say you start out on page 13 for your number one valued key term. You should start to see yourself moving up little by little. In the first three months, maybe you make it up to page seven or eight. Slow and steady progress is good. It will take time to get you to page one.<\/p>\n<p>Pre-bundled SEO packages aren’t in it for the long haul. They also don’t usually provide accurate reporting to gauge how well you’re doing. These campaigns are typically basic and skew on the side of short term, which is the opposite of what you want.<\/p>\n<h2><span id=\"In_Conclusion\">In Conclusion<\/span><\/h2>\n<p>If you come across an SEO package that seems too good to be true, chances are that it probably is.<\/p>\n<p>SEO is a significant investment with a long term personalized strategy that can’t be used and reused for other businesses. The presence of a pre-bundled SEO package should be instantly viewed as black hat SEO and avoided at all costs, lest you incur the wrath of Google.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 What is Black Hat SEO2 The Problem with Pre-Bundled SEO Packages3 Basic SEO Requires Time and Commitment4 Every Company is Different5 Accountability and Long Term Strategy6 In Conclusion When you bring up Search engine optimization at a business networking event you’re likely to get wildly different reactions based on who you’re speaking to. While [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[351],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>SEO Packages: Why You Should Avoid Pre-Bundled SEO | HigherVisibility<\/title>\n<meta name=\"description\" content=\"What’s so bad about pre-bundled SEO packages? Learn about the pitfalls of these types of packages and why should you avoid them.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"SEO Packages: Why You Should Avoid Pre-Bundled SEO\" \/>\n<meta property=\"og:description\" content=\"What’s so bad about pre-bundled SEO packages? Learn about the pitfalls of these types of packages and why should you avoid them.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2019-05-14T16:21:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-26T21:39:23+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam Heitzman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat.png\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat.png\",\"width\":381,\"height\":372},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/\",\"name\":\"SEO Packages: Why You Should Avoid Pre-Bundled SEO | HigherVisibility\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#primaryimage\"},\"datePublished\":\"2019-05-14T16:21:48+00:00\",\"dateModified\":\"2021-08-26T21:39:23+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\"},\"description\":\"What\\u2019s so bad about pre-bundled SEO packages? Learn about the pitfalls of these types of packages and why should you avoid them.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"SEO Packages: Why You Should Avoid Pre-Bundled SEO\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\",\"name\":\"Adam Heitzman\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"caption\":\"Adam Heitzman\"},\"description\":\"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.\",\"url\":\"https:\/\/www.highervisibility.com\/author\/aheitzman\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"SEO Packages: Why You Should Avoid Pre-Bundled SEO | HigherVisibility","description":"What’s so bad about pre-bundled SEO packages? Learn about the pitfalls of these types of packages and why should you avoid them.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/","og_locale":"en_US","og_type":"article","og_title":"SEO Packages: Why You Should Avoid Pre-Bundled SEO","og_description":"What’s so bad about pre-bundled SEO packages? Learn about the pitfalls of these types of packages and why should you avoid them.","og_url":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2019-05-14T16:21:48+00:00","article_modified_time":"2021-08-26T21:39:23+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat.png"}],"twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Adam Heitzman","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat.png","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/black-hat.png","width":381,"height":372},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/","name":"SEO Packages: Why You Should Avoid Pre-Bundled SEO | HigherVisibility","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#primaryimage"},"datePublished":"2019-05-14T16:21:48+00:00","dateModified":"2021-08-26T21:39:23+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936"},"description":"What’s so bad about pre-bundled SEO packages? Learn about the pitfalls of these types of packages and why should you avoid them.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/seo-packages\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/seo-packages\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"SEO Packages: Why You Should Avoid Pre-Bundled SEO"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936","name":"Adam Heitzman","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","caption":"Adam Heitzman"},"description":"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.","url":"https:\/\/www.highervisibility.com\/author\/aheitzman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13338"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=13338"}],"version-history":[{"count":5,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13338\/revisions"}],"predecessor-version":[{"id":16897,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13338\/revisions\/16897"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=13338"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=13338"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=13338"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}