{"id":13376,"date":"2019-05-29T10:38:48","date_gmt":"2019-05-29T15:38:48","guid":{"rendered":"https:\/\/www.highervisibility.com\/?p=13376"},"modified":"2021-08-25T17:07:21","modified_gmt":"2021-08-25T22:07:21","slug":"seo-trends","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/","title":{"rendered":"SEO Trends 2019: The Latest &#038; Most Current Tactics that Actually Work"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><li><a href=\"#User_Intent\"><span class=\"toc_number toc_depth_1\">1<\/span> User Intent<\/a><\/li><li><a href=\"#Optimize_Beyond_Google\"><span class=\"toc_number toc_depth_1\">2<\/span> Optimize Beyond Google<\/a><\/li><li><a href=\"#Apply_Structured_Data\"><span class=\"toc_number toc_depth_1\">3<\/span> Apply Structured Data<\/a><\/li><li><a href=\"#Content_is_Still_King\"><span class=\"toc_number toc_depth_1\">4<\/span> Content is (Still) King<\/a><\/li><li><a href=\"#Focus_on_the_Technical_Aspects_of_SEO\"><span class=\"toc_number toc_depth_1\">5<\/span> Focus on the Technical Aspects of SEO<\/a><\/li><li><a href=\"#Machine_Learning\"><span class=\"toc_number toc_depth_1\">6<\/span> Machine Learning<\/a><\/li><li><a href=\"#Aim_for_Search_Engine_Results_Page_Features\"><span class=\"toc_number toc_depth_1\">7<\/span> Aim for Search Engine Results Page Features<\/a><\/li><li><a href=\"#In_Conclusion\"><span class=\"toc_number toc_depth_1\">8<\/span> In Conclusion<\/a><\/li><\/ul><\/div>\n<p>SEO is more than a marketing fad. It is a necessity for online exposure in 2019. It is through search engine optimization that you stay competitive within your industry. There is a constant struggle for SEO supremacy. But the means by which you reach the peak of the search engine mountain varies year by year.<\/p>\n<p>If you managed to claim first page exposure in the SERPS, you can’t just rest on your laurels and expect to get by. One change to Google’s search algorithm could cast you down into obscurity overnight.<\/p>\n<p>And make no mistake about it, Google’s algorithm changes often, and in extreme ways (think last year’s <a href=\"https:\/\/www.highervisibility.com\/blog\/how-googles-mobile-first-index-works\/\">mobile-first index<\/a> or previously RankBrain). If you’re not up to date on how it continues to evolve, you risk being left in the dust.<\/p>\n<p>SEO is not something you just do one time and then stop. It is a living, breathing, evolving creature that must be constantly maintained. SEO in 2019 looks far different than SEO looked in 2009.<\/p>\n<p>So, what are the current trends in SEO that are achieving results in 2019? Read on to find out!<\/p>\n<h2><span id=\"User_Intent\">User Intent<\/span><\/h2>\n<p>One of the keys to any SEO strategy in 2019 is to have a strong understanding of user intent. By that I mean you have to know what your audience is looking for.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13378\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png\" alt=\"\" width=\"600\" height=\"336\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png 600w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent-75x43.png 75w\" sizes=\"(max-width: 600px) 100vw, 600px\" \/><\/p>\n<p>For starters, you need to understand simple things like what platform your core audience is looking to use. Are they more desktop oriented? Do they like mobile platforms like cell phones and tablets? Would they prefer a regular website, accessed through a web browser, or are they looking for standalone applications?<\/p>\n<p>What about the kind of content they want to see? Do they want text? Audio? Video? The way in which you primarily communicate with your core audience should match up to their wants and needs.<\/p>\n<p>Likewise, understanding what your audience expects to see when they search is important. Specifically, you have to understand what questions they are most likely to ask platforms like Google.<\/p>\n<p>You need to provide the answers to their questions in a way that is simple, effective, and relatable to the experience that they prefer.<\/p>\n<p>Audience identity and intent is vital to your success, regardless of SEO. Even perfectly optimized content is useless when it is designed with the wrong audience in mind. You might get a lot of eyes on your site, but none of them will convert to profitable ventures unless you customize the user experience to them.<\/p>\n<p>On that front, Google wants your site to enhance the user journey. After all, when Google ranks your site highly on its platform it is essentially giving you its seal of approval and signing off on your content. Google is naming you an authority in your field, and they don’t do that lightly.<\/p>\n<p>This should be at the forefront of your mind, both when it comes to designing your site as well as creating quality content. You have to keep the intent of the end user in mind as you write.<\/p>\n<p>Another factor to keep in mind is the end user’s place in the sales funnel. It is your job to meet them where they are, not where you think they should be.<\/p>\n<p>To that end, SEO is no longer all about matching keyword phrases. It has evolved and become more about answering questions and covering that topic completely.<\/p>\n<p>That’s not to say that keywords are dead. Far from it!<\/p>\n<p>Keyword research has evolved. That means 2019 marketers have to pay careful attention to search engine results pages to see how similar websites are ranking for the same keywords that you’re targeting.<\/p>\n<h2><span id=\"Optimize_Beyond_Google\">Optimize Beyond Google<\/span><\/h2>\n<p>Since the dawn of SEO, everything has been all about the all mighty Google. That has changed in recent years. Google search continues to dominate the market, but it is not the only game in town.<\/p>\n<p>No, we’re not talking about other search engines. Google has that on lockdown. While it’s nice to optimize for Bing and Yahoo, they have such a small percentage of the market, that they are not really a major factor.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13379\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/Amazon-A9.png\" alt=\"\" width=\"796\" height=\"375\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/Amazon-A9.png 796w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/Amazon-A9-770x363.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/Amazon-A9-768x362.png 768w\" sizes=\"(max-width: 796px) 100vw, 796px\" \/><\/p>\n<p>Other platforms like Amazon and Apple’s App Store are becoming more important as users continue to rely more and more on e-commerce for their shopping needs.<\/p>\n<p>If you’re an e-commerce business, you need to be focusing on Amazon. It gets the lion’s share of e-commerce traffic and, as we said in the last section, it is important to meet people where they are searching.<\/p>\n<p>To that end, <a href=\"https:\/\/www.highervisibility.com\/blog\/amazon-seo\/\">Amazon SEO<\/a> and App searches are becoming far more prevalent. And optimizing content for those platforms is a whole other animal.<\/p>\n<p>Amazon has its own proprietary algorithm called A9, and it takes a lot of various information into account, including a more heavy focus on conversions.<\/p>\n<p>You also have to optimize your content based on the devices that your audience is using. That means optimizing for mobile devices, home assistants or audio devices, which are becoming increasingly popular.<\/p>\n<p>How popular? Smart speaker use <a href=\"https:\/\/www.strategyanalytics.com\/access-services\/devices\/connected-home\/smart-speakers-and-screens\/market-data\/report-detail\/global-smart-speaker-vendor-os-shipment-and-installed-base-market-share-by-region-q3-2018\" target=\"_blank\" rel=\"nofollow\">grew by 200% in the third quarter of 2018<\/a>. This trend is expected to continue into 2022, where it is estimated that 55% of households will include some kind of smart speaker device. That is a 42% increase from today.<\/p>\n<p>Voice search is rising fast, with customers now expecting answers the moment they ask them. That is part of the major shift in customer intent from search results to getting answers. As such, search queries are becoming more conversational in tone and have to be optimized that way.<\/p>\n<h2><span id=\"Apply_Structured_Data\">Apply Structured Data<\/span><\/h2>\n<p>One of the key elements of modern SEO is to include structured data in the code of your website. That is because the search engine industry has begun to rely more on artificial intelligence. As the need for AI increases, so too does the need for structured data.<\/p>\n<p>Structured data is code that speaks directly to search engines, showcasing who you are, what you do, and why you deserve to be ranked high. It is the key to moving forward with artificial intelligence.<\/p>\n<p>Structured data makes it easier for artificial intelligence to take in all of your content and determine how your site works.<\/p>\n<p>The faster the processing, the better it is.<\/p>\n<p>Structured data is the key to determining the contextual relationships between the behaviors of your customers and the topics that they are searching for.<\/p>\n<p>Structured data also gives search engines specific information that allows it to understand content that is more based on topical information and customer support.<\/p>\n<h2><span id=\"Content_is_Still_King\">Content is (Still) King<\/span><\/h2>\n<p>Content has always been the king when it comes to SEO. After all, optimized content is the name of the game. This is one thing that has not changed whatsoever.<\/p>\n<p>In fact, optimized content has actually gotten even more important!<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13380\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/jeff-bullas.png\" alt=\"\" width=\"810\" height=\"600\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/jeff-bullas.png 810w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/jeff-bullas-675x500.png 675w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/jeff-bullas-768x569.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/jeff-bullas-540x400.png 540w\" sizes=\"(max-width: 810px) 100vw, 810px\" \/><\/p>\n<p>In a 2018 update to Google’s search algorithm, we saw a more intense focus given to the quality of a site’s content. Because of that, you want to provide depth in your quality, as opposed to just hamfistedly stuffing keywords into paragraphs.<\/p>\n<p>Google placed a lot of attention on this specific issue in 2018, so it stands to reason that 2019 will be no different.<\/p>\n<p>Ideally, you want to create the kind of high-quality content that will inspire links. One of the main ranking factors that go into determining SEO placement is the presence of backlinks. These are links that connect to your site placed on high value and relevant websites which Google has ranked highly. Consider it a letter of recommendation to Google. It is a respected site telling Google that it vouches for your information and your authority on the subject.<\/p>\n<p>The best way to inspire such confidence on the part of other sites is to make sure that your content is stellar.<\/p>\n<p>Your content needs to address and solve a relevant problem as opposed to being a random buffet of mashed together keywords. The content needs to motivate, move, and connect with your specific audience. Remember who you are writing for.<\/p>\n<h2><span id=\"Focus_on_the_Technical_Aspects_of_SEO\">Focus on the Technical Aspects of SEO<\/span><\/h2>\n<p>Technical SEO has become much more important as websites continue to evolve. Websites are becoming far more advanced, and the technical functions of those sites are in turn becoming much more important.<\/p>\n<p>For starters, Google rewards sites for speed. The faster your response time, the better impression you will make on the search engines. That means you shouldn’t sacrifice page speed for the sake of your site’s advanced features. One of the best ways to ensure that your SEO score won’t suffer is to make the site simpler and faster to impress Google.<\/p>\n<h2><span id=\"Machine_Learning\">Machine Learning<\/span><\/h2>\n<p>A huge feather in the cap of your SEO score would be a focus on machine learning. That’s because machine learning is becoming more common as artificial intelligence systems are rising in popularity.<\/p>\n<p>Machine learning is already a powerful tool, and it hasn’t yet achieved the true limits of its power. As such, machine learning is set to be a major player in 2019 and beyond.<\/p>\n<p>Furthermore, employing machine learning platforms throughout your digital marketing plan can play a big part in answering the question of search intent. Machine learning can be used to develop SEO content by helping you to better understand your core demographic.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13381\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/machine-learning.png\" alt=\"\" width=\"2048\" height=\"861\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/machine-learning.png 2048w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/machine-learning-770x324.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/machine-learning-768x323.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/machine-learning-951x400.png 951w\" sizes=\"(max-width: 2048px) 100vw, 2048px\" \/><\/p>\n<p>Through machine learning, businesses can actually see where their approach succeeds and fails. It can determine where there are holes in your approach much more efficiently than human analysis.<\/p>\n<p>Machine learning systems can accurately study your audience as a whole and determine not only what they are looking for but how you can best provide that to them.<\/p>\n<h2><span id=\"Aim_for_Search_Engine_Results_Page_Features\">Aim for Search Engine Results Page Features<\/span><\/h2>\n<p>Search engine results pages are the arena in which SEO campaigns succeed or fail. As such, you should study the layout of search engine results pages and try to ensure that your content is featured above others. One of the best ways to do that is to <a href=\"https:\/\/www.highervisibility.com\/blog\/understanding-google-rich-snippets\/\">rank as a <\/a><a href=\"https:\/\/www.highervisibility.com\/blog\/understanding-google-rich-snippets\/\">featured snippet<\/a>.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13377\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/featured-snippet.png\" alt=\"\" width=\"900\" height=\"655\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/featured-snippet.png 900w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/featured-snippet-687x500.png 687w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/featured-snippet-768x559.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/featured-snippet-550x400.png 550w\" sizes=\"(max-width: 900px) 100vw, 900px\" \/><\/p>\n<p>Featured snippets are select Google results that display above the organic search results. It is a snippet of your content that is tossed up as the answer to the question asked by a user.<\/p>\n<p>Features snippets should be highly sought after as they are great for attracting new traffic. They are found in <a href=\"https:\/\/ahrefs.com\/blog\/featured-snippets-study\/\" target=\"_blank\" rel=\"nofollow\">12.29% of all <\/a><a href=\"https:\/\/ahrefs.com\/blog\/featured-snippets-study\/\" target=\"_blank\" rel=\"nofollow\">search queries<\/a> and siphon off a percentage of the clicks from the number one position.<\/p>\n<p>To illustrate that point, search results with no featured snippet in place see the number one spot getting 26% of all clicks that come in for that search. When there is a snippet, the number one slotted result only gets <a href=\"https:\/\/ahrefs.com\/blog\/featured-snippets-study\/\" target=\"_blank\" rel=\"nofollow\">19.6% of the clicks<\/a>.<\/p>\n<p>Answer boxes and recipes are also big traffic items. Typically answer boxes will appear in a light gray box above the organic results, in an attempt to directly answer long-tail questions. Recipes are found for food-related searches and also appear prominently on a search engine results page.<\/p>\n<p>Sometimes these boxes are known as “zero position” as they appear even before the first organic result.<\/p>\n<p>They should be respected and coveted because of the exposure that comes with them. SEO is all about receiving exposure, and exposure is driven by visibility within the search engine results page.<\/p>\n<h2><span id=\"In_Conclusion\">In Conclusion<\/span><\/h2>\n<p>Familiarize yourself with these growing trends to ensure that your SEO efforts are not unseated in 2019 and the new years ahead. By continuing to monitor the industry and note changes to search algorithms, you will protect your SEO campaigns and maintain your well-earned spot on top.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 User Intent2 Optimize Beyond Google3 Apply Structured Data4 Content is (Still) King5 Focus on the Technical Aspects of SEO6 Machine Learning7 Aim for Search Engine Results Page Features8 In Conclusion SEO is more than a marketing fad. It is a necessity for online exposure in 2019. It is through search engine optimization that you [&hellip;]<\/p>\n","protected":false},"author":10,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[351],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>SEO Trends 2019: The Latest &amp; Most Current Tactics that Actually Work<\/title>\n<meta name=\"description\" content=\"SEO now looks far different than SEO looked 10 years ago.So, what are the current trends in SEO that are achieving results? Read on to find out!\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"SEO Trends 2019: The Latest &amp; Most Current Tactics that Actually Work\" \/>\n<meta property=\"og:description\" content=\"SEO now looks far different than SEO looked 10 years ago.So, what are the current trends in SEO that are achieving results? Read on to find out!\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2019-05-29T15:38:48+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-25T22:07:21+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Scott Langdon\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png\",\"width\":600,\"height\":336},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/\",\"name\":\"SEO Trends 2019: The Latest & Most Current Tactics that Actually Work\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#primaryimage\"},\"datePublished\":\"2019-05-29T15:38:48+00:00\",\"dateModified\":\"2021-08-25T22:07:21+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8\"},\"description\":\"SEO now looks far different than SEO looked 10 years ago.So, what are the current trends in SEO that are achieving results? Read on to find out!\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"SEO Trends 2019: The Latest &#038; Most Current Tactics that Actually Work\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8\",\"name\":\"Scott Langdon\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g\",\"caption\":\"Scott Langdon\"},\"description\":\"Scott Langdon is an entrepreneur with over 13 years of internet marketing experience. In 2001 Scott founded one of the largest financial affiliate networks online and later sold it to a public company in December of 2008. He brings operational experience with nearly all forms of internet marketing such SEO, PPC, Affiliate Marketing, and Display.\",\"url\":\"https:\/\/www.highervisibility.com\/author\/slangdon\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"SEO Trends 2019: The Latest & Most Current Tactics that Actually Work","description":"SEO now looks far different than SEO looked 10 years ago.So, what are the current trends in SEO that are achieving results? Read on to find out!","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/","og_locale":"en_US","og_type":"article","og_title":"SEO Trends 2019: The Latest & Most Current Tactics that Actually Work","og_description":"SEO now looks far different than SEO looked 10 years ago.So, what are the current trends in SEO that are achieving results? Read on to find out!","og_url":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2019-05-29T15:38:48+00:00","article_modified_time":"2021-08-25T22:07:21+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png"}],"twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Scott Langdon","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/05\/user-intent.png","width":600,"height":336},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/","name":"SEO Trends 2019: The Latest & Most Current Tactics that Actually Work","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#primaryimage"},"datePublished":"2019-05-29T15:38:48+00:00","dateModified":"2021-08-25T22:07:21+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8"},"description":"SEO now looks far different than SEO looked 10 years ago.So, what are the current trends in SEO that are achieving results? Read on to find out!","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/seo-trends\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/seo-trends\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"SEO Trends 2019: The Latest &#038; Most Current Tactics that Actually Work"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a059ebce70fb0fb95156d35aedf9fb8","name":"Scott Langdon","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/9ecdfc37907b677a7255ae34d576bfe3?s=96&d=mm&r=g","caption":"Scott Langdon"},"description":"Scott Langdon is an entrepreneur with over 13 years of internet marketing experience. In 2001 Scott founded one of the largest financial affiliate networks online and later sold it to a public company in December of 2008. He brings operational experience with nearly all forms of internet marketing such SEO, PPC, Affiliate Marketing, and Display.","url":"https:\/\/www.highervisibility.com\/author\/slangdon\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13376"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/10"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=13376"}],"version-history":[{"count":2,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13376\/revisions"}],"predecessor-version":[{"id":16845,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13376\/revisions\/16845"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=13376"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=13376"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=13376"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}