{"id":13426,"date":"2019-06-18T10:44:13","date_gmt":"2019-06-18T15:44:13","guid":{"rendered":"https:\/\/www.highervisibility.com\/?p=13426"},"modified":"2021-08-26T15:46:37","modified_gmt":"2021-08-26T20:46:37","slug":"breadcrumbs-seo","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/","title":{"rendered":"Breadcrumbs &amp; SEO: What Are They and How They&#8217;re Important for SEO"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><li><a href=\"#What_are_Breadcrumbs\"><span class=\"toc_number toc_depth_1\">1<\/span> What are Breadcrumbs?<\/a><\/li><li><a href=\"#Types_of_Breadcrumbs\"><span class=\"toc_number toc_depth_1\">2<\/span> Types of Breadcrumbs<\/a><ul><li><a href=\"#Hierarchy_Based_Breadcrumbs\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Hierarchy Based Breadcrumbs:<\/a><\/li><li><a href=\"#Attribute-Based_Breadcrumbs\"><span class=\"toc_number toc_depth_2\">2.2<\/span> Attribute-Based Breadcrumbs:<\/a><\/li><li><a href=\"#History_Based_Breadcrumbs\"><span class=\"toc_number toc_depth_2\">2.3<\/span> History Based Breadcrumbs:<\/a><\/li><\/ul><\/li><li><a href=\"#Benefits_of_Breadcrumbs_for_Users\"><span class=\"toc_number toc_depth_1\">3<\/span> Benefits of Breadcrumbs for Users<\/a><\/li><li><a href=\"#Benefits_of_Breadcrumbs_for_SEO\"><span class=\"toc_number toc_depth_1\">4<\/span> Benefits of Breadcrumbs for SEO<\/a><\/li><li><a href=\"#How_to_Add_Breadcrumbs_to_Your_Site\"><span class=\"toc_number toc_depth_1\">5<\/span> How to Add Breadcrumbs to Your Site<\/a><\/li><li><a href=\"#In_Conclusion\"><span class=\"toc_number toc_depth_1\">6<\/span> In Conclusion<\/a><\/li><\/ul><\/div>\n<p>A trail of breadcrumbs is a storytelling element used to describe a path that one leaves to find their way back to their starting point. It began in the German fairy tale Hansel and Gretel and has since become a common reference seen throughout pop culture.<\/p>\n<p>On your website, breadcrumbs are navigational tools that not only help users make their way around your site, but also appeal to Google’s search engine algorithm and have a great impact on your <a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">SEO<\/a>.<\/p>\n<p>Bottom line is, you need to use breadcrumbs on your website for both SEO and improvements to the <a href=\"https:\/\/www.highervisibility.com\/blog\/7-ecommerce-user-experience-quick-wins\/\">user experience<\/a>. The user experience should not be overlooked. It is one of the key factors in increasing your rate of retention, the backbone of profitability.<\/p>\n<p>But what exactly are breadcrumbs? How do they help the user experience and your SEO campaign? And how can you implement them into your website?<\/p>\n<h2><span id=\"What_are_Breadcrumbs\">What are Breadcrumbs?<\/span><\/h2>\n<p>Breadcrumbs are a navigational component of a website that helps users successfully navigate various pages without getting confused or lost.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13427\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/what-are-breadcrumbs.png\" alt=\"\" width=\"500\" height=\"179\" \/><\/p>\n<p>Simply put, breadcrumbs are a text path on a website, usually placed at the top of a page, which shows the path you’ve taken to get to a certain section of the site.<\/p>\n<p>Let’s say you’re on the Testimonial video page of a website. To get on that page you first visited the home page. Then you navigated to their clients page. Once there, you clicked on case studies, and from there you found the testimonial videos page.<\/p>\n<p>A set of history based breadcrumbs that would highlight such a journey would look something like this:<\/p>\n<p><b>Home &gt; Clients &gt; Case Studies &gt; Testimonial Videos<\/b><\/p>\n<p>The breadcrumbs showcase exactly how you journeyed throughout the site. It’s telling you not only where you are but where you’ve been previously. What’s more, each highlighted step of the journey can be clicked on to instantly navigate from a current page back to a previous page.<\/p>\n<p>Another interesting factoid about breadcrumbs is that they can be featured in Google search engine results pages.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13428\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/serp-breadcrumbs.png\" alt=\"\" width=\"1047\" height=\"498\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/serp-breadcrumbs.png 1047w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/serp-breadcrumbs-770x366.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/serp-breadcrumbs-768x365.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/serp-breadcrumbs-841x400.png 841w\" sizes=\"(max-width: 1047px) 100vw, 1047px\" \/><\/p>\n<p>If you have breadcrumbs in place on your site, when you pop up in a Google search, the page that you’re linking to will have the breadcrumbs listed beneath the title of the page. This helps users understand where the pages they navigate to are on your site in relation to many of the main hubs.<\/p>\n<p>It’s an extra feature that is more attractive to users. Even if the page the search engine is linking to is not what they’re looking for, a breadcrumb for something that they are interested in might catch their eye.<\/p>\n<h2><span id=\"Types_of_Breadcrumbs\">Types of Breadcrumbs<\/span><\/h2>\n<p>Website breadcrumbs are not so simply defined. In fact, there are multiple different types of breadcrumbs one might use on their website.<\/p>\n<p>Namely, there are three different kinds of breadcrumbs. We will go into each of them in detail, explaining the differences so that you can decide which type you want to use on your site.<\/p>\n<h3><span id=\"Hierarchy_Based_Breadcrumbs\">Hierarchy Based Breadcrumbs:<\/span><\/h3>\n<p>Hierarchy based breadcrumbs are the most common form of website breadcrumbs. If you’ve encountered breadcrumbs in the past, it’s very likely they were of this type.<\/p>\n<p>Hierarchy based breadcrumbs tell you where you are in relation to major hubs that are found on the site. A prime example would be the home page.<\/p>\n<p>Rather than tell you where you’ve been already, it navigates a path back to that main page. Meaning that no matter where you enter the site, you’ll always be able to find a way back home.<\/p>\n<h3><span id=\"Attribute-Based_Breadcrumbs\">Attribute-Based Breadcrumbs:<\/span><\/h3>\n<p>Attribute-based breadcrumbs are usually found on an <a href=\"https:\/\/www.highervisibility.com\/ecommerce-seo-services\/\">ecommerce<\/a> website. They create a breadcrumb trail featuring the attributes of the product or products you’re searching for.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13429\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/bestbuy-breadcrumbs.png\" alt=\"\" width=\"600\" height=\"279\" \/><\/p>\n<p>If someone was looking for a black men’s leather jacket in size XL, their attribute based breadcrumb trail would read something like this:<\/p>\n<p><b>Home &gt; Jackets &gt; Men’s Jackets &gt; XL &gt; Black &gt; Leather<\/b><\/p>\n<p>This makes the product search far easier, allowing shoppers to backtrack when needed and refine their search parameters.<\/p>\n<h3><span id=\"History_Based_Breadcrumbs\">History Based Breadcrumbs:<\/span><\/h3>\n<p>As one could guess from the name, history-based breadcrumbs deal directly with your browsing history and how you’ve personally navigated the site. Breadcrumb links at the top of the page feature the various pages you’ve already visited, listed in the order that they were navigated to.<\/p>\n<p>It shows the history of your journey throughout the site, negating the need to ever use a “back” button. If you entered the site via a contact us page, then navigated around to check out some features and read up on the staff before looking at the homepage, your history based breadcrumb trail would look like this.<\/p>\n<p><b>Contact Us &gt; Features &gt; Staff &gt; Home<\/b><\/p>\n<h2><span id=\"Benefits_of_Breadcrumbs_for_Users\">Benefits of Breadcrumbs for Users<\/span><\/h2>\n<p>The main benefit that breadcrumbs have for users is that it enhances the user experience.<\/p>\n<p>It cannot be overstated how vital user experience is for the success or failure of your site. You could have the greatest SEO on the planet, featured at number one for every keyword. But, if your user experience is lacking, you will find that those clicks are not converting.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13430\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/target-breadcrumbs.png\" alt=\"\" width=\"602\" height=\"315\" \/><\/p>\n<p>You have to have a website that is both optimized for SEO and optimized for the user. Breadcrumbs help with both.<\/p>\n<p>For users, they help people avoid becoming lost on your site. This reduces friction and frustration as users navigate through your pages.<\/p>\n<p>Breadcrumbs are particularly helpful for users because they are a fairly common interface that your website visitors will be more familiar with.<\/p>\n<p>By using breadcrumbs, it is far easier for the user to navigate back to an earlier page. They could even navigate back several pages with one click, something that a back button is unable to provide.<\/p>\n<p>This should substantially lower the bounce rate of your site.<\/p>\n<p>Another important function of breadcrumbs from the standpoint of website usability is that it gives users a path back to your homepage, even if they’ve never visited it previously. Remember: people don’t typically find websites through the homepage. Usually, it is through a product page or service function that was linked in a search engine results page.<\/p>\n<p>That’s why every page of the site needs to be treated as an entry point, with breadcrumbs serving as a path for users entering through a product link.<\/p>\n<p>Breadcrumbs serve an important function, offering an alternative navigational option so that users won’t leave. When a user enters your site through a product page, they need a clear path to the other sections of your site, particularly those where they can gain information and convert.<\/p>\n<p>If they hit the back button from one of those entry points, they will just go back to the search engine results page, where they can find all of your competitors.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13431\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/user-experience.png\" alt=\"\" width=\"996\" height=\"791\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/user-experience.png 996w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/user-experience-630x500.png 630w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/user-experience-768x610.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/user-experience-504x400.png 504w\" sizes=\"(max-width: 996px) 100vw, 996px\" \/><\/p>\n<p>Make no mistake about it, the user experience matters.<\/p>\n<p>Regardless of how good your SEO might be, a poorly optimized site could lead to a huge bounce rate. That’s because<a href=\"https:\/\/www.pinterest.com\/pin\/222294931583997767\/?lp=true\" target=\"_blank\" rel=\"nofollow\"> 79% of users will abandon a non optimized site<\/a>. This is even more true for mobile users, who are <a href=\"https:\/\/www.pinterest.com\/pin\/222294931583997767\/?lp=true\" target=\"_blank\" rel=\"nofollow\">five times more likely to bounce from your site<\/a> if it is not set up accordingly.<\/p>\n<h2><span id=\"Benefits_of_Breadcrumbs_for_SEO\">Benefits of Breadcrumbs for SEO<\/span><\/h2>\n<p>We’ve covered why breadcrumbs are essential to the user experience, but how can they help those same users find you on Google?<\/p>\n<p>Breadcrumbs are a huge bonus for Google and can have a great impact on your SEO score. It allows Google to more easily determine the structure of your site, which is more appealing in the long run toward a good score.<\/p>\n<p>As we have mentioned before, breadcrumbs can become a feature on your Google search engine result, which is very appealing to users and is more likely to get clicks. This could be a great way to ensure that, even if you’re not the first option on the results page, you’re still getting a good amount of traffic.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13432\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/breadcrumb-markup.png\" alt=\"\" width=\"807\" height=\"307\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/breadcrumb-markup.png 807w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/breadcrumb-markup-770x293.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/breadcrumb-markup-768x292.png 768w\" sizes=\"(max-width: 807px) 100vw, 807px\" \/><\/p>\n<p>When applying breadcrumbs to your site, it’s important to utilize structured data on the back end to make it more appealing to Google and easier to integrate into a search engine results page.<\/p>\n<p>Structured data is able to directly communicate with the search engine, and completely takes all the guesswork out of the equation.<\/p>\n<p>By adding breadcrumbs to your site and backing them up with structured data, you’re allowing Google to highlight your site more easily.<\/p>\n<h2><span id=\"How_to_Add_Breadcrumbs_to_Your_Site\">How to Add Breadcrumbs to Your Site<\/span><\/h2>\n<p>Now that we know all the benefits of adding breadcrumbs to your site, both for users and SEO, how can we go about actually doing it?<\/p>\n<p>Luckily, the process has become highly simplified over the years, so you don’t need a web design degree and decades of experience to be able to incorporate them. (Though those do help)<\/p>\n<p>The easiest way to incorporate breadcrumbs into your site would be to use a plugin system. There are many breadcrumb plugins that are available for a lot of the top website builders out there, including WordPress.<\/p>\n<p>Using these applications, it becomes a simple matter to highlight what breadcrumbs you want and apply them, usually with nothing more than the click of a button. Obviously, this is the simplest way to incorporate breadcrumbs. Anyone can easily do this and it takes no website expertise whatsoever.<\/p>\n<p>There are, of course, other more-involved ways in which to apply breadcrumbs to your site. These powerful navigational tools can also be plugged into the code manually by a web designer.<\/p>\n<p>Remember, to be truly effective and catch the eye of Google’s search algorithm, breadcrumbs that are entered into a site need to be accompanied by structured data. This allows the breadcrumbs to be more easily integrated into a search engine results page.<\/p>\n<p>That is why, despite the ease of WordPress or Wix plugins, it is usually best to entrust the application of website breadcrumbs to a professional web designer.<\/p>\n<p>Whether this is someone working in-house or as a part of an outside firm (or freelance hire) does not matter, but if you’re going to be installing them manually with structured data, you might need some extra help.<\/p>\n<p>Website code can be tricky, with one mistake leading to a slew of issues both to the design and functionality of your site. It is not something that should be left in the hands of amateurs.<\/p>\n<p>When coding your breadcrumbs, remember that the breadcrumb code is often found within single.php and page.php files. These should also be inputted above the page title, so as not to cause a design issue.<\/p>\n<p>When coding your breadcrumbs, make sure that you’re not adding the code to functions.php files. This will lead to otherwise preventable issues.<\/p>\n<p>If this sounds like complicated technobabble to you then it’s time to invest in a professional website designer to make these structured changes.<\/p>\n<h2><span id=\"In_Conclusion\">In Conclusion<\/span><\/h2>\n<p>If you’re presenting a website without breadcrumbs to Google and your users, you’re doing a disservice to yourself.<\/p>\n<p>When you consider how effective breadcrumbs are at creating a more informative search engine result and improving your overall customer experience, it becomes a no-brainer decision.<\/p>\n<p>Incorporate website breadcrumbs into your site and help your SEO score while also making your site more accessible to users.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 What are Breadcrumbs?2 Types of Breadcrumbs2.1 Hierarchy Based Breadcrumbs:2.2 Attribute-Based Breadcrumbs:2.3 History Based Breadcrumbs:3 Benefits of Breadcrumbs for Users4 Benefits of Breadcrumbs for SEO5 How to Add Breadcrumbs to Your Site6 In Conclusion A trail of breadcrumbs is a storytelling element used to describe a path that one leaves to find their way back [&hellip;]<\/p>\n","protected":false},"author":2,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[351],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Breadcrumbs &amp; SEO: What Are They and How They&#039;re Important for SEO | HigherVisibility<\/title>\n<meta name=\"description\" content=\"Breadcrumbs are navigational tools that not only help users make their way around your site, but also have a great impact on your SEO.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Breadcrumbs &amp; SEO: What Are They and How They&#039;re Important for SEO\" \/>\n<meta property=\"og:description\" content=\"Breadcrumbs are navigational tools that not only help users make their way around your site, but also have a great impact on your SEO.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2019-06-18T15:44:13+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-26T20:46:37+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/what-are-breadcrumbs.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam Heitzman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/what-are-breadcrumbs.png\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/what-are-breadcrumbs.png\",\"width\":500,\"height\":179},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/\",\"name\":\"Breadcrumbs &amp; SEO: What Are They and How They're Important for SEO | HigherVisibility\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#primaryimage\"},\"datePublished\":\"2019-06-18T15:44:13+00:00\",\"dateModified\":\"2021-08-26T20:46:37+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\"},\"description\":\"Breadcrumbs are navigational tools that not only help users make their way around your site, but also have a great impact on your SEO.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Breadcrumbs &#038; SEO: What Are They and How They&#8217;re Important for SEO\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936\",\"name\":\"Adam Heitzman\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g\",\"caption\":\"Adam Heitzman\"},\"description\":\"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.\",\"url\":\"https:\/\/www.highervisibility.com\/author\/aheitzman\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Breadcrumbs &amp; SEO: What Are They and How They're Important for SEO | HigherVisibility","description":"Breadcrumbs are navigational tools that not only help users make their way around your site, but also have a great impact on your SEO.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/","og_locale":"en_US","og_type":"article","og_title":"Breadcrumbs &amp; SEO: What Are They and How They're Important for SEO","og_description":"Breadcrumbs are navigational tools that not only help users make their way around your site, but also have a great impact on your SEO.","og_url":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2019-06-18T15:44:13+00:00","article_modified_time":"2021-08-26T20:46:37+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/what-are-breadcrumbs.png"}],"twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Adam Heitzman","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/what-are-breadcrumbs.png","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2019\/06\/what-are-breadcrumbs.png","width":500,"height":179},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/","name":"Breadcrumbs &amp; SEO: What Are They and How They're Important for SEO | HigherVisibility","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#primaryimage"},"datePublished":"2019-06-18T15:44:13+00:00","dateModified":"2021-08-26T20:46:37+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936"},"description":"Breadcrumbs are navigational tools that not only help users make their way around your site, but also have a great impact on your SEO.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/breadcrumbs-seo\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Breadcrumbs &#038; SEO: What Are They and How They&#8217;re Important for SEO"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/0a44852283d4b6a33628a2a507538936","name":"Adam Heitzman","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/cd3fcd4f6ccde47f47046296ab8043fd?s=96&d=mm&r=g","caption":"Adam Heitzman"},"description":"With over 10 years of experience in online marketing and development, Adam Heitzman has learned the many facets of the internet marketing world and the strategies it takes to succeed. Currently he writes for HigherVisibility, where he focuses on providing the latest news and tips to help the novice webmaster hone their online marketing skills. Before founding HigherVisibility in 2007, Adam worked as an Marketing Executive with several publicly traded companies.","url":"https:\/\/www.highervisibility.com\/author\/aheitzman\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13426"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/2"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=13426"}],"version-history":[{"count":6,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13426\/revisions"}],"predecessor-version":[{"id":16893,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/13426\/revisions\/16893"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=13426"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=13426"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=13426"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}