{"id":14698,"date":"2020-08-18T16:16:00","date_gmt":"2020-08-18T21:16:00","guid":{"rendered":"https:\/\/www.highervisibility.com\/?p=14698"},"modified":"2020-08-18T16:20:11","modified_gmt":"2020-08-18T21:20:11","slug":"online-marketing-rfp","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/","title":{"rendered":"Online Marketing RFP Template With Sample Questions"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><ul><li><a href=\"#Download_Now_Free_Online_Marketing_RFP_Template\"><span class=\"toc_number toc_depth_2\">0.1<\/span> Download Now: Free Online Marketing RFP Template<\/a><\/li><\/ul><\/li><li><a href=\"#What_Is_an_Online_Marketing_RFP_Exactly\"><span class=\"toc_number toc_depth_1\">1<\/span> What Is an Online Marketing RFP Exactly?<\/a><\/li><li><a href=\"#Why_Use_an_Online_Marketing_RFP_Template\"><span class=\"toc_number toc_depth_1\">2<\/span> Why Use an Online Marketing RFP Template?<\/a><\/li><li><a href=\"#Whats_Usually_Included_in_an_Online_Marketing_RFP\"><span class=\"toc_number toc_depth_1\">3<\/span> What’s Usually Included in an Online Marketing RFP<\/a><ul><li><a href=\"#Your_company\"><span class=\"toc_number toc_depth_2\">3.1<\/span> Your company<\/a><\/li><li><a href=\"#Your_current_digital_presence\"><span class=\"toc_number toc_depth_2\">3.2<\/span> Your current digital presence<\/a><\/li><li><a href=\"#Who_your_competitors_are\"><span class=\"toc_number toc_depth_2\">3.3<\/span> Who your competitors are<\/a><\/li><li><a href=\"#Your_target_audience\"><span class=\"toc_number toc_depth_2\">3.4<\/span> Your target audience<\/a><\/li><li><a href=\"#Your_overall_goal\"><span class=\"toc_number toc_depth_2\">3.5<\/span> Your overall goal<\/a><\/li><li><a href=\"#Your_business_goals\"><span class=\"toc_number toc_depth_2\">3.6<\/span> Your business goals<\/a><\/li><li><a href=\"#Your_objectives\"><span class=\"toc_number toc_depth_2\">3.7<\/span> Your objectives<\/a><\/li><li><a href=\"#Your_time_frame\"><span class=\"toc_number toc_depth_2\">3.8<\/span> Your time frame<\/a><\/li><li><a href=\"#Your_budget\"><span class=\"toc_number toc_depth_2\">3.9<\/span> Your budget<\/a><\/li><li><a href=\"#Selection_timeline_and_requirements\"><span class=\"toc_number toc_depth_2\">3.10<\/span> Selection timeline and requirements<\/a><\/li><li><a href=\"#Standard_Master_Services_Agreement\"><span class=\"toc_number toc_depth_2\">3.11<\/span> Standard Master Services Agreement<\/a><\/li><li><a href=\"#What_you_expect_in_return\"><span class=\"toc_number toc_depth_2\">3.12<\/span> What you expect in return<\/a><\/li><li><a href=\"#Contact_and_questions\"><span class=\"toc_number toc_depth_2\">3.13<\/span> Contact and questions<\/a><\/li><\/ul><\/li><li><a href=\"#Why_Its_Important_to_Nail_Your_RFP\"><span class=\"toc_number toc_depth_1\">4<\/span> Why It’s Important to Nail Your RFP<\/a><\/li><li><a href=\"#Final_Thoughts\"><span class=\"toc_number toc_depth_1\">5<\/span> Final Thoughts<\/a><ul><li><a href=\"#Download_Now_Free_Online_Marketing_RFP_Template-2\"><span class=\"toc_number toc_depth_2\">5.1<\/span> Download Now: Free Online Marketing RFP Template<\/a><\/li><\/ul><\/li><\/ul><\/div>\n<p>It doesn’t matter if this is your first online marketing request for proposal (RFP) or your 50th — digital marketing RFPs can be complicated, time-consuming, and — depending on your company’s status — a bit precarious, too.<\/p>\n<p>On top of that, improving your understanding of online marketing while looking for online firms to help bring your company to the next level is just as complicated and costly. That’s part of the reason why we’ve put together both a guide to online marketing RFPs and a digital marketing RFP template, the latter of which is available for free download.<\/p>\n<div class='incontent-cta'><h3><span id=\"Download_Now_Free_Online_Marketing_RFP_Template\">Download Now: Free Online Marketing RFP Template<\/span><\/h3><p><p>If you are vetting online marketing agencies and need an RFP template that can be customized to your needs, simply enter your email and we will instantly send you the template.<\/p>\n<\/p><div class='form-action'><div class=\"frm_forms  with_frm_style frm_style_hv-form-style\" id=\"frm_form_715_container\" >\n<form enctype=\"multipart\/form-data\" method=\"post\" class=\"frm-show-form  frm_pro_form  frm_ajax_submit \" id=\"form_b6plo856ffe7550c48d02b68f2c6ebae08e\"  >\n<div class=\"frm_form_fields \">\n\n<div class=\"frm_fields_container\">\n<input type=\"hidden\" name=\"frm_action\" value=\"create\" \/>\n<input type=\"hidden\" name=\"form_id\" value=\"715\" \/>\n<input type=\"hidden\" name=\"frm_hide_fields_715\" id=\"frm_hide_fields_715\" value=\"\" \/>\n<input type=\"hidden\" name=\"form_key\" value=\"b6plo856ffe7550c48d02b68f2c6ebae08e\" \/>\n<input type=\"hidden\" name=\"item_meta[0]\" value=\"\" \/>\n<input type=\"hidden\" id=\"frm_submit_entry_715\" name=\"frm_submit_entry_715\" value=\"8dd016a78c\" \/><input type=\"hidden\" name=\"_wp_http_referer\" value=\"\/wp-json\/wp\/v2\/posts\/14698\" \/><input type=\"email\" id=\"field_crn8oa00e19c4804ed6db44da7b9f86816c\" name=\"item_meta[4703]\" value=\"\"  placeholder=\"Enter your email\" data-reqmsg=\"Please enter an email address.\" aria-required=\"true\" data-invmsg=\"Please enter a valid email address.\" aria-invalid=\"false\"  \/>\r\n\n<div id=\"frm_field_4710_container\" class=\"frm_form_field form-field  frm_none_container\">\n    <label for=\"g-recaptcha-response\" id=\"field_2gai9_label\" class=\"frm_primary_label\">reCAPTCHA\n        <span class=\"frm_required\"><\/span>\n    <\/label>\n    \n    \n    \n<\/div>\n<input type=\"hidden\" name=\"item_meta[4704]\" id=\"field_homb37d6b1e5dc76feaa33eb88d33988adf\" value=\"175.176.4.128\"  data-frmval=\"175.176.4.128\" data-invmsg=\"User IP is invalid\"   \/>\n<input type=\"hidden\" name=\"item_meta[4705]\" id=\"field_8ih9a12090a12fd825eb568158c0354f03f\" value=\"09\/08\/2021 01:57:56\"  data-frmval=\"09\/08\/2021 01:57:56\" data-invmsg=\"Time Stamp is invalid\"   \/>\n\t<input type=\"hidden\" name=\"item_key\" value=\"\" \/>\n\t<input name=\"frm_state\" type=\"hidden\" value=\"wTYNfagm1n2Z5xfePOlBfONjJ3n95gqxJ\/GE8pLbGjo=\" \/><button class=\"frm_button_submit frm_final_submit button primary\" type=\"submit\"   formnovalidate=\"formnovalidate\">Download Now<\/button><\/div>\n\n<\/div>\n<\/form>\n<\/div>\n<\/div><\/div>\n<h2><span id=\"What_Is_an_Online_Marketing_RFP_Exactly\">What Is an Online Marketing RFP Exactly?<\/span><\/h2>\n<p>While an RFP is simply an outline of criteria that a company gives to firms to respond to, an online marketing RFP is tailored to — you guessed it — online marketing.<\/p>\n<p>A digital marketing RFP will help you achieve your business goals. With an RFP, you’ll be able to offer a clear-cut proposal that prospective agencies can visualize and understand better, which is helpful for both parties. It’ll also allow you to discuss what you’re looking for within your company internally, so you can skip the “multiple revisions” stage that comes with weak RFPs.<\/p>\n<p>Relying on the RFP process will also make sure the firms have a written set of criteria so they can come back with solutions that fit the selection criteria you’re looking for.<\/p>\n<p>A digital marketing RFP is perfect for those looking for an outside entity — specifically a digital marketing agency — to help you bring your company to the next level through social media, Google Analytics, or other technological solutions.<\/p>\n<h2><span id=\"Why_Use_an_Online_Marketing_RFP_Template\">Why Use an Online Marketing RFP Template?<\/span><\/h2>\n<p>Searching for a digital agency that aligns with your aspirations and values can be a tricky process. In fact, the online marketing RFP writing process itself is challenging.<\/p>\n<p>It can be extremely time-consuming. Unless you have hours and hours of free time, it can be challenging to carve out time during the day to work on an online marketing RFP.<\/p>\n<p>Sometimes, as an RFP writer, it can be hard to know precisely what you desire from a firm. A digital marketing RFP template will lay that out for you nicely so you can pinpoint exactly what you want from the agency.<\/p>\n<p>Finally, writing a digital marketing RFP is risky. Imagine spending hours and hours writing what seems to be the perfect proposal only for it to go nowhere.<\/p>\n<p>We’re no strangers to online marketing RFPs — we’ve seen some truly impressive proposals and a handful of laughable RFPs. But our digital marketing RFP template makes it easier for both parties: Not only will it be easier to write and organize, but that’ll make it easy for the company to review it as well.<\/p>\n<p>Digital marketing RFPs don’t have to be an enigma. Our template should guide you through every part of the process. We’ll also share some helpful tips and tricks that might make the process even easier for you.<\/p>\n<h2><span id=\"Whats_Usually_Included_in_an_Online_Marketing_RFP\">What’s Usually Included in an Online Marketing RFP<\/span><\/h2>\n<p>The beautiful thing about digital marketing RFPs is that they can be very versatile, depending on the company or person writing them.<\/p>\n<p>Although your RFP can be whatever you envision, we’re going to cover some common areas that online marketing RFPs usually include. That being said, not all of these topics will apply to you, and even if they do, you might choose to omit some aspects — that’s all to be expected.<\/p>\n<h3><span id=\"Your_company\">Your company<\/span><\/h3>\n<p>One of the best places to start is who you are. Unless your company already has a robust digital presence, chances are, the firms you contact won’t be familiar with your company, and that’s OK.<\/p>\n<p>Here, you’ll want to share information about your company’s background, where it is now, where you’re looking to go, and any core values and missions that you’d like to include. How many employees do you have? Is there more than one location?<\/p>\n<p>This might also be an appropriate place to briefly explain why you’re interested in digital marketing. You can also end with a concise summary of what you’re looking for in an agency partner. For example, you might want agencies that have years of experience in a particular area.<\/p>\n<h3><span id=\"Your_current_digital_presence\">Your current digital presence<\/span><\/h3>\n<p>You’ll want to be as honest and accurate as possible in this section. Here, you’ll be describing your current digital presence and what that looks like.<\/p>\n<p>I’d suggest detailing the current online marketing strategies your company uses, including what’s working, what isn’t, and what you wish could work better.<\/p>\n<p>Within this sphere, you can also discuss any and all marketing challenges that come to mind when you think of your digital presence. For example, maybe you’re struggling with low retention rates, or perhaps the in-house content you have isn’t up to par for your audience.<\/p>\n<p>Even if it’s painful to recall your shortcomings and what’s not working for you, this will be the best way for potential firms to know how to develop a personalized marketing strategy for you and your business. Everyone faces marketing program challenges, and you shouldn&#8217;t be ashamed of them.<\/p>\n<h3><span id=\"Who_your_competitors_are\">Who your competitors are<\/span><\/h3>\n<p>Identifying at least three competitors (and their websites) will help potential firms see who you’re up against. Agencies can then know what you’re doing well compared to companies that might already be doing it better.<\/p>\n<p>You might also consider sharing any of the competitors’ social media accounts and advertising campaigns that impress you, so the potential agencies can tailor their solution to hitting some of those marketing goals.<\/p>\n<h3><span id=\"Your_target_audience\">Your target audience<\/span><\/h3>\n<p>When you think of your ideal customer, what do they look like? In other words, who’s your target audience? When thinking of your target audience, you’ll want to include both demographic and even psychographic information to provide firms with a visual to the audience you’re attracting.<\/p>\n<p>It would be worthwhile to create a few personas to show these agencies and help them better visualize the customer.<\/p>\n<h3><span id=\"Your_overall_goal\">Your overall goal<\/span><\/h3>\n<p>This is an excellent place to introduce your specific goals concisely. I wouldn’t advise writing a lengthy goal that’s bogged down with many details, since we’ll get into the meat of your digital marketing RFP later. Pick one to three outcomes that you’d like the online marketing firm to do for you.<\/p>\n<h3><span id=\"Your_business_goals\">Your business goals<\/span><\/h3>\n<p>Your business goals will probably be similar to your overall goal, but we’ll dive a little deeper into this section. What do you want your future online marketing strategy to do, exactly? What would be a successful marketing strategy in your eyes?<\/p>\n<p>Make sure they’re both realistic and achievable. For example, maybe you just want to increase your revenue for the next fiscal year. That’s an entirely reasonable business goal.<\/p>\n<p>In this section (or in a new section), you can include the scope of the work you need, even if it’s an estimate. For example, what are your specific needs per digital channel? To make it easier, you can also include a list of deliverables that you have in mind.<\/p>\n<h3><span id=\"Your_objectives\">Your objectives<\/span><\/h3>\n<p>In order to achieve your business goals, you’ve got to have objectives — written plans that will help you get to the next level. This will help visualize the project overview, too.<\/p>\n<p>Although you might already know what your objectives are, you should be very granular on the exact scope of work based on what marketing services you want or think you need:<\/p>\n<ul>\n<li>Improved search engine optimization (<a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">SEO<\/a>) for your website<\/li>\n<li>Effective <a href=\"https:\/\/www.highervisibility.com\/ppc-management\/\">PPC<\/a> campaign<\/li>\n<li>A <a href=\"https:\/\/www.highervisibility.com\/social-media-marketing\/\">social media<\/a> strategy or campaign<\/li>\n<li>An email marketing strategy<\/li>\n<\/ul>\n<h3><span id=\"Your_time_frame\">Your time frame<\/span><\/h3>\n<p>Some companies don’t have a specific timeline, but if you do, include it here. How soon do you want to see results? This section will also help you avoid firms that don’t have the bandwidth to finish this project based on your provided time frame.<\/p>\n<h3><span id=\"Your_budget\">Your budget<\/span><\/h3>\n<p>This section is essential. How much are you willing to pay these agencies to assist with a successful digital marketing strategy? This section, in particular, will help you steer clear of agencies that aren’t willing to meet you in the middle.<\/p>\n<p>Even if you don’t have a budget, you should still include a range so the firm will have some idea of what the costs will be.<\/p>\n<h3><span id=\"Selection_timeline_and_requirements\">Selection timeline and requirements<\/span><\/h3>\n<p>To better help you stick to a rigid timeline, outline some critical dates that will affect your selection process. For example, you could include:<\/p>\n<ul>\n<li>When the proposals are due<\/li>\n<li>A timeline of the question and answer period<\/li>\n<li>When you’ll select an agency<\/li>\n<li>What date the project will start<\/li>\n<\/ul>\n<p>On the first day, you’ll send out the digital marketing RFP, and a few days later, you might choose to cut off anyone who doesn’t RSVP. You’ll probably schedule a few calls with viable firms for about a week and answer any questions they might have. A week after that, it might be time for the firms to submit their proposals. Although this is an example, the actual timeline is entirely up to you.<\/p>\n<p>In this section, you can also detail how you’ll choose an agency partner. Will you use a scoring system? What selection criteria will you include?<\/p>\n<h3><span id=\"Standard_Master_Services_Agreement\">Standard Master Services Agreement<\/span><\/h3>\n<p>Your company’s legal team might suggest you use a standard Master Services Agreement, also called an MSA. If this is the case, a potential firm or agency might also include their own terms and conditions.<\/p>\n<h3><span id=\"What_you_expect_in_return\">What you expect in return<\/span><\/h3>\n<p>What information would you like from potential firms? If you clearly state what sort of information you expect, the likely agencies can better cater to providing it. You might prefer to know the history of the agency, examples of case studies, what qualifications and experience it has, account management process, and pricing, among other pieces of intel.<\/p>\n<h3><span id=\"Contact_and_questions\">Contact and questions<\/span><\/h3>\n<p>You should provide a point of contact for agencies to reach out to, whether it&#8217;s your public relations director or another trusted key stakeholder. You should include their:<\/p>\n<ul>\n<li>Full legal name<\/li>\n<li>Job title<\/li>\n<li>Mailing address<\/li>\n<li>Email and phone number<\/li>\n<\/ul>\n<p>That way, you can direct any specific questions that might come up during the proposal period to one single contact to make it easier.<\/p>\n<h2><span id=\"Why_Its_Important_to_Nail_Your_RFP\">Why It’s Important to Nail Your RFP<\/span><\/h2>\n<p>So, you’ve got an idea of how to write an online marketing RFP — but why is it so important to get it right?<\/p>\n<p>A proposal is essentially your one change to vet firms before you listen to their pitch. It’ll help you steer clear of firms that won’t be a good fit and, in turn, will prevent you from wasting time. That’s why it’s so critical to be as detailed as possible when you’re creating a digital marketing RFP.<\/p>\n<h2><span id=\"Final_Thoughts\">Final Thoughts<\/span><\/h2>\n<p>An online marketing RFP is what you make it. There’s lots of room to be creative and have fun with it during the RFP process. Staying positive is key, as this proposal is going to be what effectively drives your digital marketing strategy and what determines which agency you might partner with within the next few weeks.<\/p>\n<p>That’s where our digital marketing RFP template comes in. It’ll provide you with a meaningful way to organize your proposal so as to make it clear to both parties. With this template, the digital marketing possibilities are virtually endless. Take the first step to getting your company up to par with the rest of the digital ecosystem.<\/p>\n<div class='incontent-cta'><h3><span id=\"Download_Now_Free_Online_Marketing_RFP_Template-2\">Download Now: Free Online Marketing RFP Template<\/span><\/h3><p><p>If you are vetting online marketing agencies and need an RFP template that can be customized to your needs, simply enter your email and we will instantly send you the template.<\/p>\n<\/p><div class='form-action'><div class=\"frm_forms  with_frm_style frm_style_hv-form-style\" id=\"frm_form_715_container\" >\n<form enctype=\"multipart\/form-data\" method=\"post\" class=\"frm-show-form  frm_pro_form  frm_ajax_submit \" id=\"form_b6plo856ffe7550c48d02b68f2c6ebae08e\"  >\n<div class=\"frm_form_fields \">\n\n<div class=\"frm_fields_container\">\n<input type=\"hidden\" name=\"frm_action\" value=\"create\" \/>\n<input type=\"hidden\" name=\"form_id\" value=\"715\" \/>\n<input type=\"hidden\" name=\"frm_hide_fields_715\" id=\"frm_hide_fields_715\" value=\"\" \/>\n<input type=\"hidden\" name=\"form_key\" value=\"b6plo856ffe7550c48d02b68f2c6ebae08e\" \/>\n<input type=\"hidden\" name=\"item_meta[0]\" value=\"\" \/>\n<input type=\"hidden\" id=\"frm_submit_entry_715\" name=\"frm_submit_entry_715\" value=\"8dd016a78c\" \/><input type=\"hidden\" name=\"_wp_http_referer\" value=\"\/wp-json\/wp\/v2\/posts\/14698\" \/><input type=\"email\" id=\"field_crn8oa00e19c4804ed6db44da7b9f86816c\" name=\"item_meta[4703]\" value=\"\"  placeholder=\"Enter your email\" data-reqmsg=\"Please enter an email address.\" aria-required=\"true\" data-invmsg=\"Please enter a valid email address.\" aria-invalid=\"false\"  \/>\r\n\n<div id=\"frm_field_4710_container\" class=\"frm_form_field form-field  frm_none_container\">\n    <label for=\"g-recaptcha-response\" id=\"field_2gai9_label\" class=\"frm_primary_label\">reCAPTCHA\n        <span class=\"frm_required\"><\/span>\n    <\/label>\n    \n    \n    \n<\/div>\n<input type=\"hidden\" name=\"item_meta[4704]\" id=\"field_homb37d6b1e5dc76feaa33eb88d33988adf\" value=\"175.176.4.128\"  data-frmval=\"175.176.4.128\" data-invmsg=\"User IP is invalid\"   \/>\n<input type=\"hidden\" name=\"item_meta[4705]\" id=\"field_8ih9a12090a12fd825eb568158c0354f03f\" value=\"09\/08\/2021 01:57:56\"  data-frmval=\"09\/08\/2021 01:57:56\" data-invmsg=\"Time Stamp is invalid\"   \/>\n\t<input type=\"hidden\" name=\"item_key\" value=\"\" \/>\n\t<input name=\"frm_state\" type=\"hidden\" value=\"wTYNfagm1n2Z5xfePOlBfONjJ3n95gqxJ\/GE8pLbGjo=\" \/><button class=\"frm_button_submit frm_final_submit button primary\" type=\"submit\"   formnovalidate=\"formnovalidate\">Download Now<\/button><\/div>\n\n<\/div>\n<\/form>\n<\/div>\n<\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 What Is an Online Marketing RFP Exactly?2 Why Use an Online Marketing RFP Template?3 What’s Usually Included in an Online Marketing RFP3.1 Your company3.2 Your current digital presence3.3 Who your competitors are3.4 Your target audience3.5 Your overall goal3.6 Your business goals3.7 Your objectives3.8 Your time frame3.9 Your budget3.10 Selection timeline and requirements3.11 Standard Master [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[3056,3058],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Online Marketing RFP Template With Sample Questions | HigherVisibility<\/title>\n<meta name=\"description\" content=\"Need an online marketing request for proposal (RFP) template? Vetting an agency can be exhaustive, but we&#039;ve got you covered.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Online Marketing RFP Template With Sample Questions\" \/>\n<meta property=\"og:description\" content=\"Need an online marketing request for proposal (RFP) template? Vetting an agency can be exhaustive, but we&#039;ve got you covered.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2020-08-18T21:16:00+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-08-18T21:20:11+00:00\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Adam Heitzman\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/\",\"name\":\"Online Marketing RFP Template With Sample Questions | HigherVisibility\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"datePublished\":\"2020-08-18T21:16:00+00:00\",\"dateModified\":\"2020-08-18T21:20:11+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/db6218bb6b14f97af362b6fbf470ca59\"},\"description\":\"Need an online marketing request for proposal (RFP) template? Vetting an agency can be exhaustive, but we've got you covered.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Online Marketing RFP Template With Sample Questions\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/db6218bb6b14f97af362b6fbf470ca59\",\"name\":\"Adam Heitzman\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/5689b34d030504113e06ee1b15e2881f?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/5689b34d030504113e06ee1b15e2881f?s=96&d=mm&r=g\",\"caption\":\"Adam Heitzman\"},\"url\":\"https:\/\/www.highervisibility.com\/author\/highervis\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Online Marketing RFP Template With Sample Questions | HigherVisibility","description":"Need an online marketing request for proposal (RFP) template? Vetting an agency can be exhaustive, but we've got you covered.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/","og_locale":"en_US","og_type":"article","og_title":"Online Marketing RFP Template With Sample Questions","og_description":"Need an online marketing request for proposal (RFP) template? Vetting an agency can be exhaustive, but we've got you covered.","og_url":"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2020-08-18T21:16:00+00:00","article_modified_time":"2020-08-18T21:20:11+00:00","twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Adam Heitzman","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/","name":"Online Marketing RFP Template With Sample Questions | HigherVisibility","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"datePublished":"2020-08-18T21:16:00+00:00","dateModified":"2020-08-18T21:20:11+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/db6218bb6b14f97af362b6fbf470ca59"},"description":"Need an online marketing request for proposal (RFP) template? Vetting an agency can be exhaustive, but we've got you covered.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/online-marketing-rfp\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Online Marketing RFP Template With Sample Questions"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/db6218bb6b14f97af362b6fbf470ca59","name":"Adam Heitzman","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/5689b34d030504113e06ee1b15e2881f?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/5689b34d030504113e06ee1b15e2881f?s=96&d=mm&r=g","caption":"Adam Heitzman"},"url":"https:\/\/www.highervisibility.com\/author\/highervis\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/14698"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=14698"}],"version-history":[{"count":4,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/14698\/revisions"}],"predecessor-version":[{"id":14705,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/14698\/revisions\/14705"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=14698"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=14698"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=14698"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}