{"id":5862,"date":"2019-03-04T08:00:51","date_gmt":"2019-03-04T14:00:51","guid":{"rendered":"http:\/\/www.highervisibility.com\/?p=5862"},"modified":"2021-01-06T10:32:33","modified_gmt":"2021-01-06T16:32:33","slug":"how-search-queries-work-on-google-webmaster-tools","status":"publish","type":"post","link":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/","title":{"rendered":"How Search Queries Work on Google Search Console"},"content":{"rendered":"<div id=\"toc_container\" class=\"no_bullets\"><p class=\"toc_title\">Contents<\/p><ul class=\"toc_list\"><li><a href=\"#What_is_Google_Search_Console\"><span class=\"toc_number toc_depth_1\">1<\/span> What is Google Search Console?<\/a><\/li><li><a href=\"#How_Search_Queries_Work_on_Google_Search_Console\"><span class=\"toc_number toc_depth_1\">2<\/span> How Search Queries Work on Google Search Console<\/a><ul><li><a href=\"#Clicks\"><span class=\"toc_number toc_depth_2\">2.1<\/span> Clicks<\/a><\/li><li><a href=\"#MOST_WEBSITES_STRUGGLE_WITH_GENERATING_CONSISTENT_ONLINE_LEADS_SALESWE_FIX_THAT\"><span class=\"toc_number toc_depth_2\">2.2<\/span> MOST WEBSITES STRUGGLE WITH GENERATING CONSISTENT ONLINE LEADS & SALES...WE FIX THAT!<\/a><\/li><li><a href=\"#Why_Clicks_Matter\"><span class=\"toc_number toc_depth_2\">2.3<\/span> Why Clicks Matter<\/a><\/li><li><a href=\"#Impressions\"><span class=\"toc_number toc_depth_2\">2.4<\/span> Impressions<\/a><\/li><li><a href=\"#Why_Impressions_Matter\"><span class=\"toc_number toc_depth_2\">2.5<\/span> Why Impressions Matter<\/a><\/li><li><a href=\"#CTR\"><span class=\"toc_number toc_depth_2\">2.6<\/span> CTR<\/a><\/li><li><a href=\"#Why_CTR_Matters\"><span class=\"toc_number toc_depth_2\">2.7<\/span> Why CTR Matters<\/a><\/li><li><a href=\"#Position\"><span class=\"toc_number toc_depth_2\">2.8<\/span> Position<\/a><\/li><li><a href=\"#Why_Position_Matters\"><span class=\"toc_number toc_depth_2\">2.9<\/span> Why Position Matters<\/a><\/li><li><a href=\"#Average_Position\"><span class=\"toc_number toc_depth_2\">2.10<\/span> Average Position<\/a><\/li><li><a href=\"#Why_Average_Position_Matters\"><span class=\"toc_number toc_depth_2\">2.11<\/span> Why Average Position Matters<\/a><\/li><\/ul><\/li><li><a href=\"#Why_Not_Use_Google_Analytics\"><span class=\"toc_number toc_depth_1\">3<\/span> Why Not Use Google Analytics?<\/a><\/li><li><a href=\"#In_Conclusion\"><span class=\"toc_number toc_depth_1\">4<\/span> In Conclusion<\/a><ul><li><a href=\"#MOST_WEBSITES_STRUGGLE_WITH_GENERATING_CONSISTENT_ONLINE_LEADS_SALESWE_FIX_THAT-2\"><span class=\"toc_number toc_depth_2\">4.1<\/span> MOST WEBSITES STRUGGLE WITH GENERATING CONSISTENT ONLINE LEADS & SALES...WE FIX THAT!<\/a><\/li><\/ul><\/li><\/ul><\/div>\n<p><em>Editor’s Note: This post was originally published in April of 2014 and has been updated for accuracy and comprehensiveness. <\/em><\/p>\n<p>Many web-based tools have a wealth of features all designed to drive your business forward. But sometimes it helps to take a major feature of one tool and examine it by itself away from the whole in order to get a better understanding of how it works and why it’s important.<\/p>\n<p>When you look at the world of website management tools, most people prefer to use Google Analytics, completely ignoring the effectiveness of Google Search Console (formerly known as Webmaster Tools) and all of its various features. We encourage the use of Google Analytics, it’s a great tool and it should be a part of any business website. However, Google Search Console should not be overlooked. It features some fantastic information, chief of which are Search Queries.<\/p>\n<p>When Google <a href=\"http:\/\/googleadsdeveloper.blogspot.com\/2014\/04\/security-enhancements-for-search-users.html\" target=\"_blank\" rel=\"nofollow\">announced<\/a> that it would be encrypting all paid data for <a href=\"https:\/\/www.highervisibility.com\/blog\/3-ways-to-understand-google-adsense-vs-google-adwords\/\">AdWords<\/a>, it mentioned using search queries through Search Console. While this is nothing to panic about, it does stress the importance of this feature.<\/p>\n<h2><span id=\"What_is_Google_Search_Console\">What is Google Search Console?<\/span><\/h2>\n<p>Google Search Console is one of the best ways to make sure your SEO campaign is successful because it helps you see your website the same way that the Google bots see your website. As you probably assumed, the Google bots determine what pages have been indexed, what links are quality links that will affect your rankings, which keywords are most popular, and well, you get the idea.<img loading=\"lazy\" class=\"aligncenter size-medium wp-image-13170\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report-770x482.png\" alt=\"\" width=\"770\" height=\"482\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report-770x482.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report-768x480.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report-639x400.png 639w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report.png 975w\" sizes=\"(max-width: 770px) 100vw, 770px\" \/><\/p>\n<p>Being able to have this kind of insight is crucial, so if you’re not signed up for a Search Console account you should sign up <a href=\"http:\/\/www.google.com\/webmasters\/tools\" target=\"_blank\" rel=\"nofollow\">here<\/a>, log in to your dashboard, and add your site. Believe it or not, you’ll find that the process is incredibly easy. You have to verify that you own the domain, which can get a little tricky, but this will depend upon your hosting company (as you’ll see as you set up your account).<\/p>\n<p>Once Search Console are all set up, you are open to a huge amount of information including search query data, traffic patterns, keywords insights, site speed metrics, authorship statistics, and much more. For the purposes of this article, you can learn the ins and outs of using the search query information to propel your SEO campaign forward. Visit <a href=\"https:\/\/support.google.com\/webmasters\/?hl=en#topic=3309469\" target=\"_blank\" rel=\"nofollow\">this article<\/a> to read an in-depth guide on all things Search Console.<\/p>\n<h2><span id=\"How_Search_Queries_Work_on_Google_Search_Console\">How Search Queries Work on Google Search Console<\/span><\/h2>\n<p>Search queries are included in Google Search Console as part of the Search Traffic section.<\/p>\n<p>The original report showed data in the form of graphics and the user was able to select which dates they wanted to see on a maximum of 1,000 rows. The report was revamped by Google in 2015 to create a more streamlined experience. This was purely a cosmetic change as most of the result verticals have remained the same.<\/p>\n<p>GSC’s search query is not only one of the most beneficial features of the program, but it is broken down into five convenient sections which allow users to navigate easily.<\/p>\n<p>While the user interface is simple to navigate, some users might not understand what each of these five verticals entails. Here is a detailed breakdown of each GSC section and why they’re important to the overall experience.<\/p>\n<h3><span id=\"Clicks\">Clicks<\/span><\/h3>\n<p>When you’re working with Search Engine Optimization, it’s important to understand how many clicks your link received from a Google search result. That’s the entire basis upon which SEO campaigns are built.<\/p>\n<p>Most GSC results count a “click” as any mouse click that sends the user to a page outside of a Google search. It should be noted that is a user clicks on a link that keeps them inside the search result, that does not count as a click for the website.<\/p>\n<p>Also, clicking on a search result to an outside page, returning to the search and clicking on it again still only counts as one click. Clicks are counted on an individual basis so someone who clicks on the same search link 100 times still only clicked on it once, according to Google Search Console.<\/p>\n<p>Query refinements within the search engine also do not count as clicks. A query refinement includes clicking on a link within a search result that performs a whole new query.<\/p>\n<div class='incontent-cta'><h3><span id=\"MOST_WEBSITES_STRUGGLE_WITH_GENERATING_CONSISTENT_ONLINE_LEADS_SALESWE_FIX_THAT\">MOST WEBSITES STRUGGLE WITH GENERATING CONSISTENT ONLINE LEADS & SALES...WE FIX THAT!<\/span><\/h3><p><p>Since 2009, we have helped hundreds of businesses grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h3><span id=\"Why_Clicks_Matter\">Why Clicks Matter<\/span><\/h3>\n<p>Seeing the number of clicks that your search results are getting (or not getting) gives you an opportunity to correct potentially harmful issues that are limiting your conversion rate.<img loading=\"lazy\" class=\"aligncenter size-medium wp-image-13171\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/google-serp-rich-snippets-recipes-595x500.png\" alt=\"\" width=\"595\" height=\"500\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/google-serp-rich-snippets-recipes-595x500.png 595w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/google-serp-rich-snippets-recipes-476x400.png 476w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/google-serp-rich-snippets-recipes.png 685w\" sizes=\"(max-width: 595px) 100vw, 595px\" \/><\/p>\n<p>There are actually quite a few ways to spruce up the way your results look on Search Engine Result Pages, <a href=\"https:\/\/www.highervisibility.com\/what-are-rich-snippets-and-how-can-they-be-used\/\">rich snippets<\/a> being amongst the most popular. If a lot of people are seeing your result but choosing not to click, you may want to go back and improve your headlines.<\/p>\n<p>Without the ability to see the number of clicks you were receiving, you’d have no way of knowing if your campaign was paying off. This is one of the most important analytics you can have when it comes to gauging the success or failure of your SEO campaign. Google Search Console search query function gives you one of the best insights into this valuable data.<\/p>\n<h3><span id=\"Impressions\">Impressions<\/span><\/h3>\n<p>Impressions determine how many links to your site users have seen while performing Google Searches. If someone Googles “plumber in the Washington D.C. Area” and your website pops up, that counts as an impression even if they don’t click on your link.<\/p>\n<p>Impressions are only counted when a user visits the page of results in which your site is listed. The impression is counted even if the result was not scrolled into view. For example, if you are result number 10 on a Google page and someone clicks on the first result without ever scrolling down to see your link, that still counts as an impression.<\/p>\n<p>If your link is on the second page of results for a keyword and a user views only the first page of results, it does not count as an impression.<\/p>\n<h3><span id=\"Why_Impressions_Matter\">Why Impressions Matter<\/span><\/h3>\n<p>Impressions give you an idea about what specific content people are interested in seeing, which means you can decide whether or not certain keywords are relevant to your business. Depending on your findings, you may want to experiment with optimization for different keywords if people are not seeing the content you want them to see.<\/p>\n<p>Both impressions and clicks have a dramatic level of importance when it comes to determining the click through rate of a website.<\/p>\n<h3><span id=\"CTR\">CTR<\/span><\/h3>\n<p><a href=\"https:\/\/www.highervisibility.com\/free-seo-tools\/ctr-tool\/\">CTR<\/a> is an acronym for Click Through Rate. It is determined by dividing the click count of a link by its impression count. This directly helps Google Search Console users determine the effectiveness of their SEO efforts and link optimization.<\/p>\n<p>On the Google Search Console user interface, you’ll find some rows of data under click through ratio with no impressions. These are shown as a dash and the CTR is determined to be zero.<\/p>\n<h3><span id=\"Why_CTR_Matters\">Why CTR Matters<\/span><\/h3>\n<p>CTR is one of the single most important analytics that helps advertisers gauge the effectiveness of their campaign. If you’re getting a ton of impressions but next to no clicks, that’s the system telling you that there’s something off-putting about your link and you need to work on optimizing it to be more appealing.<\/p>\n<p>If you find that this CTR number isn’t as high as you’d like it to be, you should go through your site and check your content to make sure it is relevant based on the queries people used most to find that page. Also, take a look at your Meta description and call to action.<\/p>\n<p>If you have a ton of clicks but not so many impressions, that means that your link is performing very well, it’s just not reaching enough people. In this instance, it would be best to focus on redoubling your SEO efforts, <a href=\"https:\/\/www.highervisibility.com\/blog\/seo-writing\/\">optimizing your on page content<\/a>, and possibly shifting tactics to try and boost those impressions.<\/p>\n<h3><span id=\"Position\">Position<\/span><\/h3>\n<p>This metric is only available in the table section of Google Search Console.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-13172\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/position.png\" alt=\"\" width=\"430\" height=\"399\" \/><\/p>\n<p style=\"text-align: center;\"><em>(<a href=\"https:\/\/support.google.com\/webmasters\/answer\/7042828#position\" target=\"_blank\" rel=\"nofollow\">Image Source<\/a>)<\/em><\/p>\n<p>The position vertical shows where your link falls in the search results for an item in a specific row. When results are grouped by query, the position shows where a site falls in the search results for that query.<\/p>\n<h3><span id=\"Why_Position_Matters\">Why Position Matters<\/span><\/h3>\n<p>The position option in Google Search Console gives us the variables by which we are able to determine average positioning.<\/p>\n<p>The ability to group these results by query is a valuable feature of Google Search Console. It’s important to remember that when you filter by query all anonymous queries are omitted from the results. This can throw off the numbers if you’ve seen a large number of anonymous queries.<\/p>\n<h3><span id=\"Average_Position\">Average Position<\/span><\/h3>\n<p>Your average position details the topmost search result for your site.<img loading=\"lazy\" class=\"aligncenter size-medium wp-image-13173\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/average-position-770x437.png\" alt=\"\" width=\"770\" height=\"437\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/average-position-770x437.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/average-position-768x436.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/average-position-704x400.png 704w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/average-position-75x43.png 75w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/average-position.png 1512w\" sizes=\"(max-width: 770px) 100vw, 770px\" \/><\/p>\n<p>What does that mean?<\/p>\n<p>If you have pages listed on a Google search engine results page at numbers four, six, and nine, the position of your site is four. If a second query comes in at two, five, and seven you’d add two and four (your highest results) and then divide that number by two (the number of searches that you performed).<\/p>\n<p>In the case of this example, the website’s average position would be three.<\/p>\n<p>If a row of data under average position has no impressions on Google Search Console, it will be shown as a dash, because there is no position and the figure does not exist.<\/p>\n<h3><span id=\"Why_Average_Position_Matters\">Why Average Position Matters<\/span><\/h3>\n<p>Average position can help you see exactly which keywords are performing well and which are not. If you are really set on ranking well for a particular term or phrase, this is a quick way to tell whether you need to do more or if you’re on the right track.<\/p>\n<p>While it’s all well and good to see precisely where each individual search pops up, the average position gives advertisers a broad picture of how well or poor they’re doing overall.<\/p>\n<h2><span id=\"Why_Not_Use_Google_Analytics\">Why Not Use Google Analytics?<\/span><\/h2>\n<p>This is the question that sparked the idea for this article in the first place.<\/p>\n<p>It’s no secret that Google Analytics offers much of the same data as Google Search Console, but the two Google options also differ in many ways.<\/p>\n<p>Google Search Console will show you the traffic potentially based on impressions and your site’s rankings as opposed to Google Analytics, which breaks down all of the traffic that comes to your site in more detail.<\/p>\n<p>When launching an SEO campaign its best to make use of both Google Analytics and Google Search Console. Google has a number of valuable tools that can help the process along, but it takes a sharp mind and expertise in SEO to take this valuable information and transition it into positive action.<\/p>\n<h2><span id=\"In_Conclusion\">In Conclusion<\/span><\/h2>\n<p>Simply knowing where you stand throughout these five verticals is one thing, but knowing how to roll with those results to see positive growth is something else entirely. That’s why you want to make sure that you have a dedicated team of SEO experts manning the controls of your campaign, optimizing your search result links, on page content, blogs, backlinks, metadata, and more.<\/p>\n<p>SEO isn’t something that’s just going to go away. As long as there are Google searches there will be an ever-changing algorithm at play to rate and rank the billions of websites worldwide. Utilizing powerful analytic programs like the search query function on Google Search Console will allow you to get ahead and stay ahead in the ongoing fight for Search Engine Supremacy.<\/p>\n<div class='incontent-cta'><h3><span id=\"MOST_WEBSITES_STRUGGLE_WITH_GENERATING_CONSISTENT_ONLINE_LEADS_SALESWE_FIX_THAT-2\">MOST WEBSITES STRUGGLE WITH GENERATING CONSISTENT ONLINE LEADS & SALES...WE FIX THAT!<\/span><\/h3><p><p>Since 2009, we have helped hundreds of businesses grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n","protected":false},"excerpt":{"rendered":"<p>Contents1 What is Google Search Console?2 How Search Queries Work on Google Search Console2.1 Clicks2.2 Why Clicks Matter2.3 Impressions2.4 Why Impressions Matter2.5 CTR2.6 Why CTR Matters2.7 Position2.8 Why Position Matters2.9 Average Position2.10 Why Average Position Matters3 Why Not Use Google Analytics?4 In Conclusion Editor’s Note: This post was originally published in April of 2014 and [&hellip;]<\/p>\n","protected":false},"author":5,"featured_media":0,"comment_status":"open","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":[],"categories":[354],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How Search Queries Work on Google Search Console (Webmaster Tools)<\/title>\n<meta name=\"description\" content=\"The search query section of Google Webmaster tools offers 5 different sets of data, all of which can help you improve your SEO. Learn what they all mean here.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How Search Queries Work on Google Search Console\" \/>\n<meta property=\"og:description\" content=\"The search query section of Google Webmaster tools offers 5 different sets of data, all of which can help you improve your SEO. Learn what they all mean here.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:published_time\" content=\"2019-03-04T14:00:51+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-06T16:32:33+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report-770x482.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@highervis\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Amanda DiSilvestro\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report.png\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report.png\",\"width\":975,\"height\":610},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/\",\"name\":\"How Search Queries Work on Google Search Console (Webmaster Tools)\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#primaryimage\"},\"datePublished\":\"2019-03-04T14:00:51+00:00\",\"dateModified\":\"2021-01-06T16:32:33+00:00\",\"author\":{\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/1acd5273c9b61477479b9a03d8f52b02\"},\"description\":\"The search query section of Google Webmaster tools offers 5 different sets of data, all of which can help you improve your SEO. Learn what they all mean here.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"How Search Queries Work on Google Search Console\"}]},{\"@type\":\"Person\",\"@id\":\"https:\/\/www.highervisibility.com\/#\/schema\/person\/1acd5273c9b61477479b9a03d8f52b02\",\"name\":\"Amanda DiSilvestro\",\"image\":{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/#personlogo\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/secure.gravatar.com\/avatar\/df85f67840b390aae90a78532b0e6d06?s=96&d=mm&r=g\",\"contentUrl\":\"https:\/\/secure.gravatar.com\/avatar\/df85f67840b390aae90a78532b0e6d06?s=96&d=mm&r=g\",\"caption\":\"Amanda DiSilvestro\"},\"description\":\"Amanda DiSilvestro is a graduate of Illinois State University and has been writing for HigherVisibility since 2011. Follow her on Google+ and Twitter to read more of the latest online marketing news and tips for success.\",\"url\":\"https:\/\/www.highervisibility.com\/author\/adisilvestro\/\"}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How Search Queries Work on Google Search Console (Webmaster Tools)","description":"The search query section of Google Webmaster tools offers 5 different sets of data, all of which can help you improve your SEO. Learn what they all mean here.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/","og_locale":"en_US","og_type":"article","og_title":"How Search Queries Work on Google Search Console","og_description":"The search query section of Google Webmaster tools offers 5 different sets of data, all of which can help you improve your SEO. Learn what they all mean here.","og_url":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_published_time":"2019-03-04T14:00:51+00:00","article_modified_time":"2021-01-06T16:32:33+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report-770x482.png"}],"twitter_card":"summary_large_image","twitter_creator":"@highervis","twitter_site":"@highervis","twitter_misc":{"Written by":"Amanda DiSilvestro","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report.png","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2014\/04\/search-queries-report.png","width":975,"height":610},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#webpage","url":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/","name":"How Search Queries Work on Google Search Console (Webmaster Tools)","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#primaryimage"},"datePublished":"2019-03-04T14:00:51+00:00","dateModified":"2021-01-06T16:32:33+00:00","author":{"@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/1acd5273c9b61477479b9a03d8f52b02"},"description":"The search query section of Google Webmaster tools offers 5 different sets of data, all of which can help you improve your SEO. Learn what they all mean here.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/blog\/how-search-queries-work-on-google-webmaster-tools\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"How Search Queries Work on Google Search Console"}]},{"@type":"Person","@id":"https:\/\/www.highervisibility.com\/#\/schema\/person\/1acd5273c9b61477479b9a03d8f52b02","name":"Amanda DiSilvestro","image":{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/#personlogo","inLanguage":"en-US","url":"https:\/\/secure.gravatar.com\/avatar\/df85f67840b390aae90a78532b0e6d06?s=96&d=mm&r=g","contentUrl":"https:\/\/secure.gravatar.com\/avatar\/df85f67840b390aae90a78532b0e6d06?s=96&d=mm&r=g","caption":"Amanda DiSilvestro"},"description":"Amanda DiSilvestro is a graduate of Illinois State University and has been writing for HigherVisibility since 2011. Follow her on Google+ and Twitter to read more of the latest online marketing news and tips for success.","url":"https:\/\/www.highervisibility.com\/author\/adisilvestro\/"}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/5862"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/5"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=5862"}],"version-history":[{"count":7,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/5862\/revisions"}],"predecessor-version":[{"id":15108,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/posts\/5862\/revisions\/15108"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=5862"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/categories?post=5862"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/tags?post=5862"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}