{"id":14102,"date":"2020-05-07T14:49:54","date_gmt":"2020-05-07T19:49:54","guid":{"rendered":"https:\/\/www.highervisibility.com\/?page_id=14102"},"modified":"2021-08-26T13:18:49","modified_gmt":"2021-08-26T18:18:49","slug":"lawyers","status":"publish","type":"page","link":"https:\/\/www.highervisibility.com\/industries\/lawyers\/","title":{"rendered":"Lawyers"},"content":{"rendered":"<h2 style=\"text-align: left;\">Effective strategies to get more legal clients in 2021<\/h2>\n<p>Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often the ones who have embraced digital marketing strategies. Online advertising is the most effective way to gain new clients and highlight your successes. If you aren&#8217;t engaging in lawyer marketing strategies, you may as well be invisible to new clients.<\/p>\n<p>Don&#8217;t know where to start? No matter your practice area, we have identified key ways to enhance your online marketing presence and increase website traffic.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-14113\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg\" alt=\"\" width=\"800\" height=\"353\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg 800w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books-770x340.jpg 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books-768x339.jpg 768w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<h2>Develop a Robust Website<\/h2>\n<p>Your website is essentially the first impression that clients have of you. In fact, 97% of legal clients search for a lawyer website online. Thus, your <a href=\"https:\/\/www.highervisibility.com\/blog\/law-firm-marketing\/\">law firm marketing<\/a> strategy begins with your site.<\/p>\n<p>A good looking, user-friendly website introduces you professionally and makes it easy for clients to gather the information they need. When designing the site, don&#8217;t skimp on the overall appearance (you may wish to hire a graphic designer or professional web developer). 75% of clients judge the quality of a law firm and the capabilities of its attorneys by the appearance of the website.<\/p>\n<p>Once you&#8217;ve constructed a professional, sleekly designed website, it&#8217;s time to consider that user experience. First, make sure that your site has room to grow. This is called <i>scalability<\/i>, referring to a site&#8217;s ability to run smoothly even with increased traffic or unexpected spikes. A server with plenty of bandwidth can help. A well-constructed website is free from lags, interruptions, and slow loading times. Three seconds may not seem like a lot, but it&#8217;s the average time a client will wait for for a page to load before clicking on to the next lawyer website.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-14201 size-full\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/screenshot-www.brashierlaw.com-2020.05.11-13_18_19.png\" alt=\"\" width=\"1701\" height=\"1287\" \/><\/p>\n<h2>Cultivate Your Social Media Brand<\/h2>\n<p>Is Facebook the best place for a law firm to find clients? It could be. Social media isn&#8217;t just posting pictures of your children and cat gifs. It&#8217;s also a way to introduce new clients to your law firm, brand, and expertise, in a more casual, authentic manner.<img loading=\"lazy\" class=\"aligncenter size-full wp-image-14203\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/attorney-at-work-stats-1.png\" alt=\"\" width=\"413\" height=\"425\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/attorney-at-work-stats-1.png 413w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/attorney-at-work-stats-1-389x400.png 389w\" sizes=\"(max-width: 413px) 100vw, 413px\" \/><\/p>\n<p>Your firm&#8217;s social media presence allows you to build a relationship with potential clients before they even need your services. Cultivating online relationships takes many forms, such as sharing information about local events, links to online articles that relate to the law, or announcing exciting news about your firm. The best part about social media posts is that they can easily be shared from a fan or follower to <i>their<\/i> followers and friends, thereby increasing your circle of reach.<\/p>\n<p><a href=\"https:\/\/www.highervisibility.com\/social-media-marketing\/\">Social media marketing<\/a> can also help direct traffic to your website, providing clients with more information and a resource for you to meet their legal needs. Younger generations use social media not just for keeping in contact with friends but also to interact with brands. Many millennials and Gen Z shoppers prefer local firms and those that they feel they&#8217;ve developed an authentic brand relationship with – and successful law firms understand this.<\/p>\n<p>To many, a lawyer isn&#8217;t just for a legal representative, but someone they can trust. Developing relationships through social media gives you that element of trustworthiness and approachability which many new clients seek.<\/p>\n<div class='incontent-cta'><h3>Most Law Firms Struggle with Generating New Clients...We Fix That!<\/h3><p><p>Since 2009, we have helped many lawyers grow their practice. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h2>Utilize SEO Strategies<\/h2>\n<p>SEO stands for <a href=\"https:\/\/www.highervisibility.com\/blog\/what-is-seo\/\">Search Engine Optimization<\/a>. Google, Bing, and other search engines have &#8220;web crawlers&#8221; that trawl the internet to match a search query, such as &#8220;divorce lawyers near me&#8221; or &#8220;corporate attorneys&#8221;. Optimizing your website to attract the attention of these &#8220;crawlers&#8221; positions you among the top results.<\/p>\n<p><strong>Proper <a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">SEO services<\/a> can increase your web traffic by over 400% in the first year.<\/strong><\/p>\n<p>Why is this important? The best matches to a search query appear on the first page of search results, which is where many people stop looking. In fact, <a href=\"https:\/\/digitalsynopsis.com\/tools\/google-serp-design\/\" target=\"_blank\" rel=\"nofollow\">beyond the third page<\/a>, your law firm website may as well be invisible.<\/p>\n<p>Make sure to mention the type of law you do, as well as the city and state you&#8217;re located in several times on your site. You can also include a FAQ page with questions and answers that involve popular search terms. Google algorithms like questions and answers, and it&#8217;s these algorithms that determine the direction that web crawlers go.<img loading=\"lazy\" class=\"aligncenter wp-image-14205 size-full\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/screenshot-www.google.com-2020.05.11-13_26_26-e1589221660971.png\" alt=\"\" width=\"609\" height=\"700\" \/><\/p>\n<h2>Focus On Content Marketing<\/h2>\n<p>Content marketing typically takes the form of a blog page, but can also include video clips and photo stories. People may visit your law firm&#8217;s website for information about the fields you specialize in, hours, your bar association status, and other basic information, but they&#8217;ll stay for content you post. Different topics can include your take on recent legal decisions, in-depth explanations of frequently asked questions, and even some &#8220;behind the scenes&#8221; of working on certain kinds of cases.<\/p>\n<p>Content marketing is extremely SEO sensitive. Google loves fresh, relevant content, and your position in search rankings will reflect this. High-quality, original content has been demonstrated to increase an attorney&#8217;s website rankings more than SEO keywords and phrases. If you aren&#8217;t an expert blogger, there are companies you can outsource content marketing to a professional internet marketing service.<\/p>\n<h2>The Power of Online Reviews<\/h2>\n<p>Did you know that 90% of consumers read online reviews before visiting a business, and 88% of consumers trust online reviews as much as a personal recommendation? Clients look to sites like Google reviews, Yelp!, and <a href=\"https:\/\/www.youtube.com\/user\/findlaw\" target=\"_blank\" rel=\"nofollow\">FindLaw<\/a> to help find the right attorney. Positive reviews are an organic part of online advertising.<\/p>\n<p>Getting reviews should be an integral part of your marketing plan. However, most people are more likely to review a restaurant, salon, or store than a law firm. Part of this is because many legal cases are sensitive and personal, and some people don&#8217;t wish to post about them on the internet. Other reasons may be that your clients simply don&#8217;t think about reviewing their lawyers.<\/p>\n<p>You can garner reviews by being proactive and incorporating asking for reviews as part of your client handling process. Train your associates to talk about reviews as part of the client follow-up after their case has been resolved. If you know you have a happy client, it&#8217;s a simple thing to say, &#8220;We&#8217;re glad we could help meet your needs. Would you be interested in leaving a review of your experience with our law firm? Part of our performance review is based on client reviews about our services.&#8221;<\/p>\n<p>You may direct clients to a third-party review site, or you may ask to have them submit a review or testimonial for you to publish on your site. Many websites have a special page just for client reviews.<\/p>\n<h2>Reviews and Google My Business<\/h2>\n<p>Another important aspect of reviews for successful law firms is the effect that positive reviews have on &#8220;Google My Business&#8221;. Google has a shortlist of the best matches on each search return, called the &#8220;3-pack&#8221;. These three businesses are listed just underneath a Google maps result for businesses that match the search string in your area. In order to be eligible for a place in this highly visible area, you law firm needs a Google My business profile.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-14206\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/screenshot-www.google.com-2020.05.11-13_28_29.png\" alt=\"\" width=\"697\" height=\"703\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/screenshot-www.google.com-2020.05.11-13_28_29.png 697w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/screenshot-www.google.com-2020.05.11-13_28_29-496x500.png 496w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/screenshot-www.google.com-2020.05.11-13_28_29-397x400.png 397w\" sizes=\"(max-width: 697px) 100vw, 697px\" \/><\/p>\n<p>To maximize this legal marketing tactic, create a business profile on <a href=\"https:\/\/www.google.com\/business\/?gmbsrc=us-en-et-gs-z-gmb-l-z-h~my%7Credirect%7Cu&amp;ppsrc=GMBLR&amp;utm_campaign=us-en-et-gs-z-gmb-l-z-h~my%7Credirect%7Cu&amp;utm_source=gmb&amp;utm_medium=et\" target=\"_blank\" rel=\"nofollow\">Google My Business<\/a>. It&#8217;s free and pretty easy to set up. When you fill out your business profile, make sure to complete it 100% for the best results. Then, add your headshot and headshots of anyone on your team you wish to feature, as well as photos of your office.<\/p>\n<p>Here&#8217;s a tip: Don&#8217;t simply take pictures with your phone camera. Hire a professional photographer to ensure that each headshot is a professional portrait and that your offices are shown to their best advantage. Remember when we mentioned that clients determine your level of expertise and capability based on your website? They&#8217;re determining the same things based on your Google My Business profile.<\/p>\n<p>Next, connect your law firm website to your Google profile. Make sure before you do that your site is optimized with critical information such as your areas of practice and location. You may need to add these in the title tags as well as within the content of the site (a professional internet marketing service can help you with this). Then, add your local business name, address, and phone number, which can be done through the free SCHEMA Generator <a href=\"https:\/\/technicalseo.com\/tools\/schema-markup-generator\/\" target=\"_blank\" rel=\"nofollow\">here<\/a>. Put these on the landing pages of your website, too.<\/p>\n<div class='incontent-cta'><h3>Most Law Firms Struggle with Generating New Clients...We Fix That!<\/h3><p><p>Since 2009, we have helped many lawyers grow their practice. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h2>Maximize Your Email List<\/h2>\n<p>Your email list can be one of the strongest targeted digital marketing strategies in your online advertising campaign. You have email addresses from past and present clients, as well as people you&#8217;ve encountered through networking events and referrals. You also likely have people who have entered their email on your website to be part of your mailing list or to ask for more information.<\/p>\n<p>Using your email list as a marketing tool involves separating it into certain demographic groups. You may have a group of past clients, clients who you&#8217;re currently working with, and &#8220;cold&#8217; clients – people whose email you have but aren&#8217;t yet clients.<\/p>\n<p>Each email you send out as part of an email blast can address the specific needs of each group. For past clients, it may be simply touching base, reminding them that you&#8217;re here for them should they have another need for one of your services. You may also wish to offer an incentive for them to book legal business with you again, such as a free consultation or a free hour of legal work.<\/p>\n<p>Creating the perfect email that isn&#8217;t intrusive, adds value to your recipients, and presents a strong call-to-action can be tricky to create. You may wish to hire a law firm marketing agency with demonstrated success in email marketing campaigns.<\/p>\n<p>All emails should include a link to the content portion of your website, which can include blogs and videos. You can also include links to your law frim&#8217;s social media accounts, as well, and invite recipients to follow you on those platforms.<\/p>\n<h2>Hire a Reputable Internet Marketing Service<\/h2>\n<p>Do all of these strategies seem overwhelming? They can be! As a busy attorney, you may not have the time or expertise to successfully market your business and properly take care of your clients. Hiring a digital marketing company, especially a full-service one that includes content creation, photography, and videography can take a huge burden off your shoulders.<\/p>\n<p>Plus a <a href=\"https:\/\/www.highervisibility.com\/\">digital marketing agency<\/a> can monitor your website and give you insight about traffic, user behavior, and other things to help shape your marketing efforts. Ideally, your website and social media profiles should be a 24-hour marketing tool and a passive way to gain new leads.<\/p>\n<h2>Takeaway<\/h2>\n<p>Internet marketing can be tricky. The most important thing to remember is to be authentic – be yourself, speak with your professional authority, and engage thoughtfully with clients and website visitors. Internet marketing isn&#8217;t making your case in a court of law, but rather speaking to potential clients on a more casual level. The best digital marketing comes from your niche area of law and the expertise and insight that you can offer your clientele.<\/p>\n<div class='incontent-cta'><h3>Most Law Firms Struggle with Generating New Clients...We Fix That!<\/h3><p><p>Since 2009, we have helped many lawyers grow their practice. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h4>Suggested Reading<\/h4>\n<ul>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/seo\/\">SEO for Lawyers: (2021 Edition Law Firm SEO Guide)<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/ppc\/\">PPC for Law Firms: # Tips Any Lawyer Can Use to Get Clients<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/web-design\/\">Law Firm Web Design: 2021 Guide for the Perfect Lawyer Website<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/web-design-cost\/\">Law Firm Website Design Cost: What You Can Expect to Pay<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/facebook-ads\/\">Facebook Ads for Lawyers: Strategies to Get Clients in 2021<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/lead-generation\/\">Lead Generation for Lawyers: Tactics to Get Clients in 2021<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/justia-review\/\">Justia Marketing Review 2021: Why It&#8217;s Not Worth it for Lawyers<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Effective strategies to get more legal clients in 2021 Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often the ones who have embraced digital marketing strategies. Online advertising is the most effective way to gain new clients and highlight your successes. If you aren&#8217;t engaging in lawyer [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":0,"parent":14100,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Online Marketing for Law Firms in 2021: Strategies To Get Clients<\/title>\n<meta name=\"description\" content=\"Effective strategies to get more legal clients in 2021 Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Lawyers\" \/>\n<meta property=\"og:description\" content=\"Effective strategies to get more legal clients in 2021 Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/industries\/lawyers\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:modified_time\" content=\"2021-08-26T18:18:49+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/lawyers\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg\",\"width\":800,\"height\":353},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/lawyers\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/industries\/lawyers\/\",\"name\":\"Online Marketing for Law Firms in 2021: Strategies To Get Clients\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/lawyers\/#primaryimage\"},\"datePublished\":\"2020-05-07T19:49:54+00:00\",\"dateModified\":\"2021-08-26T18:18:49+00:00\",\"description\":\"Effective strategies to get more legal clients in 2021 Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/lawyers\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/industries\/lawyers\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/lawyers\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Industries\",\"item\":\"https:\/\/www.highervisibility.com\/industries\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Lawyers\"}]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Online Marketing for Law Firms in 2021: Strategies To Get Clients","description":"Effective strategies to get more legal clients in 2021 Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/industries\/lawyers\/","og_locale":"en_US","og_type":"article","og_title":"Lawyers","og_description":"Effective strategies to get more legal clients in 2021 Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often","og_url":"https:\/\/www.highervisibility.com\/industries\/lawyers\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_modified_time":"2021-08-26T18:18:49+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg"}],"twitter_card":"summary_large_image","twitter_site":"@highervis","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/industries\/lawyers\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/05\/legal-books.jpg","width":800,"height":353},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/industries\/lawyers\/#webpage","url":"https:\/\/www.highervisibility.com\/industries\/lawyers\/","name":"Online Marketing for Law Firms in 2021: Strategies To Get Clients","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/industries\/lawyers\/#primaryimage"},"datePublished":"2020-05-07T19:49:54+00:00","dateModified":"2021-08-26T18:18:49+00:00","description":"Effective strategies to get more legal clients in 2021 Methods of sourcing new clients have shifted in the last decade, and the busiest lawyers are often","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/industries\/lawyers\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/industries\/lawyers\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/industries\/lawyers\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Industries","item":"https:\/\/www.highervisibility.com\/industries\/"},{"@type":"ListItem","position":3,"name":"Lawyers"}]}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14102"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=14102"}],"version-history":[{"count":34,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14102\/revisions"}],"predecessor-version":[{"id":16883,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14102\/revisions\/16883"}],"up":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14100"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=14102"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}