{"id":14605,"date":"2020-08-13T15:00:17","date_gmt":"2020-08-13T20:00:17","guid":{"rendered":"https:\/\/www.highervisibility.com\/?page_id=14605"},"modified":"2020-12-29T21:58:41","modified_gmt":"2020-12-30T03:58:41","slug":"inbound-marketing","status":"publish","type":"page","link":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/","title":{"rendered":"Inbound Marketing"},"content":{"rendered":"<h2>Inbound Marketing for SaaS in 2021: 10 Proven Tips &amp; Strategies<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-14607\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1-800x400.png\" alt=\"\" width=\"800\" height=\"400\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1-800x400.png 800w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1-770x385.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1-768x384.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1.png 1024w\" sizes=\"(max-width: 800px) 100vw, 800px\" \/><\/p>\n<p>For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Inbound marketing allows you to interact with leads in a meaningful way that isn’t possible with outbound efforts, which helps you position your company as more than just a software provider, but a trusted partner.<\/p>\n<p>Today, we’re going to look at some proven strategies and tips to improve your SaaS inbound marketing efforts to start seeing more qualified leads and closing more deals.<\/p>\n<h2>What is SaaS Inbound Marketing, and Why is it Important?<\/h2>\n<p>There are two schools of thought regarding marketing, push and pull (better known as outbound and inbound.)<\/p>\n<p>The push is what happens when you force information about your product or service into the consumer&#8217;s mind. This marketing type refers to traditional advertising, like print ads, billboards, commercials, and cold calls.<\/p>\n<p>This type of marketing has always been effective, but how effective? The fact of the matter is no one truly likes outbound marketing except for marketers. Nobody likes looking at ads or receiving cold calls. Nevertheless, they’re still an effective tactic for driving new business.<\/p>\n<p>Then, there’s the pull. The pull (or inbound marketing) is all about pulling the customer towards you. Instead of forcing the customer to become aware of your service through intrusive marketing efforts, you provide the customer with something valuable (in most cases, content) that helps pull the customer towards your product or service.<\/p>\n<p>Inbound marketing is effective because it removes the negatives associated with traditional marketing. Customers don’t want to feel like they’re being sold to, and they don&#8217;t like being interrupted by ads. Customers prefer learning about your offerings on their terms, in a way that’s designed to be helpful to them. In other words, it positions you and your customer on the same team.<\/p>\n<p>Not only is inbound marketing effective from a customer acquisition perspective, but it’s also cost-effective. <a href=\"https:\/\/blog.hubspot.com\/blog\/tabid\/6307\/bid\/31555\/inbound-leads-cost-61-less-than-outbound-new-data.aspx\" target=\"_blank\" rel=\"nofollow\">According to Hubspot<\/a>, inbound leads cost 61% to generate compared to outbound leads. Inbound leads also free your sales staff from monotonous cold calls to instead focus on building relationships with qualified leads.<\/p>\n<h2>Saas Inbound Marketing Tips and Strategies<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-14608\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/inbound-marketing-stages-992x400.png\" alt=\"\" width=\"992\" height=\"400\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/inbound-marketing-stages-992x400.png 992w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/inbound-marketing-stages-770x310.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/inbound-marketing-stages-768x310.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/inbound-marketing-stages-1536x619.png 1536w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/inbound-marketing-stages.png 1602w\" sizes=\"(max-width: 992px) 100vw, 992px\" \/><\/p>\n<p>Without further adieu, let’s look more closely at some strategies and tips to begin applying to your inbound marketing strategy today to generate more leads and close more deals.<\/p>\n<h3>Know Your Customer<\/h3>\n<p>The most critical step when developing an inbound strategy is to become intimately acquainted with your ideal customer. Using effective buyer personas is the easiest and most effective way to ensure that the content you’re creating speaks to the needs, concerns, and goals of your ideal customer.<\/p>\n<p>The best way to create an effective persona is to speak with your current customers and leads to get an accurate assessment of their demographics, business goals, and pain points to develop a better understanding of why they need your software.<\/p>\n<p>With this information, you’ll have a much clearer idea of who you should be speaking to when you create inbound content.<\/p>\n<div class='incontent-cta'><h3>Most SaaS Companies Struggle with Generating New Business...We Fix That!<\/h3><p><p>Since 2009, we have helped many SaaS businesses grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h3>Remember the Three C’s: Content, Content, and Content<\/h3>\n<p>Effective content is the lifeblood of effective inbound marketing. Many businesses lose sight of the operative word in the previous sentence, which is effective. Creating tons of content isn’t an effective inbound strategy unless that content is enjoyable, engaging, and informative. Above all, it needs to reach the correct audience. Here’s how you can accomplish this:<\/p>\n<h4>Keyword Research<\/h4>\n<p>Users discover new content in one of two ways. The content is shared with them by friends, family, or colleagues through social media or in conversation, or they discover it via a search on Google, Bing, or another search engine.<\/p>\n<p>Content shared by word of mouth is ideal because it provides you with new eyes that could potentially become leads. It also lets you know that people are finding the content you’re producing useful and entertaining enough to share it with others.<\/p>\n<p>To truly make a dent in your inbound marketing efforts, word of mouth alone won’t be enough to move the needle. You’ll also need to carefully optimize your content to attract users from search. To do that, you’ll need to target the appropriate keywords for each topic to ensure that the content becomes discoverable in Google.<\/p>\n<p>There are tons of tools that can assist you with keyword research. <a href=\"https:\/\/ads.google.com\/home\/tools\/keyword-planner\/\" target=\"_blank\" rel=\"nofollow\">Google’s Keyword Planner<\/a> is available with a free AdWords account, <a href=\"https:\/\/neilpatel.com\/ubersuggest\/\" target=\"_blank\" rel=\"nofollow\">UberSuggest <\/a>from Neil Patel is another incredibly useful planning tool. There are also plenty of paid tools such as Ahrefs, which are widely used throughout the digital marketing and SEO industries.<\/p>\n<p>When doing your keyword research, follow these practices:<\/p>\n<ul>\n<li>Identify keywords that have relevance and value for your audience and business<\/li>\n<li>Make sure the keywords you find have a high enough monthly search volume to make them worthwhile<\/li>\n<li>Consider keyword difficulty rankings &#8211; try and target keywords with high search volumes that are less difficult to rank for<\/li>\n<li>Look for keywords that you can easily expand into a topic relevant to your business or software<\/li>\n<\/ul>\n<h4>Find Ways to Make What’s Boring Fun<\/h4>\n<p>SaaS isn’t exactly the most glamorous business on earth. Many of the topics you’ll be covering aren’t especially interesting to the layman. It’s up to you to make this content engaging and fun without losing sight of the key takeaways that the content should provide the user.<\/p>\n<p>Where possible, make use of infographics, charts and graphs, animations, how-to guides, and other elements that can bring your content to life.<\/p>\n<h4>Don’t Lose Focus on SEO<\/h4>\n<p><a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">SEO<\/a> is a critical component of content because it will allow people to find your content when searching for related topics on Google or other search engines.<\/p>\n<p>You can spend tons of time and effort focusing on improving your site’s SEO, but for starters, you’ll need to ensure that you’re taking care of all the basics that are necessary for your content to rank well.<\/p>\n<p>If you’re new to SEO, here’s a checklist of the basics all SaaS businesses need to address SEO wise once you’re finished developing your content.<\/p>\n<ul>\n<li>Write an engaging and concise meta description<\/li>\n<li>Ensure your main keyword appears in the title of your article<\/li>\n<li>Use secondary keywords in the article’s subheadings and throughout the body content<\/li>\n<li>Ensure your content follows proper heading hierarchy<\/li>\n<li>Include plenty of internal and external links in your content<\/li>\n<\/ul>\n<div class='incontent-cta'><h3>Most SaaS Companies Struggle with Generating New Business...We Fix That!<\/h3><p><p>Since 2009, we have helped many SaaS businesses grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h4>Use Your Social Channels to Amplify Content<\/h4>\n<p><a href=\"https:\/\/www.highervisibility.com\/social-media-marketing\/\">Social media<\/a> is an ideal tool for amplifying your content in front of the right audience. Today’s consumer is much more likely to trust what they’re seeing from friends, peers, and colleagues than from outbound marketing efforts.<\/p>\n<p>Use social channels to amplify your content, and be sure to monitor posts, respond to questions or comments from other users, and engage in conversation with potential leads.<\/p>\n<p>The key to using social media effectively is to ensure that you’re creating a presence on the platforms frequented by your target customers. This may mean skipping the Facebook and Twitter’s of the world in favor of more specific platforms, such as LinkedIn or Reddit.<\/p>\n<h3>Don’t Underestimate the Effectiveness of Email Marketing<\/h3>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-14610\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/is-email-marketing-dead-heres-what-the-statistics-show.png\" alt=\"\" width=\"620\" height=\"300\" \/><\/p>\n<p>An email marketing campaign can be one of the most effective ways to promote relevant content to your leads. In recent years, many marketers turned their nose at email marketing as a relic from the past. The truth remains that it’s an effective conversion tool that any business can take advantage of.<\/p>\n<p>Studies suggest that email marketing delivers an incredible <a href=\"https:\/\/www.campaignmonitor.com\/resources\/knowledge-base\/how-do-you-calculate-email-marketing-roi\/\" target=\"_blank\" rel=\"nofollow\">ROI of over 4400%,<\/a> and while we aren&#8217;t expecting to see a return quite that impressive, it&#8217;s still one of the most effective SaaS marketing strategies.<\/p>\n<p>You can maximize your email marketing efforts by following these tips:<\/p>\n<ul>\n<li>Make sure your subject line is compelling enough that you’d want to open it<\/li>\n<li>Ensure that any email you send is optimized for mobile devices<\/li>\n<li>Take advantage of email personalization to further cement your relationship with the reader<\/li>\n<li>Ensure synergy between your email marketing and landing pages to improve user experience<\/li>\n<\/ul>\n<h3>Consider Influencer Marketing<\/h3>\n<p>Over the past five years, influencers&#8217; marketing power has exploded, and savvy businesses have been leveraging their audience and influence to put their products and content in front of an engaged audience.<\/p>\n<p>Finding the right thought leaders in your industry is a great way to build your backlink profile for SEO, and since influencers are trusted members of their community, their recommendation is often all it takes to steer a qualified potential customer directly to your software, providing a major uptick in conversion rate.<\/p>\n<h3>Jumpstart Your Inbound Marketing with PPC Advertising<\/h3>\n<p>The process of inbound marketing generally takes more time to generate tangible results than outbound marketing does. It will also take time for your content to begin ranking organically in search.<\/p>\n<p>You can jumpstart the process by investing in some <a href=\"https:\/\/www.highervisibility.com\/ppc-management\/\">PPC<\/a> ads with Google AdWords, Microsoft Advertising, or on social media channels like LinkedIn. LinkedIn, in particular, is an effective way to increase awareness and website traffic, and the cost of advertising there is often significantly less than advertising with Google or Bing.<\/p>\n<h3>Nurture Your Leads Effectively<\/h3>\n<p>One of the primary goals of inbound marketing is lead nurturing. Ensure that the content you’re generating is being served to your various leads at the correct time in the buyer&#8217;s journey. Doing so will help keep your company in front of the customer’s mind, and it will also position you as a helpful authority in the field.<\/p>\n<h2>Final Word<\/h2>\n<p>Inbound marketing is one of the most effective tools for SaaS companies. Through inbound SaaS marketing efforts, you’ll increase traffic, generate qualified leads at a lower cost than outbound marketing, and position your company as an authority in your industry.<\/p>\n<p>When it comes to SaaS inbound marketing, your success will be predicated on how well you understand your customers, the quality of content you can generate for potential customers, and how effectively you can get that content in front of the correct eyeballs.<\/p>\n<p>When leveraged effectively, inbound marketing can be the most effective tool in your company’s arsenal.<\/p>\n<div class='incontent-cta'><h3>Most SaaS Companies Struggle with Generating New Business...We Fix That!<\/h3><p><p>Since 2009, we have helped many SaaS businesses grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h3>Suggested Reading<\/h3>\n<ul>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/saas\/ppc\/\">PPC for SaaS in 2021: 9 Proven Tips &amp; Strategies<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/saas\/\">SaaS Marketing in 2021: Tips &amp; Strategies to Succeed<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/saas\/seo\/\">SEO for SaaS in 2021: 13 Proven Tips &amp; Strategies<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/saas\/web-design\/\">SaaS Website Design: 7 Examples of Strategic Elements<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Inbound Marketing for SaaS in 2021: 10 Proven Tips &amp; Strategies For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Inbound marketing allows you to interact with leads in a meaningful way that isn’t possible with outbound efforts, which helps you position your company as more than just a software [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":0,"parent":14570,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Inbound Marketing for SaaS in 2021: 10 Proven Tips &amp; Strategie<\/title>\n<meta name=\"description\" content=\"For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Here are some proven strategies to help close more deals.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Inbound Marketing\" \/>\n<meta property=\"og:description\" content=\"For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Here are some proven strategies to help close more deals.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:modified_time\" content=\"2020-12-30T03:58:41+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1-800x400.png\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1.png\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1.png\",\"width\":1024,\"height\":512},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/\",\"name\":\"Inbound Marketing for SaaS in 2021: 10 Proven Tips & Strategie\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#primaryimage\"},\"datePublished\":\"2020-08-13T20:00:17+00:00\",\"dateModified\":\"2020-12-30T03:58:41+00:00\",\"description\":\"For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Here are some proven strategies to help close more deals.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Industries\",\"item\":\"https:\/\/www.highervisibility.com\/industries\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"SaaS\",\"item\":\"https:\/\/www.highervisibility.com\/industries\/saas\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Inbound Marketing\"}]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Inbound Marketing for SaaS in 2021: 10 Proven Tips & Strategie","description":"For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Here are some proven strategies to help close more deals.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/","og_locale":"en_US","og_type":"article","og_title":"Inbound Marketing","og_description":"For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Here are some proven strategies to help close more deals.","og_url":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_modified_time":"2020-12-30T03:58:41+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1-800x400.png"}],"twitter_card":"summary_large_image","twitter_site":"@highervis","twitter_misc":{"Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1.png","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/08\/raka-tw-Inbound-Marketing-Strategy-1024x512-1.png","width":1024,"height":512},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#webpage","url":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/","name":"Inbound Marketing for SaaS in 2021: 10 Proven Tips & Strategie","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#primaryimage"},"datePublished":"2020-08-13T20:00:17+00:00","dateModified":"2020-12-30T03:58:41+00:00","description":"For SaaS brands, inbound marketing is critical to the success of your marketing efforts. Here are some proven strategies to help close more deals.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/industries\/saas\/inbound-marketing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Industries","item":"https:\/\/www.highervisibility.com\/industries\/"},{"@type":"ListItem","position":3,"name":"SaaS","item":"https:\/\/www.highervisibility.com\/industries\/saas\/"},{"@type":"ListItem","position":4,"name":"Inbound Marketing"}]}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14605"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=14605"}],"version-history":[{"count":8,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14605\/revisions"}],"predecessor-version":[{"id":15055,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14605\/revisions\/15055"}],"up":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14570"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=14605"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}