{"id":14847,"date":"2020-09-25T09:53:35","date_gmt":"2020-09-25T14:53:35","guid":{"rendered":"https:\/\/www.highervisibility.com\/?page_id=14847"},"modified":"2021-01-06T13:41:36","modified_gmt":"2021-01-06T19:41:36","slug":"manufacturing","status":"publish","type":"page","link":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/","title":{"rendered":"Manufacturing"},"content":{"rendered":"<h2>Marketing for Manufacturers: Best Tactics to Drive Results<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-14850 size-full\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg\" alt=\"\" width=\"1000\" height=\"512\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg 1000w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962-770x394.jpg 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962-781x400.jpg 781w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962-768x393.jpg 768w\" sizes=\"(max-width: 1000px) 100vw, 1000px\" \/><\/p>\n<p>Marketing for manufacturers has changed drastically over the past couple of decades. While the focus used to be on direct mailings, trade shows, and client referrals, the incredibly quick evolution of technology has driven marketing to an online platform.<\/p>\n<p>How many times have you used a search engine like Google to find answers or products? Those first three to ten results that come up are the coveted space for any business with an online presence.<\/p>\n<p>So, as a manufacturing business, how do you change your marketing strategy to get high search engine rankings and more online traffic? The answer is a multifaceted digital marketing strategy.<\/p>\n<p>Based on a <a href=\"https:\/\/www.onlinemarketinginstitute.org\/blog\/2018\/07\/infographic-digital-marketing-manufacturing-industry\/\" target=\"_blank\" rel=\"nofollow\">recent study<\/a>, Manufacturers tend to be lagging in terms of focusing on a digital strategy. This means that you have the opportunity to really take advantage of your market if you start focusing on a strategic digital marketing plan now.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-14852\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-spending-manufacturing-1024x603-1.jpg\" alt=\"\" width=\"1024\" height=\"603\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-spending-manufacturing-1024x603-1.jpg 1024w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-spending-manufacturing-1024x603-1-770x453.jpg 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-spending-manufacturing-1024x603-1-679x400.jpg 679w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-spending-manufacturing-1024x603-1-768x452.jpg 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-spending-manufacturing-1024x603-1-75x43.jpg 75w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<h2>Know Your Target Audience<\/h2>\n<p>Before you can design a marketing plan, you need to know your client. Jumping in blindly without truly understanding who you’re selling to and what they need can result in a loss of money and time.<\/p>\n<p>Manufacturing companies are unique in that they often sell to businesses instead of directly to consumers. These are called<a href=\"https:\/\/www.highervisibility.com\/blog\/b2b-seo-strategy\/\"> B2B<\/a>, or business-to-business, corporations. So, when creating your buyer persona, you should consider a whole company’s needs instead of just an individual’s.<\/p>\n<p>Having a B2B company can make marketing more manageable in some aspects, but harder in others. For example, selling directly to consumers means that usually only the buyer and the seller are involved. B2B buyers are whole companies, with much more extensive needs. Having such important clients can be profitable, but you need to know how to sell them your product. To do so, create a buyer persona.<\/p>\n<p>The most significant part of creating your buyer persona is understanding their needs &#8211; or more accurately, their company’s needs &#8211; before they do. For example, if you are engineering equipment to businesses, think about potential problems that your products could fix.<\/p>\n<h3>What Is Marketing for Manufacturers?<\/h3>\n<p>Marketing for manufacturers is different from other types of marketing because of the kind of audience. When selling directly to consumers, you can play some emotional cards, use PPC ads, and expect quick conversions.<\/p>\n<p>However, as manufacturers, you have to adjust your marketing tactics to sell to business owners. They are probably worried about quality, shipping, and overall value for the cost. You&#8217;ll need to show them how you can efficiently meet their needs with quality products, and be sure to provide plenty of statistics to back your work.<\/p>\n<div class='incontent-cta'><h3>Most Manufacturers Struggle with Generating Leads Online...We Fix That!<\/h3><p><p>Since 2009, we have helped many Manufacturers grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h2>Why Is Marketing for Manufacturers Unique?<\/h2>\n<p>Like any other type of marketing, B2B industrial marketing comes with its advantages and disadvantages. Understanding where you could face potential difficulties and successes is vital to preparing a marketing strategy.<\/p>\n<h3>Niche Markets<\/h3>\n<p>Being in a niche market can be a blessing and a curse. On the one hand, you have little competition, and you can quickly push your online presence using a few keywords (we’ll talk about this later). However, being in a niche market means you have fewer opportunities for sales.<\/p>\n<p>For example, consumer marketing focuses their digital marketing on driving up website traffic to their site, which creates more conversions and sales. B2B marketing is a long process and often involves in-person conversations and negotiating thanks to large-scale sales. Only focusing on increased traffic does not guarantee more conversions for manufacturing companies.<\/p>\n<h3>Unique Products<\/h3>\n<p>Manufacturing companies aren’t trying to sell simple products. They are often complex and customizable, which prevents quick purchases. Where a consumer marketing strategy would implement short sales strategies like a “buy now” button, manufacturing businesses need to take a different, more extended approach to sales.<\/p>\n<p>However, having such unique products also gives you leverage, as they make your company one-of-a-kind. Highlight your products’ quality features, but don’t waste time designing ads and pop-ups for quick buys. Instead, consider developing out a customized quote call to action form aimed at lead generation.<\/p>\n<h3>Few Immediate Conversions<\/h3>\n<p>Since your selling to whole corporations, the buying process takes time. Your potential customers are CEOs or decision influencers in a company who need to discuss the purchase at length before buying.<\/p>\n<p>Pay-per-click (<a href=\"https:\/\/www.highervisibility.com\/ppc-management\/\">PPC<\/a>) ads may work well for B2C businesses that are buying visits to their sites, but these marketing campaigns will often fall flat for companies in the manufacturing industry. Paying for people to look at your site will not produce sales like in other companies. It would be best to spend time focusing on lead generation, creating a relationship between you and your potential customer, and selling your brand over time.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter size-full wp-image-14853\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-funnel-diagram-1024x569-1.png\" alt=\"\" width=\"1024\" height=\"569\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-funnel-diagram-1024x569-1.png 1024w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-funnel-diagram-1024x569-1-770x428.png 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-funnel-diagram-1024x569-1-720x400.png 720w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-funnel-diagram-1024x569-1-768x427.png 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/marketing-funnel-diagram-1024x569-1-75x43.png 75w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/p>\n<p>These long sales cycles require a lot of patience, but once you have won over a new customer, you likely have a long-term client that will bring in regular revenue.<\/p>\n<h3>Brand Loyalty<\/h3>\n<p>Because it can take a while to close a sale, manufacturing companies must focus time and energy on brand loyalty. Make sure you have clients for life by nurturing your business relationship.<\/p>\n<p>Once they have had a fantastic buying experience with you, the business is more likely to purchase again, recommend you to their colleagues, and build your brand awareness.<\/p>\n<h2>Choose the Best Manufacturing Marketing Strategy<\/h2>\n<p>There are numerous ways to market your company. One particular strategy may work well for one business, but not for another. Think about your existing clientele base, where you need to improve, and what would work in your particular area of expertise.<\/p>\n<p>The best way to tackle manufacturing marketing is by using multiple strategies. You may be surprised at what works! Let’s look at six of the common approaches for a B2B company, and think about which ones you can incorporate into your marketing plan.<\/p>\n<h3>1. Equip Your Company with the Right Tools<\/h3>\n<p>The first step in any online marketing strategy is making sure you have the right tools for success. If you have been focusing your energy on trade shows and word-of-mouth, it’s time to implement several online tools to create marketing automation.<\/p>\n<p>The two most important tools are <a href=\"https:\/\/analytics.google.com\/analytics\/web\/provision\/#\/provision\" target=\"_blank\" rel=\"nofollow\">Google Analytics<\/a> and <a href=\"https:\/\/search.google.com\/search-console\/welcome\" target=\"_blank\" rel=\"nofollow\">Google Search Console<\/a>. These free resources will let you analyze your search engine ranking, website traffic, bounce rate, conversion rate, etc.<\/p>\n<h3>2. Analyze Your Current Online Presence<\/h3>\n<p>Once you have integrated some of the above tools, it’s time to analyze how your website performs. If you just started using a tool like Google Analytics, you must wait at least a month to make any conclusions about your website’s activity. Looking at the statistics after one week will not give you an accurate number of leads and conversions.<\/p>\n<p>After you have gained enough information to understand your website traffic and visitors, it’s time to see where you need to improve. Do you have lots of visitors but a minimal conversion rate? Maybe you have a few visitors, but a high conversion rate.<\/p>\n<p>Either way, consider areas for improvement and use one &#8211; or all &#8211; of the following tips to make sure you have numerous leads and conversions.<\/p>\n<h3>3. SEO Strategies<\/h3>\n<p>Search engine optimization, or <a href=\"https:\/\/www.highervisibility.com\/search-engine-optimization\/\">SEO<\/a>, is vital to online marketing. It is a complex process with numerous factors that affect your site’s ranking on Google, Yahoo, and Bing. Each query engine has a specific way to analyze your website and its quality of content, so it takes some time to understand and master SEO.<\/p>\n<p>Your goal is to rank in the top ten &#8211; preferably the top three &#8211; results for any given Google search. To get their attention, you need to focus on creating quality content that your potential clients want and need. Focusing on SEO is a huge part of inbound marketing or drawing your customers to your business.<\/p>\n<p>There are numerous ways to work on SEO, but we’re just going to touch on two key areas to get you started.<\/p>\n<div class='incontent-cta'><h3>Most Manufacturers Struggle with Generating Leads Online...We Fix That!<\/h3><p><p>Since 2009, we have helped many Manufacturers grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h4>Keywords<\/h4>\n<p>We mentioned before that being in a niche market can be beneficial. The manufacturing industry has dozens of high-value keywords that your website can tackle. Since there is not as much competition as in other markets, you can easily rank high on several keywords if you make quality content with that keyword.<\/p>\n<p>While there aren’t many people searching for these terms, those that do are intent on buying. If you focus on these terms, you may get slightly more traffic, but much more conversions because your website visitors are genuinely interested.<\/p>\n<p>So, how do you find these keywords? Start with your buyer persona and think about what they need. Create a list of your keywords, then use a tool like <a href=\"http:\/\/ahrefs.com\" target=\"_blank\" rel=\"nofollow\">Ahrefs<\/a> to check those keywords and how your competition uses them.<\/p>\n<h4>Content Marketing<\/h4>\n<p>To use those keywords, you need to make content. Blogging may seem like a trivial task to a large manufacturing company, but writing articles and blogs about what your client is looking for shows your expertise in the area.<\/p>\n<p>Your future clients will recognize your authority and knowledge in your niche market if you focus your marketing efforts on producing numerous blogs and video content. Furthermore, content marketing will increase your search engine rankings because they show Google that your site has quality material and a clear hierarchy between the pages.<\/p>\n<h3>4. Social Media Presence<\/h3>\n<p>Another aspect of inbound marketing is <a href=\"https:\/\/www.highervisibility.com\/social-media-marketing\/\">social media<\/a>. Posting videos, tips, products, and experience on Facebook, Instagram, and Twitter helps build brand awareness, show your expertise, and draw people to your brand.<\/p>\n<p>Again, focus on what your client needs. Answer frequently asked questions, post videos of your employees, or show how competitive your rates are. You can also consider running Facebook and Instagram ads to get people to interact with your website.<\/p>\n<p>However, since you are not selling directly to the consumer, the best place to start would be LinkedIn. Create a great profile and stay active so you can connect prominent clients.<\/p>\n<h3>5. Email Marketing<\/h3>\n<p>With such a long sales cycle, your marketing team needs to nurture those relationships with potential clients, including through email marketing. A <a href=\"https:\/\/dma.org.uk\/uploads\/ckeditor\/National-client-email-2015.pdf\" target=\"_blank\" rel=\"nofollow\">2015 study<\/a> from the DMA showed that for every $1 spent on email, marketers gained a $38 return.<\/p>\n<p>Sending emails doesn’t mean bombarding them with mail that the lead will mark as spam. Instead, you want to send emails and newsletters periodically to companies that have already shown interest.<\/p>\n<p>Since most of your sales may not occur online, you can make your conversion goals that someone downloads white papers or signs up for your newsletter. When they go to download something, ask for their email. If they sign up for the newsletter, make sure you get their contact information to maintain a relationship with them.<\/p>\n<p>Once they have given you their email, send them emails about your latest products, trade shows, and offers. Ideally, you’ll send these every month or few weeks to keep your company name fresh in their brain.<\/p>\n<p>Remember, with a manufacturing company, making a sale is a long-term goal.<\/p>\n<h3>6. Trade Shows<\/h3>\n<p>Keep going to your trade shows! Just because you are developing a robust online presence doesn’t mean that the value of personal connections has diminished.<\/p>\n<p>In fact, the combination of online marketing and real-life connections may be just what your company needs. As previously stated, few companies will make such a large purchase on the internet. Therefore, make sure you maintain a strong personal relationship with potential clients.<\/p>\n<p>Make sure you combine the two tactics by advertising that you will be at trade shows on your website and social media. Then, when talking to potential clients, ensure they have all of your contact information from your website to your social media.<\/p>\n<h2>Start Improving Your Marketing Skills<\/h2>\n<p>The world of marketing may be changing for the manufacturing industry, but that does not mean it is impossible to create brand awareness. You can quickly increase your sales by focusing more on digital marketing and combining that to in-person sales. By implementing the above tactics, you are sure to see results.<\/p>\n<div class='incontent-cta'><h3>Most Manufacturers Struggle with Generating Leads Online...We Fix That!<\/h3><p><p>Since 2009, we have helped many Manufacturers grow strategically. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h3>Suggested Reading<\/h3>\n<ul>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/seo\/\">SEO for Manufacturers: Tips + Best Practices to Drive Revenue<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/web-design\/\">Manufacturing Web Design: Best Practices for Website Success<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/social-media\/\">Social Media Management Tips for Cutting Edge Manufacturers<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/lead-generation\/\">Effective Lead Generation Techniques for Manufacturers<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Marketing for Manufacturers: Best Tactics to Drive Results Marketing for manufacturers has changed drastically over the past couple of decades. While the focus used to be on direct mailings, trade shows, and client referrals, the incredibly quick evolution of technology has driven marketing to an online platform. How many times have you used a search [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":0,"parent":14100,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Marketing for Manufacturers: Best Tactics to Drive Results<\/title>\n<meta name=\"description\" content=\"Marketing for manufacturers has changed drastically the last 10 yrs. Learn how to change your marketing strategy to drive sustainable leads.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Manufacturing\" \/>\n<meta property=\"og:description\" content=\"Marketing for manufacturers has changed drastically the last 10 yrs. Learn how to change your marketing strategy to drive sustainable leads.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:modified_time\" content=\"2021-01-06T19:41:36+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg\",\"width\":1000,\"height\":512,\"caption\":\"autoloader in a large modern warehouse\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/\",\"name\":\"Marketing for Manufacturers: Best Tactics to Drive Results\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#primaryimage\"},\"datePublished\":\"2020-09-25T14:53:35+00:00\",\"dateModified\":\"2021-01-06T19:41:36+00:00\",\"description\":\"Marketing for manufacturers has changed drastically the last 10 yrs. Learn how to change your marketing strategy to drive sustainable leads.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Industries\",\"item\":\"https:\/\/www.highervisibility.com\/industries\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Manufacturing\"}]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Marketing for Manufacturers: Best Tactics to Drive Results","description":"Marketing for manufacturers has changed drastically the last 10 yrs. Learn how to change your marketing strategy to drive sustainable leads.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/","og_locale":"en_US","og_type":"article","og_title":"Manufacturing","og_description":"Marketing for manufacturers has changed drastically the last 10 yrs. Learn how to change your marketing strategy to drive sustainable leads.","og_url":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_modified_time":"2021-01-06T19:41:36+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg"}],"twitter_card":"summary_large_image","twitter_site":"@highervis","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2020\/09\/manufacturing-e1601044585962.jpg","width":1000,"height":512,"caption":"autoloader in a large modern warehouse"},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#webpage","url":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/","name":"Marketing for Manufacturers: Best Tactics to Drive Results","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#primaryimage"},"datePublished":"2020-09-25T14:53:35+00:00","dateModified":"2021-01-06T19:41:36+00:00","description":"Marketing for manufacturers has changed drastically the last 10 yrs. Learn how to change your marketing strategy to drive sustainable leads.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/industries\/manufacturing\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/industries\/manufacturing\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Industries","item":"https:\/\/www.highervisibility.com\/industries\/"},{"@type":"ListItem","position":3,"name":"Manufacturing"}]}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14847"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=14847"}],"version-history":[{"count":8,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14847\/revisions"}],"predecessor-version":[{"id":15132,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14847\/revisions\/15132"}],"up":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/14100"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=14847"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}