{"id":15628,"date":"2021-05-25T11:31:04","date_gmt":"2021-05-25T16:31:04","guid":{"rendered":"https:\/\/www.highervisibility.com\/?page_id=15628"},"modified":"2021-05-25T16:00:40","modified_gmt":"2021-05-25T21:00:40","slug":"web-design","status":"publish","type":"page","link":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/","title":{"rendered":"Web Design"},"content":{"rendered":"<h2>Pharma Web Design: Tips + Best Practices for Pharmaceutical Companies<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-15629 size-large\" src=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design-756x400.jpg\" alt=\"\" width=\"756\" height=\"400\" srcset=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design-756x400.jpg 756w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design-770x408.jpg 770w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design-768x407.jpg 768w, https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design.jpg 1020w\" sizes=\"(max-width: 756px) 100vw, 756px\" \/><br \/>\nAs of 2019, the <a href=\"https:\/\/www.statista.com\/statistics\/281306\/major-global-pharmaceutical-companies-based-on-pharma-revenue-2012\" target=\"_blank\" rel=\"nofollow\">top three pharmaceutical companies<\/a> in the world (by revenue) were Pfizer, Novartis, and Roche. What do those companies have in common? All three have well-built, beautifully designed, user-friendly websites.<\/p>\n<p>Building or improving your company’s website will help you stand out in the sea of pharmaceutical companies vying for consumer attention.<\/p>\n<p>So what should you know about pharma web design? And what <a href=\"https:\/\/www.highervisibility.com\/blog\/digital-marketing-career-guide-how-to-get-started\/\">digital marketing<\/a> advice will help you build a better website than your competitors?<\/p>\n<h2>Digital Marketing for Pharma Web Design<\/h2>\n<p>How do people find information about medical issues, drug side-effects, and clinical trials? In this digital age, they Google it. Without a website for your pharmaceutical company, you’re missing out on a considerable number of potential customers.<\/p>\n<p>But internet marketing for the healthcare industry is ever-changing. How can your pharmaceutical company maintain a meaningful online presence that accomplishes your goals? How can you take advantage of things like:<\/p>\n<ul>\n<li>On-page optimization<\/li>\n<li>Keyword research<\/li>\n<li>Mobile apps<\/li>\n<li>Search engines<\/li>\n<li>Email<\/li>\n<li>Website analytics<\/li>\n<li>Social media<\/li>\n<li>Business listings<\/li>\n<li>And more<\/li>\n<\/ul>\n<p>The tools and technology available to you are endless. So what’s necessary and what’s just noise? And how can you get started?<\/p>\n<h2>Visually Appealing Website Design<\/h2>\n<p>The information your pharma company provides is valuable. But without a visually appealing website design, many people might not get the chance to see it. Why?<\/p>\n<p>It takes <a href=\"https:\/\/www.tandfonline.com\/doi\/abs\/10.1080\/01449290500330448\" target=\"_blank\" rel=\"nofollow\">less than a second<\/a> for most people to form an opinion about your pharmaceutical company based on your website. That brief moment can determine whether that individual becomes a customer or exits the site. So how can you capture someone’s attention in such a short window of time?<\/p>\n<p>Novartis uses a powerful and emotionally attractive image to draw in its audience. The single line of text introduces the company, concisely explains its mission, and pairs well with the image.<\/p>\n<p>They also have a professional color scheme and theme that they maintain throughout the site. Why is color important? It increases a person’s attention span. And people are more likely to read and remember text if it’s in color instead of just black and white.<\/p>\n<p>Incorporating infographics will also help you to be more visually engaging, especially when presenting research. Researchers spend almost <a href=\"https:\/\/visme.co\/blog\/infographic-statistics\/\" target=\"_blank\" rel=\"nofollow\">40% less time searching for information<\/a> in an article with charts, colors, and other visuals. And your potential customers want to find accurate information about pharmaceuticals quickly. Infographics will help with that.<\/p>\n<p>As a pharmaceutical company, you want your website to appeal to consumers and businesses alike. And those potential customers will quickly judge your company based on what they can see in less than a second. You can increase the visual appeal of your pharmaceutical website using the following:<\/p>\n<ul>\n<li>Emotionally attractive images<\/li>\n<li>Professional color scheme<\/li>\n<li>Videos<\/li>\n<li>Icons<\/li>\n<li>Infographics<\/li>\n<\/ul>\n<h2>Quick and Easy Navigation<\/h2>\n<p>So let’s say your website is visually appealing, and it makes a great first impression. What else should you consider? Your patients, healthcare professionals, and others in the medical community have an overwhelming amount of information to sort through on a daily basis.<\/p>\n<p>If navigating your pharmaceutical website is confusing or complicated, you’re likely to lose many potential customers. A cluttered site also gives the impression that you’re unprofessional. What can you do?<\/p>\n<p>Make sure visitors can access every page on your site from the homepage. Clear navigation will ensure that they can quickly find the information they need without wasting a lot of time searching for it. As a pharmaceutical company, that can be difficult because you have a lot of information to offer.<\/p>\n<p>Note how Novartis does this. The larger, more attention-catching menu gives you everything you need to know about the company itself. But above it is a smaller menu that’s more audience-focused. If you’re a patient, a stockholder, or a healthcare professional, you’ll know exactly where to go to find the information you need.<\/p>\n<p>But it’s not just about easy access. It’s also about speed. We know that visitors are quick to judge a site, but what if they don’t even have the opportunity to see it? The slower your <a href=\"https:\/\/www.thinkwithgoogle.com\/marketing-strategies\/app-and-mobile\/mobile-page-speed-new-industry-benchmarks\/\" target=\"_blank\" rel=\"nofollow\">page load time<\/a>, the higher the bounce rate. For the best conversion rates, Google recommends that your site load in less than three seconds.<\/p>\n<p>How can you get your site to load more quickly?<\/p>\n<ul>\n<li>Compress images and text<\/li>\n<li>Minimize HTTP requests<\/li>\n<li>Decrease the average time to your first byte<\/li>\n<li>Lower the number of the individual piece of content required to show the entire page<\/li>\n<\/ul>\n<p>Google’s analysis shows that the healthcare industry generally has slower, bulkier sites. So if you can speed up your website and make navigation easy, your pharmaceutical website will stand out in the crowd.<\/p>\n<div class='incontent-cta'><h3>MOST PHARMA COMPANIES STRUGGLE WITH GENERATING NEW CLIENTS...WE FIX THAT!<\/h3><p><p>Since 2009, we have helped pharmaceutical companies grow their business. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h2>Why Optimizing for Mobile is Essential to Pharma Web Design<\/h2>\n<p>Have you ever tried to look at a website on your phone that’s not optimized for mobile? The text is too small, you have to deal with endless scrolling, and the navigation buttons are difficult to locate and click. So you quickly end up leaving the site.<\/p>\n<p>Not only is it inconvenient for the user, but search engines don&#8217;t like it either. When Google ranks your website, it reviews both mobile and desktop activity. So if you’re not optimizing your website for mobile, it loses a lot of traction.<\/p>\n<p>A mobile-optimized website completely reformats itself for different devices, screen sizes, and load times. Mobile optimization ensures that people will have the best possible experience on your website, whether they visit on their phone, tablet, or desktop. And it’s much better than a mobile-friendly site, which just compresses and rearranges a few things, so your content is still navigable.<\/p>\n<p>What does mobile optimization say about your pharmaceutical company? A mobile-friendly website indicates the acceptance of mobile devices. A mobile-optimized website shows that you’re thinking of your customers, what’s convenient for them, and how you can best cater to their needs. It means:<\/p>\n<ul>\n<li>Smaller pictures<\/li>\n<li>Bigger buttons<\/li>\n<li>Less content (results in less scrolling)<\/li>\n<li>Reasonable header size<\/li>\n<\/ul>\n<p>So how can you optimize your website for mobile? The first step is to choose a fully responsive <a href=\"https:\/\/www.highervisibility.com\/website-design\/\">web design<\/a>. What does that mean? A responsive site does a few things automatically when visitors use mobile devices. It switches your menu from a top bar to a hamburger icon that expands when you click on it. You can see this on Roche’s website.<\/p>\n<p>A responsive website will improve mobile user experience on your site, but that’s just the foundation. You’ll also want to implement structured data, which will help search engines better understand your web page’s content and purpose. The use of structured data can improve your rankings on search engine results pages (SERPs).<\/p>\n<p>Pop-ups can be an excellent tool for your pharmaceutical website, but they can be very frustrating on a mobile device if it’s too hard to figure out how to close them. If you’re determined to use pop-ups, make sure they aren’t annoying on mobile before implementing them.<\/p>\n<p>What else can you do?<\/p>\n<ul>\n<li>Use compressed images to make your site load faster over mobile.<\/li>\n<li>Identify and get rid of any text, images, or features that aren’t mobile-friendly.<\/li>\n<li>Add videos to increase engagement from mobile users.<\/li>\n<\/ul>\n<h2>Search Engine Optimization (SEO) for Pharmaceutical Companies<\/h2>\n<p>So now, you have a beautiful, user-friendly website. But how do you connect with your audience? How do you get big search engines like Google to notice you? If you’ve already implemented the steps above, you’re already well on your way. Google likes websites that are optimized for mobile, visually appealing, and easy to navigate. But in a competitive field like pharmaceuticals, this isn’t enough. So what do you need to know about search engine optimization?<\/p>\n<p>SEO is what you do to increase brand exposure and meaningful traffic to your website via search engine results. So the first question to ask yourself is, who is your audience? Who do you want to search for your company? As a pharmaceutical company, potential customers include patients, healthcare professionals, investors, and others in the medical field. You’ll need to know:<\/p>\n<ul>\n<li>What issues are they facing?<\/li>\n<li>How does your company or product(s) address their problem?<\/li>\n<li>What terms are they using to search?<\/li>\n<li>And how do they prefer to take in content (videos, detailed reports, infographics, etc.)?<\/li>\n<\/ul>\n<p>The other half of SEO has more to do with search engines and how they function. Search engines crawl, index, and rank billions of pages of web content. Your goal is to show up organically (not through paid advertising) on the first page of search results for terms that your potential customers are researching. How do you do that?<\/p>\n<ul>\n<li>Make sure your website is crawlable so search engines can easily find and index your site.<\/li>\n<li>Your content should be engaging, and it should completely address the issues that your potential customers are researching.<\/li>\n<li>Use high-value keywords in your content to capture Google’s attention.<\/li>\n<li>Create content that makes your reader want to share it, cite it, or link to it.<\/li>\n<li>Optimize your page title, URL, and meta description.<\/li>\n<li>Use structured data so that a snippet of your site will appear directly on the SERPs.<\/li>\n<\/ul>\n<p>SEO is essential to drive traffic to your pharmaceutical website. So get to know your audience, create meaningful content that answers their questions, and make sure Google can find and accurately rank that content.<\/p>\n<h2>Innovation and the Use of Technology<\/h2>\n<p>Technology is transforming the healthcare industry in unexpected ways. For an industry mostly resting on tradition, this isn’t an easy shift. But you don’t want to be left behind.<\/p>\n<p>Patients are becoming more involved in their own care. Instead of just trusting the recommendation of their doctors, patients can access pharmaceutical websites like yours directly. They can research the potential side effects of their prescriptions, other medication options, and much more.<\/p>\n<p>Creating an engaging pharmaceutical website with helpful content will drive more knowledge-hungry patients to your site.<\/p>\n<p>Pharma companies have the opportunity to create more transparency in the health industry. By analyzing data from labs, apps, insurance claims, social media, sensors, etc., you can generate more information about various drugs, increasing the confidence of patients, doctors, investors, and others.<\/p>\n<p>But this forward-moving digital world isn&#8217;t limited to information. New and emerging technology means pharmaceutical companies can offer digital services and sensors to facilitate round-the-clock tailored care. Healthcare professionals can monitor their patients and customize the way they address the patient’s medical issues.<\/p>\n<p>With the emergence of virtual care, pharmaceutical sales reps can speak to patients and medical staff anytime and anywhere. Most patients already use patient portals to access their medical records and chat with their doctor online. So they’re often familiar and comfortable with this approach.<\/p>\n<p>So don’t let technology and innovation take a backseat while building and improving your website. To stand out, show your potential customers that you’re keeping up with the times. Create content that’s informative and engaging. And build a site that leverages available healthcare technology.<\/p>\n<h2>Final Thoughts on Pharma Web Design<\/h2>\n<p>So how can you build a pharmaceutical website for your company that will help you reach your goals? Make sure your site isn’t dull. Instead, make it visually appealing so that your visitors will want to stay and learn more. You can use videos, infographics, images, and a good color scheme to draw the eye.<\/p>\n<p>And don’t lose potential customers to something as easily fixable as a confusing navigation menu or a slow-loading page. It’s also important to remember how potential customers will access your website. How will it appear and function on different devices? Both users and Google love mobile optimization.<\/p>\n<p>Do you know what else Google loves? Search engine optimization. So don’t skip out on keyword research. Finally, our digital world is moving quickly. Implementing technology and innovation in your site will ensure that you don’t get left behind.<\/p>\n<p>Pharma web design can seem daunting. But it doesn’t have to be. With the right team behind you, you can implement all of these suggestions and more in a way that improves functionality and drives organic traffic from Google to your pharmaceutical website.<\/p>\n<div class='incontent-cta'><h3>MOST PHARMA COMPANIES STRUGGLE WITH GENERATING NEW CLIENTS...WE FIX THAT!<\/h3><p><p>Since 2009, we have helped pharmaceutical companies grow their business. Let us do it for you!<\/p>\n<\/p><div class='form-action'><a class=\"button primary large scrollto\" data-target=\"lets-talk\" href=\"#\">Schedule a Consultation<\/a><\/div><\/div>\n<h3>Suggested Reading<\/h3>\n<ul>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/\">Pharma Digital Marketing: Strategies to Grow Pharma Companies<\/a><\/li>\n<li><a href=\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/seo\/\">Pharma SEO: Tips + Best Practices for Pharmaceutical Companies<\/a><\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>Pharma Web Design: Tips + Best Practices for Pharmaceutical Companies As of 2019, the top three pharmaceutical companies in the world (by revenue) were Pfizer, Novartis, and Roche. What do those companies have in common? All three have well-built, beautifully designed, user-friendly websites. Building or improving your company’s website will help you stand out in [&hellip;]<\/p>\n","protected":false},"author":16,"featured_media":0,"parent":15617,"menu_order":0,"comment_status":"closed","ping_status":"closed","template":"","meta":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v17.0 (Yoast SEO v17.0) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Pharma Web Design: Tips + Best Practices for Pharmaceutical Companies<\/title>\n<meta name=\"description\" content=\"Learn how to create pharmaceutical-specific websites that will rank high on search engines, convert readers into leads and customers, and help your business grow.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Web Design\" \/>\n<meta property=\"og:description\" content=\"Learn how to create pharmaceutical-specific websites that will rank high on search engines, convert readers into leads and customers, and help your business grow.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/\" \/>\n<meta property=\"og:site_name\" content=\"HigherVisibility\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/highervisibility\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-25T21:00:40+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design-756x400.jpg\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:site\" content=\"@highervis\" \/>\n<meta name=\"twitter:label1\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data1\" content=\"10 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"WebSite\",\"@id\":\"https:\/\/www.highervisibility.com\/#website\",\"url\":\"https:\/\/www.highervisibility.com\/\",\"name\":\"HigherVisibility\",\"description\":\"SEO Company | Search Marketing Services\",\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/www.highervisibility.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"ImageObject\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#primaryimage\",\"inLanguage\":\"en-US\",\"url\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design.jpg\",\"contentUrl\":\"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design.jpg\",\"width\":1020,\"height\":540},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#webpage\",\"url\":\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/\",\"name\":\"Pharma Web Design: Tips + Best Practices for Pharmaceutical Companies\",\"isPartOf\":{\"@id\":\"https:\/\/www.highervisibility.com\/#website\"},\"primaryImageOfPage\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#primaryimage\"},\"datePublished\":\"2021-05-25T16:31:04+00:00\",\"dateModified\":\"2021-05-25T21:00:40+00:00\",\"description\":\"Learn how to create pharmaceutical-specific websites that will rank high on search engines, convert readers into leads and customers, and help your business grow.\",\"breadcrumb\":{\"@id\":\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Home\",\"item\":\"https:\/\/www.highervisibility.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Industries\",\"item\":\"https:\/\/www.highervisibility.com\/industries\/\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"Pharmaceutical\",\"item\":\"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/\"},{\"@type\":\"ListItem\",\"position\":4,\"name\":\"Web Design\"}]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Pharma Web Design: Tips + Best Practices for Pharmaceutical Companies","description":"Learn how to create pharmaceutical-specific websites that will rank high on search engines, convert readers into leads and customers, and help your business grow.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/","og_locale":"en_US","og_type":"article","og_title":"Web Design","og_description":"Learn how to create pharmaceutical-specific websites that will rank high on search engines, convert readers into leads and customers, and help your business grow.","og_url":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/","og_site_name":"HigherVisibility","article_publisher":"https:\/\/www.facebook.com\/highervisibility","article_modified_time":"2021-05-25T21:00:40+00:00","og_image":[{"url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design-756x400.jpg"}],"twitter_card":"summary_large_image","twitter_site":"@highervis","twitter_misc":{"Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"WebSite","@id":"https:\/\/www.highervisibility.com\/#website","url":"https:\/\/www.highervisibility.com\/","name":"HigherVisibility","description":"SEO Company | Search Marketing Services","potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/www.highervisibility.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"ImageObject","@id":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#primaryimage","inLanguage":"en-US","url":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design.jpg","contentUrl":"https:\/\/www.highervisibility.com\/wp-content\/uploads\/2021\/05\/pharma-web-design.jpg","width":1020,"height":540},{"@type":"WebPage","@id":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#webpage","url":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/","name":"Pharma Web Design: Tips + Best Practices for Pharmaceutical Companies","isPartOf":{"@id":"https:\/\/www.highervisibility.com\/#website"},"primaryImageOfPage":{"@id":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#primaryimage"},"datePublished":"2021-05-25T16:31:04+00:00","dateModified":"2021-05-25T21:00:40+00:00","description":"Learn how to create pharmaceutical-specific websites that will rank high on search engines, convert readers into leads and customers, and help your business grow.","breadcrumb":{"@id":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/web-design\/#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/www.highervisibility.com\/"},{"@type":"ListItem","position":2,"name":"Industries","item":"https:\/\/www.highervisibility.com\/industries\/"},{"@type":"ListItem","position":3,"name":"Pharmaceutical","item":"https:\/\/www.highervisibility.com\/industries\/pharmaceutical\/"},{"@type":"ListItem","position":4,"name":"Web Design"}]}]}},"_links":{"self":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/15628"}],"collection":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages"}],"about":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/types\/page"}],"author":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/users\/16"}],"replies":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/comments?post=15628"}],"version-history":[{"count":4,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/15628\/revisions"}],"predecessor-version":[{"id":15652,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/15628\/revisions\/15652"}],"up":[{"embeddable":true,"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/pages\/15617"}],"wp:attachment":[{"href":"https:\/\/www.highervisibility.com\/wp-json\/wp\/v2\/media?parent=15628"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}